{
  "an-blurbs:an3.1": "Fools are dangerous, but the wise are safe.",
  "an-blurbs:an3.2": "Marks of a fool and an astute person: body, speech, and mind.",
  "an-blurbs:an3.3": "Marks of a fool and an astute person: thinking, speaking, and doing.",
  "an-blurbs:an3.4": "Marks of a fool and an astute person: recognizing mistakes.",
  "an-blurbs:an3.5": "Marks of a fool and an astute person: asking questions.",
  "an-blurbs:an3.6": "Marks of a fool and an astute person: wholesome and unwholesome.",
  "an-blurbs:an3.7": "Marks of a fool and an astute person: blameworthy and blameless.",
  "an-blurbs:an3.8": "Marks of a fool and an astute person: hurtful and kind.",
  "an-blurbs:an3.9": "Marks of a fool and an astute person: keeping your mind healthy.",
  "an-blurbs:an3.10": "Immorality, envy, and meanness determine rebirth.",
  "an-blurbs:an3.11": "What well-known mendicants should encourage.",
  "an-blurbs:an3.12": "Places that should be commemorated by kings and mendicants.",
  "an-blurbs:an3.13": "People who are hopeless, hopeful, and have done away with hope.",
  "an-blurbs:an3.14": "Wheel-turning Monarchs and Buddhas both rely on principle as authority.",
  "an-blurbs:an3.15": "Quality takes time: the parable of the chariot-maker.",
  "an-blurbs:an3.16": "Practices that can’t fail.",
  "an-blurbs:an3.17": "Hurting yourself and others.",
  "an-blurbs:an3.18": "Spiritual practice isn’t for rebirth in heaven.",
  "an-blurbs:an3.19": "Shopkeepers and mendicants both have to work hard.",
  "an-blurbs:an3.20": "Shopkeepers and mendicants both have to be clever, responsible, and well supported.",
  "an-blurbs:an3.21": "Of various individuals on the path, which is best?",
  "an-blurbs:an3.22": "Healing the body, healing the mind. Everyone should be treated, even if they don’t recover.",
  "an-blurbs:an3.23": "Hurtful or pleasing choices lead to hurtful or pleasing experiences in future lives.",
  "an-blurbs:an3.24": "Three people who are very helpful.",
  "an-blurbs:an3.25": "A mind like an open sore, like lightning, and like a diamond.",
  "an-blurbs:an3.26": "You should associate with people who are equal or better than you.",
  "an-blurbs:an3.27": "Who to associate with, and who to shun.",
  "an-blurbs:an3.28": "Speech like dung, like flowers, and like honey.",
  "an-blurbs:an3.29": "Being spiritually blind, one-eyed, or with two eyes.",
  "an-blurbs:an3.30": "How to make the wisdom of hearing Dharma last when the talk is over.",
  "an-blurbs:an3.31": "Parents should be honored like Brahmā.",
  "an-blurbs:an3.32": "Could there be a state of convergence with no sense of self?",
  "an-blurbs:an3.33": "Even the Buddha found it hard to get students to understand.",
  "an-blurbs:an3.34": "Greed, hate, and delusion, and their opposites, are like seeds.",
  "an-blurbs:an3.35": "The Buddha sleeps well, even on the cold, hard ground.",
  "an-blurbs:an3.36": "The god of death questions us, but we are punished by our own deeds.",
  "an-blurbs:an3.37": "The gods rejoice when they see people practicing well.",
  "an-blurbs:an3.38": "One should aspire to be like an awakened mendicant, not like Sakka.",
  "an-blurbs:an3.39": "Siddhattha’s delicate upbringing.",
  "an-blurbs:an3.40": "Practicing with yourself in charge, or with others, or the teaching.",
  "an-blurbs:an3.41": "Factors in making good karma.",
  "an-blurbs:an3.42": "How to know a faithful person.",
  "an-blurbs:an3.43": "The advantages of teaching Dharma.",
  "an-blurbs:an3.44": "Teachers and audience should have understanding.",
  "an-blurbs:an3.45": "Giving, going forth, and caring for parents are praised.",
  "an-blurbs:an3.46": "Villagers make good karma when good mendicants are there.",
  "an-blurbs:an3.47": "The difference between conditioned and unconditioned.",
  "an-blurbs:an3.48": "A family is supported by their head, as a tree is supported by a mountain.",
  "an-blurbs:an3.49": "Being keen in three ways.",
  "an-blurbs:an3.50": "Why a mendicant is like a thief.",
  "an-blurbs:an3.51": "You can begin to practice even late in life: advice to elderly brahmins.",
  "an-blurbs:an3.52": "You can begin to practice even late in life: advice to elderly brahmins.",
  "an-blurbs:an3.53": "How is the teaching realizable in this very life?",
  "an-blurbs:an3.54": "How is the teaching realizable in this very life?",
  "an-blurbs:an3.55": "How is extinguishment realizable in this very life?",
  "an-blurbs:an3.56": "Why has the world become depopulated?",
  "an-blurbs:an3.57": "The Buddha is accused of soliciting gifts for his community only.",
  "an-blurbs:an3.58": "A master of Vedic knowledge in the brahmanical system and in the Buddha’s.",
  "an-blurbs:an3.59": "A master of Vedic knowledge in the brahmanical system and in the Buddha’s.",
  "an-blurbs:an3.60": "A brahmin argues that a sacrifice is less selfish than the mendicant’s life. And the king’s men are deploring the decline in psychic abilities among the Saṅgha.",
  "an-blurbs:an3.61": "The beliefs that everything is caused by past karma, by a creator God, or by chance all lead to inaction. The Buddha teaches dependent origination.",
  "an-blurbs:an3.62": "Perils that tear mothers and children apart.",
  "an-blurbs:an3.63": "The high and luxurious beds that the Buddha uses.",
  "an-blurbs:an3.64": "A recently disrobed monk boasts of knowing everything about the Buddha’s teaching.",
  "an-blurbs:an3.65": "How to navigate among different spiritual opinions.",
  "an-blurbs:an3.66": "How to navigate among different spiritual opinions.",
  "an-blurbs:an3.67": "Assessing whether someone is fit to hold a discussion.",
  "an-blurbs:an3.68": "The differences between greed, hate, and delusion.",
  "an-blurbs:an3.69": "Unwholesome roots create unwholesome actions, and lead to suffering.",
  "an-blurbs:an3.70": "The uposatha observance day of the cowherds, the Jains, and the Buddha.",
  "an-blurbs:an3.71": "Why should we give up greed, hate, and delusion?",
  "an-blurbs:an3.72": "Who has good teaching and practice?",
  "an-blurbs:an3.73": "Does convergence come first, or knowledge?",
  "an-blurbs:an3.74": "Do we purify ourselves by wearing out old karma?",
  "an-blurbs:an3.75": "How to encourage and support those close to you.",
  "an-blurbs:an3.76": "How consciousness, karma, and craving create and sustain future lives.",
  "an-blurbs:an3.77": "How consciousness, karma, and craving create and sustain future lives, with an emphasis on intention.",
  "an-blurbs:an3.78": "Not all spiritual paths are of equal value.",
  "an-blurbs:an3.79": "Some fragrances spread even against the wind.",
  "an-blurbs:an3.80": "Ānanda gets the Buddha to talk about the scale of the universe.",
  "an-blurbs:an3.81": "The duties of an ascetic.",
  "an-blurbs:an3.82": "A donkey tries to moo like a cow. It doesn’t end well.",
  "an-blurbs:an3.83": "The duties of a farmer are like those of a mendicant.",
  "an-blurbs:an3.84": "What to do if you can’t keep all the rules.",
  "an-blurbs:an3.85": "What exactly is a “trainee”?",
  "an-blurbs:an3.86": "Even spiritually advanced people can break minor rules.",
  "an-blurbs:an3.87": "Even spiritually advanced people can break minor rules.",
  "an-blurbs:an3.88": "Even spiritually advanced people can break minor rules.",
  "an-blurbs:an3.89": "The three trainings explained, to seeing the truths.",
  "an-blurbs:an3.90": "The three trainings explained, to perfection.",
  "an-blurbs:an3.91": "A monk is critical of the Buddha, but later feels remorse.",
  "an-blurbs:an3.92": "Neither a farmer or a mendicant makes their work bear fruit any faster just by wishing for it.",
  "an-blurbs:an3.93": "Seclusion as depicted in other paths and by the Buddha.",
  "an-blurbs:an3.94": "The clarity of stream-entry is like a cloudless spring sky.",
  "an-blurbs:an3.95": "Assemblies that are the best, or divided, or harmonious. A harmonious assembly lead the mind to happiness and stillness.",
  "an-blurbs:an3.96": "A mendicant is beautiful, strong, and fast like a thoroughbred horse: to seeing the truths.",
  "an-blurbs:an3.97": "A mendicant is beautiful, strong, and fast like a thoroughbred horse: to non-return.",
  "an-blurbs:an3.98": "A mendicant is beautiful, strong, and fast like a thoroughbred horse: to perfection.",
  "an-blurbs:an3.99": "A bad mendicant is ugly and rough like jute canvas.",
  "an-blurbs:an3.100": "If deeds were experienced exactly as performed, there could be no spiritual practice.",
  "an-blurbs:an3.101": "Meditation is like purifying gold. A meditator should progressively eliminate more refined corruptions.",
  "an-blurbs:an3.102": "Meditation is like purifying gold. A meditator should focus on different aspects at different times in order to proceed smoothly.",
  "an-blurbs:an3.103": "Before awakening, Siddhattha reflected on gratification, danger and escape in the world.",
  "an-blurbs:an3.104": "The Buddha became awakened by understanding gratification, danger and escape.",
  "an-blurbs:an3.105": "Gratification, danger and escape are essential to both binding and freeing.",
  "an-blurbs:an3.106": "Real ascetics understand gratification, danger and escape.",
  "an-blurbs:an3.107": "Song, dance, and laughter.",
  "an-blurbs:an3.108": "Indulgences never satisfy.",
  "an-blurbs:an3.109": "Protecting your mind is like protecting a house.",
  "an-blurbs:an3.110": "A simile of a collapsing house.",
  "an-blurbs:an3.111": "Sources of deeds: greed, hate, and delusion.",
  "an-blurbs:an3.112": "Sources of deeds: past, present, future.",
  "an-blurbs:an3.113": "Hypocrisy leads to downfall.",
  "an-blurbs:an3.114": "Three people hard to find.",
  "an-blurbs:an3.115": "People who are easy to measure, hard to measure, and immeasurable.",
  "an-blurbs:an3.116": "Rebirth in the formless realms, for ordinary people and for disciples of the Buddha.",
  "an-blurbs:an3.117": "Failure or success in morality, mind, and view.",
  "an-blurbs:an3.118": "Failure or success in morality, mind, and view is like loaded dice.",
  "an-blurbs:an3.119": "Failure or success in action, livelihood, and view.",
  "an-blurbs:an3.120": "Purity of body, speech, and mind.",
  "an-blurbs:an3.121": "Purity of body, speech, and mind, with understanding the five hindrances.",
  "an-blurbs:an3.122": "Sagacity of body, speech, and mind.",
  "an-blurbs:an3.123": "What a mendicant thinks about the food they’re offered.",
  "an-blurbs:an3.124": "When mendicants fight, the Buddha doesn’t like it.",
  "an-blurbs:an3.125": "The Buddha teaches a simple but powerful message: his teaching is from personal experience, and it works.",
  "an-blurbs:an3.126": "The Buddha discusses different kinds of teachers while staying at a hermitage near his home town of Kapilavatthu.",
  "an-blurbs:an3.127": "A god from the Pure Abodes visits the Buddha, and complains about how busy he is.",
  "an-blurbs:an3.128": "The Buddha helps a monk in distress by teaching of “bitterness”, “rotting flesh”, and “flies”.",
  "an-blurbs:an3.129": "Anuruddha asks the Buddha what leads women to bad rebirth.",
  "an-blurbs:an3.130": "Anuruddha complains of not being awakened.",
  "an-blurbs:an3.131": "Three things shine in the open: the moon, the sun, and the teachings of the Buddha.",
  "an-blurbs:an3.132": "A line drawn in stone, sand, or water.",
  "an-blurbs:an3.133": "Three ways a mendicant is like a king’s warrior.",
  "an-blurbs:an3.134": "Educated in fancy talk, in questioning, or to the fullest extent.",
  "an-blurbs:an3.135": "A good friend does what’s hard.",
  "an-blurbs:an3.136": "Impermanence, suffering, and not-self are natural laws discovered by the Buddha.",
  "an-blurbs:an3.137": "The teacher called Makkhali is the worst of all, like a hair blanket.",
  "an-blurbs:an3.138": "Success in faith, morality, and wisdom.",
  "an-blurbs:an3.139": "Growth in faith, morality, and wisdom.",
  "an-blurbs:an3.140": "Training people is like training wild horses.",
  "an-blurbs:an3.141": "Training people is like training good horses.",
  "an-blurbs:an3.142": "Training people is like training thoroughbred horses.",
  "an-blurbs:an3.143": "The ultimate end, the ultimate sanctuary, the ultimate spiritual life, the ultimate goal: the three trainings.",
  "an-blurbs:an3.144": "The ultimate end, the ultimate sanctuary, the ultimate spiritual life, the ultimate goal: the three wonders.",
  "an-blurbs:an3.145": "The ultimate end, the ultimate sanctuary, the ultimate spiritual life, the ultimate goal: view, knowledge, freedom.",
  "an-blurbs:an3.146": "Wholesome and unwholesome deeds determine rebirth.",
  "an-blurbs:an3.147": "Blameless and blameworthy deeds determine rebirth.",
  "an-blurbs:an3.148": "Ethical and unethical deeds determine rebirth.",
  "an-blurbs:an3.149": "Pure and impure deeds determine rebirth.",
  "an-blurbs:an3.150": "Wholesome deeds keep you whole.",
  "an-blurbs:an3.151": "Blameless deeds keep you whole.",
  "an-blurbs:an3.152": "Ethical deeds keep you whole.",
  "an-blurbs:an3.153": "Pure deeds keep you whole.",
  "an-blurbs:an3.154": "Kinds of homage: body, speech, and mind.",
  "an-blurbs:an3.155": "A good morning, a good afternoon, a good evening.",
  "an-blurbs:an3.156": "The addicted practice, the scorching practice, the middle practice.",
  "an-blurbs:an4.1": "Both the Buddha and his disciples have been reborn for a long time due to ignorance.",
  "an-blurbs:an4.2": "Without morality, convergence, wisdom, and freedom, one has fallen from the teaching.",
  "an-blurbs:an4.3": "After reflection, you should criticize those worthy or criticism, and praise those worthy of praise.",
  "an-blurbs:an4.4": "You harm yourself by acting badly towards parents, the Buddha, and spiritual practitioners.",
  "an-blurbs:an4.5": "A person who goes with the stream; a person who goes against the stream; a stable person; and one who has crossed over.",
  "an-blurbs:an4.6": "Learning the texts and getting the point of learning.",
  "an-blurbs:an4.7": "A monk, nun, laywoman, and layman who light up the Saṅgha.",
  "an-blurbs:an4.8": "Because of his spiritual attainments and practice, a Buddha is supremely self-confident.",
  "an-blurbs:an4.9": "Sources of craving for mendicants.",
  "an-blurbs:an4.10": "The yokes of sensual pleasures, future lives, views, and ignorance.",
  "an-blurbs:an4.11": "A mendicant gets rid of unwholesome states right away, in whatever posture they happen to be in.",
  "an-blurbs:an4.12": "Morality and further practice of eliminating hindrances in all postures.",
  "an-blurbs:an4.13": "The four right efforts: to prevent, to give up, to develop, and to preserve.",
  "an-blurbs:an4.14": "The endeavors to restrain, to give up, to develop, and to preserve.",
  "an-blurbs:an4.15": "The foremost in body, sensuality, dominion, and spiritual development.",
  "an-blurbs:an4.16": "Subtlety of form, feeling, perception, and choices.",
  "an-blurbs:an4.17": "Making decisions prejudiced by favoritism, hostility, stupidity, and cowardice.",
  "an-blurbs:an4.18": "Making decisions unprejudiced by favoritism, hostility, stupidity, and cowardice.",
  "an-blurbs:an4.19": "Making decisions prejudiced and unprejudiced by favoritism, hostility, stupidity, and cowardice.",
  "an-blurbs:an4.20": "Allocating meals prejudiced by favoritism, hostility, stupidity, and cowardice.",
  "an-blurbs:an4.21": "Who should the Buddha revere?",
  "an-blurbs:an4.22": "What qualifies you as a senior.",
  "an-blurbs:an4.23": "Why the Buddha is called the Realized One.",
  "an-blurbs:an4.24": "The Buddha knows what can be known, and remains poised in the midst of the world.",
  "an-blurbs:an4.25": "This spiritual life is lived for the sake of restraint, giving up, fading away, and stopping.",
  "an-blurbs:an4.26": "Mendicants who are deceivers, stubborn, flatterers, frauds, insolent, and scattered: they are no mendicants of the Buddha.",
  "an-blurbs:an4.27": "A mendicant should be content with trifles that are easy to get hold of.",
  "an-blurbs:an4.28": "Contentment with any old robe, alms-food, lodgings, and love of meditation: these are ancient traditions of the noble ones.",
  "an-blurbs:an4.29": "Contentment, good will, mindfulness and convergence are basic principles.",
  "an-blurbs:an4.30": "A discussion with some wanderers on the basic principles.",
  "an-blurbs:an4.31": "Living in a suitable region, relying on good people, right determination, and past good karma.",
  "an-blurbs:an4.32": "Inclusiveness through giving, kind speech, taking care, and impartiality.",
  "an-blurbs:an4.33": "A lion’s roar terrifies beasts. The Buddha’s teaching terrifies the gods.",
  "an-blurbs:an4.34": "Confidence in the Buddha, the path, the Dharma, and the Saṅgha are the best kinds of confidence.",
  "an-blurbs:an4.35": "A great man as understood by brahmins and by the Buddha.",
  "an-blurbs:an4.36": "The brahmin Doṇa is filled with wonder when he sees the Buddha’s footprints.",
  "an-blurbs:an4.37": "A mendicant who has morality, guards the sense doors, eats in moderation, and is committed to wakefulness can’t decline.",
  "an-blurbs:an4.38": "A mendicant has eliminated idiosyncratic interpretations of the truth, has totally given up searching, has tranquilized bodily activity, and is said to be ‘withdrawn’.",
  "an-blurbs:an4.39": "The Buddha criticizes violent sacrifice, but not non-violent giving.",
  "an-blurbs:an4.40": "The Buddha criticizes violent sacrifice, but not non-violent giving.",
  "an-blurbs:an4.41": "Developing convergence for pleasure, understanding, mindfulness, and ending defilements.",
  "an-blurbs:an4.42": "Answering questions definitively, analytically, with a counter-question, or setting it aside.",
  "an-blurbs:an4.43": "Valuing anger, or denigration, or material possessions, or honor, or valuing the true teaching.",
  "an-blurbs:an4.44": "Valuing anger, or denigration, or material possessions, or honor, or valuing the true teaching.",
  "an-blurbs:an4.45": "The god Rohitassa tells how he tried to go to the end of the world.",
  "an-blurbs:an4.46": "The Buddha relates the story of Rohitassa.",
  "an-blurbs:an4.47": "The sky and earth and very far apart. What’s further apart?",
  "an-blurbs:an4.48": "The Buddha praises the teaching of the monk Visākha.",
  "an-blurbs:an4.49": "Distortions of perception, mind, and view.",
  "an-blurbs:an4.50": "Four things obscure the sun and moon, so they don’t shine and glow and radiate. And four things corrupt mendicants: alcohol, sex, money, wrong livelihood.",
  "an-blurbs:an4.51": "When a mendicant meditates using an offering, merit overflows for the donor.",
  "an-blurbs:an4.52": "When a mendicant has confidence and morality, merit overflows for the donor.",
  "an-blurbs:an4.53": "Living with gods and zombies.",
  "an-blurbs:an4.54": "Living with gods and zombies.",
  "an-blurbs:an4.55": "How a married couple can stay together in this life and the next.",
  "an-blurbs:an4.56": "How a married couple can stay together in this life and the next.",
  "an-blurbs:an4.57": "Long life, beauty, happiness, and strength.",
  "an-blurbs:an4.58": "Long life, beauty, happiness, and strength.",
  "an-blurbs:an4.59": "Long life, beauty, happiness, and strength.",
  "an-blurbs:an4.60": "A lay disciple serves the mendicant Saṅgha with robes, alms-food, lodgings, and medicines.",
  "an-blurbs:an4.61": "Four things that are desirable, but hard to get; and how to get them through deeds of substance.",
  "an-blurbs:an4.62": "The happiness of ownership, using wealth, debtlessness, and blamelessness.",
  "an-blurbs:an4.63": "A family where the children honor their parents in their home is said to live with Brahmā.",
  "an-blurbs:an4.64": "Breaking precepts leads to hell.",
  "an-blurbs:an4.65": "Estimating others based on appearance, voice, austerity, and principle.",
  "an-blurbs:an4.66": "The greedy, the hateful, the delusional, and the conceited.",
  "an-blurbs:an4.67": "Spreading loving-kindness to snakes and other creatures.",
  "an-blurbs:an4.68": "Possessions, honor, and popularity came to Devadatta for his own ruin and downfall.",
  "an-blurbs:an4.69": "The endeavors to restrain, to give up, to develop, and to preserve.",
  "an-blurbs:an4.70": "Corruption of the realm follows corruption of the king.",
  "an-blurbs:an4.71": "Unfailing practices: morality, learning, energy, and wisdom.",
  "an-blurbs:an4.72": "Unfailing practices: thoughts of renunciation, good will, and kindness; and right view.",
  "an-blurbs:an4.73": "Speaking well and ill of others.",
  "an-blurbs:an4.74": "The best morality, convergence, wisdom, and freedom.",
  "an-blurbs:an4.75": "The best form, feeling, perception, and state of existence.",
  "an-blurbs:an4.76": "As he lay dying, the Buddha encouraged his disciples to ask any last questions.",
  "an-blurbs:an4.77": "If you try to think about these things you will go mad or get frustrated.",
  "an-blurbs:an4.78": "Four ways of purifying an offering to a teacher.",
  "an-blurbs:an4.79": "Why for different people the same kind of business undertaking might fail or succeed.",
  "an-blurbs:an4.80": "Ānanda asks the Buddha why females don’t attend council meetings, undertake business, or travel to Persia.",
  "an-blurbs:an4.81": "Precepts lead to heaven or hell.",
  "an-blurbs:an4.82": "Wrong or right speech leads to heaven or hell.",
  "an-blurbs:an4.83": "Criticizing and praising leads to heaven or hell.",
  "an-blurbs:an4.84": "Valuing defilements above the Dharma leads to hell.",
  "an-blurbs:an4.85": "The dark bound for darkness, the dark bound for light, the light bound for darkness, and the light bound for light.",
  "an-blurbs:an4.86": "One sunk low who sinks lower, one sunk low who rises high, one risen high who sinks low, and one risen high who rises higher.",
  "an-blurbs:an4.87": "The confirmed ascetic, the white lotus ascetic, the pink lotus ascetic, and the refined ascetic of ascetics.",
  "an-blurbs:an4.88": "The confirmed ascetic, the white lotus ascetic, the pink lotus ascetic, and the refined ascetic of ascetics.",
  "an-blurbs:an4.89": "The confirmed ascetic, the white lotus ascetic, the pink lotus ascetic, and the refined ascetic of ascetics.",
  "an-blurbs:an4.90": "The confirmed ascetic, the white lotus ascetic, the pink lotus ascetic, and the refined ascetic of ascetics.",
  "an-blurbs:an4.91": "Demons and gods.",
  "an-blurbs:an4.92": "Serenity and discernment.",
  "an-blurbs:an4.93": "Serenity and discernment should be developed.",
  "an-blurbs:an4.94": "To develop serenity and discernment, you should ask experienced practitioners.",
  "an-blurbs:an4.95": "Practice to help yourself and others.",
  "an-blurbs:an4.96": "Practice to help yourself and others.",
  "an-blurbs:an4.97": "Practice to help yourself and others.",
  "an-blurbs:an4.98": "Practice to help yourself and others.",
  "an-blurbs:an4.99": "Practice to help yourself and others.",
  "an-blurbs:an4.100": "Which is better: appropriate praise and criticism, or equanimity?",
  "an-blurbs:an4.101": "Four people similar to clouds.",
  "an-blurbs:an4.102": "Four people similar to clouds.",
  "an-blurbs:an4.103": "Four people similar to pots.",
  "an-blurbs:an4.104": "Four people similar to ponds.",
  "an-blurbs:an4.105": "Four people similar to mangoes.",
  "an-blurbs:an4.106": "This is a ghost sutta: there is no text for it in any available editions. However, the summary verse at the end of  the chapter (AN 4.110) mentions “two on mangoes”. The commentary notes the existence of a discourse here, but merely says that its meaning is clear. A note in the VRI edition says that there is a reading that has <i lang='pi' translate='no'>obhāsa</i> where the previous sutta has <i lang='pi' translate='no'>vaṇṇa</i>.",
  "an-blurbs:an4.107": "Four people similar to mice.",
  "an-blurbs:an4.108": "Four people similar to oxen.",
  "an-blurbs:an4.109": "Four people similar to trees.",
  "an-blurbs:an4.110": "Four people similar to vipers.",
  "an-blurbs:an4.111": "Guiding people like horses: sometimes, strictly, sometimes gently. And sometimes you have to kill them.",
  "an-blurbs:an4.112": "A mendicant is like a king’s thoroughbred.",
  "an-blurbs:an4.113": "A thoroughbred responds when it sees the goad. So does a mendicant.",
  "an-blurbs:an4.114": "A mendicant is like a king’s elephant.",
  "an-blurbs:an4.115": "Things that are pleasant or unpleasant, harmful or beneficial.",
  "an-blurbs:an4.116": "Don’t neglect good conduct.",
  "an-blurbs:an4.117": "Practice in your own way.",
  "an-blurbs:an4.118": "Four inspiring places to visit.",
  "an-blurbs:an4.119": "The perils of birth, old age, sickness, and death.",
  "an-blurbs:an4.120": "The perils of fire, water, kings, and bandits.",
  "an-blurbs:an4.121": "The fears of guilt, shame, punishment, and rebirth in a bad place.",
  "an-blurbs:an4.122": "The risks of waves, crocodiles, whirlpools, and sharks.",
  "an-blurbs:an4.123": "Length of rebirth in various exalted realms.",
  "an-blurbs:an4.124": "Contemplating jhānas with wisdom.",
  "an-blurbs:an4.125": "Rebirth in Brahmā realms from divine abiding meditations.",
  "an-blurbs:an4.126": "Contemplating divine abiding meditations with wisdom.",
  "an-blurbs:an4.127": "The Buddha illuminates even interstellar space, so that beings reborn there see each other.",
  "an-blurbs:an4.128": "Even in a world full of attachment, people listen to the Buddha’s teaching.",
  "an-blurbs:an4.129": "Monks, nuns, laywomen, and laymen love to hear Dharma from Ānanda.",
  "an-blurbs:an4.130": "Monks, nuns, laywomen, and laymen love to hear Dharma from Ānanda.",
  "an-blurbs:an4.131": "People who have given up various fetters.",
  "an-blurbs:an4.132": "Speaking on topic and fluently.",
  "an-blurbs:an4.133": "One who understands immediately, one who understands after detailed explanation, one who needs personal guidance, and one who merely learns by rote.",
  "an-blurbs:an4.134": "Living on the fruit of effort or of past karma.",
  "an-blurbs:an4.135": "The blameworthy, the mostly blameworthy, the slightly blameworthy, and the blameless.",
  "an-blurbs:an4.136": "Fulfilling morality, convergence, and wisdom.",
  "an-blurbs:an4.137": "Valuing morality, convergence, and wisdom.",
  "an-blurbs:an4.138": "Retreat of body and mind.",
  "an-blurbs:an4.139": "Good and bad Dharma speakers, and their followings.",
  "an-blurbs:an4.140": "Having things to say, and saying them well.",
  "an-blurbs:an4.141": "The brightness of the moon, sun, fire, and wisdom.",
  "an-blurbs:an4.142": "The radiance of the moon, sun, fire, and wisdom.",
  "an-blurbs:an4.143": "The lights of the moon, sun, fire, and wisdom.",
  "an-blurbs:an4.144": "The shining of the moon, sun, fire, and wisdom.",
  "an-blurbs:an4.145": "The lamps of the moon, sun, fire, and wisdom.",
  "an-blurbs:an4.146": "A time for listening to the teaching, a time for discussing the teaching, a time for serenity, and a time for discernment.",
  "an-blurbs:an4.147": "A time for listening to the teaching, a time for discussing the teaching, a time for serenity, and a time for discernment.",
  "an-blurbs:an4.148": "Speech that’s lying, divisive, harsh, or meaningless.",
  "an-blurbs:an4.149": "Speech that’s true, harmonious, gentle, and meaningful.",
  "an-blurbs:an4.150": "Morality, convergence, wisdom, and freedom are essentials.",
  "an-blurbs:an4.151": "The faculties of faith, energy, mindfulness, and convergence.",
  "an-blurbs:an4.152": "The powers of faith, energy, mindfulness, and convergence.",
  "an-blurbs:an4.153": "The powers of wisdom, energy, blamelessness, and inclusiveness.",
  "an-blurbs:an4.154": "The powers of mindfulness, convergence, blamelessness, and inclusiveness.",
  "an-blurbs:an4.155": "The powers of reflection, development, blamelessness, and inclusiveness.",
  "an-blurbs:an4.156": "It’s not easy to measure the length of an eon.",
  "an-blurbs:an4.157": "Physical health is easier than mental health.",
  "an-blurbs:an4.158": "Signs of decline: much greed, much hate, and much delusion; and wisdom doesn’t go deep.",
  "an-blurbs:an4.159": "A nun fakes illness as a pretext to seduce Ānanda.",
  "an-blurbs:an4.160": "Things that lead to the disappearance of the Dharma.",
  "an-blurbs:an4.161": "Painful practice with slow insight, painful practice with swift insight, pleasant practice with slow insight, and pleasant practice with swift insight: in brief.",
  "an-blurbs:an4.162": "Painful practice with slow insight, painful practice with swift insight, pleasant practice with slow insight, and pleasant practice with swift insight: in detail.",
  "an-blurbs:an4.163": "Painful practice with slow insight, painful practice with swift insight, pleasant practice with slow insight, and pleasant practice with swift insight: in detail.",
  "an-blurbs:an4.164": "Impatient practice, patient practice, taming practice, and calming practice.",
  "an-blurbs:an4.165": "Impatient practice, patient practice, taming practice, and calming practice.",
  "an-blurbs:an4.166": "Painful practice with slow insight, painful practice with swift insight, pleasant practice with slow insight, and pleasant practice with swift insight: which is best?",
  "an-blurbs:an4.167": "Sāriputta and Moggallāna discuss their practice.",
  "an-blurbs:an4.168": "Sāriputta and Moggallāna discuss their practice.",
  "an-blurbs:an4.169": "Getting awakened either with or without extra effort.",
  "an-blurbs:an4.170": "Ways of practicing serenity and discernment.",
  "an-blurbs:an4.171": "Intention and its results.",
  "an-blurbs:an4.172": "Sāriputta realized the four kinds of textual analysis a fortnight after he ordained.",
  "an-blurbs:an4.173": "When the senses end, is there anything left? Or is that just proliferation?",
  "an-blurbs:an4.174": "When the senses end, is there anything left? Or is that just proliferation?",
  "an-blurbs:an4.175": "A “terminator” is someone who has made an end of suffering. But are they defined by knowledge or conduct?",
  "an-blurbs:an4.176": "Leading examples for the four assemblies.",
  "an-blurbs:an4.177": "A teaching to Rāhula, the Buddha’s son, on the four elements.",
  "an-blurbs:an4.178": "Meditative attainments don’t always lead to letting go of the attachment to self.",
  "an-blurbs:an4.179": "Why only some people realize Nirvana in this life.",
  "an-blurbs:an4.180": "How to determine what is an authentic teaching of the Buddha.",
  "an-blurbs:an4.181": "How a mendicant is like a warrior.",
  "an-blurbs:an4.182": "There are some things no-one can guarantee.",
  "an-blurbs:an4.183": "What we say should never go beyond what we know; but it must also be meanungful.",
  "an-blurbs:an4.184": "Not everyone is afraid to die.",
  "an-blurbs:an4.185": "The Buddha redefines the truths of the brahmins.",
  "an-blurbs:an4.186": "A monk asks a series of questions, which are praised by the Buddha. ",
  "an-blurbs:an4.187": "The Buddha explains to Vassakāra how only a good person can judge others. Meanwhile, the followers of Todeyya complain about the King.",
  "an-blurbs:an4.188": "If you criticize someone, you should have a good reason.",
  "an-blurbs:an4.189": "Different things are realized in different ways.",
  "an-blurbs:an4.190": "On the Uposatha night, the Buddha praises monks of great spiritual attainments in the Saṅgha.",
  "an-blurbs:an4.191": "The benefits in the next life of studying Dharma in this life.",
  "an-blurbs:an4.192": "Ways of assessing a person’s morality, integrity, resilience, and wisdom.",
  "an-blurbs:an4.193": "The Buddha is accused of using magic to convert followers.",
  "an-blurbs:an4.194": "Making an effort to be pure in morality, mind, view, and freedom.",
  "an-blurbs:an4.195": "A discussion with a Jain on whether someone with purified understanding can experience the results of bad karma in the next life.",
  "an-blurbs:an4.196": "The practice of self-torture doesn’t purify you internally. ",
  "an-blurbs:an4.197": "Queen Mallikā asks about the karmic causes of beauty, wealth, and power.",
  "an-blurbs:an4.198": "Those who torture themselves and others, and those who do not.",
  "an-blurbs:an4.199": "The web of craving that wraps around the self.",
  "an-blurbs:an4.200": "How love and hate give rise to love and hate; and how one doesn’t fume, ignite, or burn up.",
  "an-blurbs:an4.201": "A good person keeps precepts—including avoiding alcohol—for themselves, while a better person encourages others as well.",
  "an-blurbs:an4.202": "A good person has faith and other good qualities, while a better person encourages others to develop these.",
  "an-blurbs:an4.203": "A good person keeps precepts—including avoiding various kinds of wrong speech—for themselves, while a better person encourages others as well.",
  "an-blurbs:an4.204": "A good person practices the ten ways of wholesome deeds for themselves, while a better person encourages others as well.",
  "an-blurbs:an4.205": "A good person practices the eightfold path for themselves, while a better person encourages others as well.",
  "an-blurbs:an4.206": "A good person practices the tenfold path for themselves, while a better person encourages others as well.",
  "an-blurbs:an4.207": "It’s good to practice the ten ways of wholesome deeds and to encourage others.",
  "an-blurbs:an4.208": "It’s good to practice the tenfold path and to encourage others.",
  "an-blurbs:an4.209": "It’s good character to practice the ten ways of wholesome deeds and to encourage others.",
  "an-blurbs:an4.210": "It’s good character to practice the tenfold path and to encourage others.",
  "an-blurbs:an4.211": "Good people light up an assembly.",
  "an-blurbs:an4.212": "Conduct and view determine rebirth.",
  "an-blurbs:an4.213": "Conduct and gratitude determine rebirth.",
  "an-blurbs:an4.214": "Precepts determine rebirth.",
  "an-blurbs:an4.215": "Initial path factors determine rebirth.",
  "an-blurbs:an4.216": "Subsequent path factors determine rebirth.",
  "an-blurbs:an4.217": "Truth and untruth determine rebirth.",
  "an-blurbs:an4.218": "Truth and untruth determine rebirth.",
  "an-blurbs:an4.219": "Faith and other qualities determine rebirth.",
  "an-blurbs:an4.220": "Faith and other qualities determine rebirth.",
  "an-blurbs:an4.221": "Good speech and bad speech.",
  "an-blurbs:an4.222": "Things that keep you spiritually healthy, including view.",
  "an-blurbs:an4.223": "Things that keep you spiritually healthy, including gratitude.",
  "an-blurbs:an4.231": "Four kinds of poets.",
  "an-blurbs:an4.232": "Karma that’s dark, bright, both, and neither.",
  "an-blurbs:an4.233": "Karma that’s dark, bright, both, and neither.",
  "an-blurbs:an4.234": "A brahmin accuses the Buddha of being an annihilationist.",
  "an-blurbs:an4.235": "Karma that’s dark, bright, both, and neither, explained with the precepts.",
  "an-blurbs:an4.236": "Karma that’s dark, bright, both, and neither, explained with the grave violations and the paths of wholesome deeds.",
  "an-blurbs:an4.237": "Karma that’s dark, bright, both, and neither, explained with the noble eightfold path.",
  "an-blurbs:an4.238": "Karma that’s dark, bright, both, and neither, explained with the awakening factors.",
  "an-blurbs:an4.239": "Blameworthy or blameless deeds and view determine rebirth.",
  "an-blurbs:an4.240": "Hurtful or pleasing deeds and view determine rebirth.",
  "an-blurbs:an4.241": "Four kinds of ascetics found only in the Buddha’s teaching.",
  "an-blurbs:an4.242": "Relying on a good person brings four benefits.",
  "an-blurbs:an4.243": "A bad monk enjoys schism in the Saṅgha.",
  "an-blurbs:an4.244": "A mendicant fears offenses just as someone would fear punishment.",
  "an-blurbs:an4.245": "How training benefits, wisdom oversees, freedom is the heart, and mindfulness is in charge.",
  "an-blurbs:an4.246": "How a corpse, a hedonist, a lion, and a Buddha go to sleep.",
  "an-blurbs:an4.247": "Four people worthy of a pagoda.",
  "an-blurbs:an4.248": "Four things lead to the growth of wisdom.",
  "an-blurbs:an4.249": "Four things helpful for human beings.",
  "an-blurbs:an4.250": "Four kinds of ignoble expression by saying you don’t know what you do know.",
  "an-blurbs:an4.251": "Four kinds of noble expression by saying you don’t know what you don’t know.",
  "an-blurbs:an4.252": "Four kinds of ignoble expression by saying you do know what you don’t know.",
  "an-blurbs:an4.253": "Four kinds of noble expression by saying you do know what you do know.",
  "an-blurbs:an4.254": "Things that are to be fully known, given up, developed, and realized through insight.",
  "an-blurbs:an4.255": "Noble and ignoble searches.",
  "an-blurbs:an4.256": "How to gather and sustain a community.",
  "an-blurbs:an4.257": "An old monk asks for advice before his retreat.",
  "an-blurbs:an4.258": "Why families lose wealth.",
  "an-blurbs:an4.259": "How a mendicant is like a fine thoroughbred.",
  "an-blurbs:an4.260": "How a mendicant is like a fine thoroughbred.",
  "an-blurbs:an4.261": "Four spiritual powers.",
  "an-blurbs:an4.262": "Things that make you unfit for living secluded in the wilderness.",
  "an-blurbs:an4.263": "Blameworthy and blameless deeds.",
  "an-blurbs:an4.264": "Killing leads to hell, not killing leads to heaven.",
  "an-blurbs:an4.265": "Stealing leads to hell, not stealing leads to heaven.",
  "an-blurbs:an4.266": "Sexual misconduct leads to hell, not committing sexual misconduct leads to heaven.",
  "an-blurbs:an4.267": "Lying leads to hell, truth leads to heaven.",
  "an-blurbs:an4.268": "Divisive speech leads to hell, harmonious speech leads to heaven.",
  "an-blurbs:an4.269": "Harsh speech leads to hell, harsh speech leads to heaven.",
  "an-blurbs:an4.270": "Talking nonsense leads to hell, meaningful speech leads to heaven.",
  "an-blurbs:an4.271": "Covetousness leads to hell, contentment leads to heaven.",
  "an-blurbs:an4.272": "Ill will leads to hell, love leads to heaven.",
  "an-blurbs:an4.273": "Wrong view leads to hell, right view leads to heaven.",
  "an-blurbs:an4.274": "Develop insight into greed through the four kinds of mindfulness meditation.",
  "an-blurbs:an4.275": "Develop insight into greed through the four right efforts.",
  "an-blurbs:an4.276": "Develop insight into greed through the four bases of psychic power.",
  "an-blurbs:an4.277-303": "Develop complete understanding, etc., of greed. ",
  "an-blurbs:an4.304-783": "Develop complete understanding, etc., of hate, etc. ",
  "an-blurbs:an5.1": "Five powers of a trainee.",
  "an-blurbs:an5.2": "Five powers of a trainee, explained.",
  "an-blurbs:an5.3": "Suffering in this life and the next.",
  "an-blurbs:an5.4": "Five qualities determine rebirth.",
  "an-blurbs:an5.5": "Reasons to criticize a mendicant who disrobes, or praise one who remains.",
  "an-blurbs:an5.6": "Loss of foundational qualities leads to decline.",
  "an-blurbs:an5.7": "The Buddha looks after mendicants like a nurse looks after a child until they’ve grown up.",
  "an-blurbs:an5.8": "A mendicant with five bad qualities fails in the Dharma.",
  "an-blurbs:an5.9": "A disrespectful mendicant with five bad qualities fails in the Dharma.",
  "an-blurbs:an5.10": "A mendicant with five bad qualities can’t grow in the Dharma.",
  "an-blurbs:an5.11": "The five powers of a Realized One.",
  "an-blurbs:an5.12": "Of the five powers, wisdom is chief.",
  "an-blurbs:an5.13": "The five powers in brief.",
  "an-blurbs:an5.14": "The five powers explained in detail.",
  "an-blurbs:an5.15": "Where to look for the five powers.",
  "an-blurbs:an5.16": "Wisdom is the chief of the five powers.",
  "an-blurbs:an5.17": "By practicing but not teaching, one practices for one’s own good.",
  "an-blurbs:an5.18": "By teaching but not practicing, one practices for the good of others.",
  "an-blurbs:an5.19": "By neither teaching nor practicing, one doesn’t practice for anyone’ good.",
  "an-blurbs:an5.20": "By both teaching and practicing, one practice for everyone’s good.",
  "an-blurbs:an5.21": "If your basic practice is not there, you can’t go higher.",
  "an-blurbs:an5.22": "If your basic practice is not there, you can’t go higher.",
  "an-blurbs:an5.23": "The hindrances are like the corruptions in gold.",
  "an-blurbs:an5.24": "Dharmas starting with morality naturally evolve to freedom.",
  "an-blurbs:an5.25": "Right view leads to freedom when supported by five factors.",
  "an-blurbs:an5.26": "Occasions when one can experience liberation.",
  "an-blurbs:an5.27": "Develop measureless convergence of mind and five knowledges intuitively arise.",
  "an-blurbs:an5.28": "Five kinds of noble right convergence, including similes.",
  "an-blurbs:an5.29": "The benefits of walking meditation.",
  "an-blurbs:an5.30": "The Buddha tells Venerable Nāgita how he dislikes noisy crowds, and wishes never to become famous.",
  "an-blurbs:an5.31": "Princess Sumanā asks the Buddha about the karmic results of generosity, when other qualities are equal.",
  "an-blurbs:an5.32": "Princess Cundī asks the Buddha about the best kind of confidence.",
  "an-blurbs:an5.33": "Uggaha invites the Buddha for a meal, and asks him to advise his daughters, who about about to be married.",
  "an-blurbs:an5.34": "The Buddha teaches General Sīha the benefits which he can see for himself in this life, and those in the next life, which he must take on faith.",
  "an-blurbs:an5.35": "Five benefits of generosity for lay people.",
  "an-blurbs:an5.36": "Gifts at the right time, in a appropriate way. The verses are the classic <i lang='pi' translate='no'>kāladāna</i> blessing.",
  "an-blurbs:an5.37": "Give and you shall receive. The verses are a classic blessing, beginning with <i lang='pi' translate='no'>Āyudo balado dhīro</i>.",
  "an-blurbs:an5.38": "When someone is a donor, they reap the benefits of association with the Saṅgha.",
  "an-blurbs:an5.39": "Reasons why parents want to have children.",
  "an-blurbs:an5.40": "How a virtuous family head is like a great tree in the mountains.",
  "an-blurbs:an5.41": "The legitimate purposes of wealth.",
  "an-blurbs:an5.42": "A good person brings many blessings to their family.",
  "an-blurbs:an5.43": "You don’t get good things by praying for them, but by how you live.",
  "an-blurbs:an5.44": "If you give the best, you get the best.",
  "an-blurbs:an5.45": "When offerings are used for deep meditation, the merit multiplies enormously.",
  "an-blurbs:an5.46": "Kinds of spiritual success, in brief.",
  "an-blurbs:an5.47": "Kinds of spiritual wealth, in detail.",
  "an-blurbs:an5.48": "A wise person reflects on their nature, so they do not suffer when struck by loss.",
  "an-blurbs:an5.49": "When King Pasenadi learns of the death of his beloved Queen Mallikā, the Buddha consoles him.",
  "an-blurbs:an5.50": "Depressed by the death of Queen Bhaddā, King Muṇḍa of Rājagaha neglects his duties, and broods by the side of his beloved’s corpse. Venerable Nārada eases his grief.",
  "an-blurbs:an5.51": "The five hindrances weaken wisdom like side-channels weaken a river’s flow.",
  "an-blurbs:an5.52": "The five hindrances are entirely unwholesome.",
  "an-blurbs:an5.53": "Conditions that help meditation progress smoothly.",
  "an-blurbs:an5.54": "Times that are supportive for meditation practice.",
  "an-blurbs:an5.55": "A mother and son, though ordained as monk and nun, have sexual relations. The Buddha launches a powerful attack on the dangers of sex.",
  "an-blurbs:an5.56": "A monk, dissatisfied with monastic life, seeks support from his mentor.",
  "an-blurbs:an5.57": "Topics that are worthy regularly reflecting on, whether as a lay person or renunciant.",
  "an-blurbs:an5.58": "When some wild young men show deep respect for the Buddha, a family elder is astonished.",
  "an-blurbs:an5.59": "Things that are hard to find in someone who has gone forth when old.",
  "an-blurbs:an5.60": "Things that are hard to find in someone who has gone forth when old.",
  "an-blurbs:an5.61": "Five meditations are very beneficial.",
  "an-blurbs:an5.62": "Five meditations lead to the deathless.",
  "an-blurbs:an5.63": "Noble growth for a male disciple.",
  "an-blurbs:an5.64": "Noble growth for a female disciple.",
  "an-blurbs:an5.65": "Qualifications for taking part in a discussion on Dharma.",
  "an-blurbs:an5.66": "Qualifications for sharing Dharma.",
  "an-blurbs:an5.67": "The four bases of psychic power, together with energy, lead to awakening.",
  "an-blurbs:an5.68": "The Buddha developed the bases for psychic power, which lead to his awakening.",
  "an-blurbs:an5.69": "Five meditations that lead to disillusionment with the world.",
  "an-blurbs:an5.70": "Five meditations that lead to the end of defilements.",
  "an-blurbs:an5.71": "Five meditations lead to freedom. The Buddha supplies five similes, which subtly illustrate five aspects of awakening.",
  "an-blurbs:an5.72": "Five meditations lead to freedom. The Buddha supplies five similes, which subtly illustrate five aspects of awakening.",
  "an-blurbs:an5.73": "The difference between someone who merely studies the letter of the Dharma, and someone who truly lives by it.",
  "an-blurbs:an5.74": "The difference between someone who merely studies the letter of the Dharma, and someone who truly lives by it.",
  "an-blurbs:an5.75": "Some warriors, like some monks, falter before the threat of battle, while others emerge victorious. ",
  "an-blurbs:an5.76": "Some warriors, like some monks, are killed or injured in battle, while others emerge victorious. ",
  "an-blurbs:an5.77": "The dangers of living in a wilderness among wild beasts and so on.",
  "an-blurbs:an5.78": "The uncertainties of life may prevent your practice.",
  "an-blurbs:an5.79": "When the teachers and leaders of the Saṅgha are not well practiced, their weakness will be passed down the generations.",
  "an-blurbs:an5.80": "The Saṅgha may forsake the simple life and indulge in luxuries.",
  "an-blurbs:an5.81": "Senior mendicants with strong defilements are disliked.",
  "an-blurbs:an5.82": "Senior mendicants with strong defilements are disliked.",
  "an-blurbs:an5.83": "Senior mendicants who are manipulative and opportunistic are disliked.",
  "an-blurbs:an5.84": "Qualities making a senior mendicant liked or disliked.",
  "an-blurbs:an5.85": "A senior mendicant with no endurance is disliked.",
  "an-blurbs:an5.86": "A senior mendicant is liked if they can analyze and explain the Dharma well, and if they are helpful in the monastery.",
  "an-blurbs:an5.87": "A senior mendicant with morality, learning, who is a good speaker and successful meditator is liked.",
  "an-blurbs:an5.88": "Even if a senior mendicant has many good qualities, they can still lead people astray if they have wrong view.",
  "an-blurbs:an5.89": "Even if a mendicant is a trainee, they won’t progress if they don’t focus on practice. In brief.",
  "an-blurbs:an5.90": "Even if a mendicant is a trainee, they won’t progress if they don’t focus on practice. In detail.",
  "an-blurbs:an5.91": "Five spiritual accomplishments culminating in wisdom.",
  "an-blurbs:an5.92": "Five spiritual accomplishments culminating in freedom.",
  "an-blurbs:an5.93": "When people are asked whether they are enlightened, they might answer for different reasons.",
  "an-blurbs:an5.94": "Living comfortably by practicing meditation.",
  "an-blurbs:an5.95": "Supported by five factors, including four aspects of textual analysis, one will soon realize the unshakable.",
  "an-blurbs:an5.96": "Supported by five factors, one who practices mindfulness of breathing will soon realize the unshakable.",
  "an-blurbs:an5.97": "Supported by five factors, one who practices mindfulness of breathing will soon realize the unshakable.",
  "an-blurbs:an5.98": "Supported by five factors, one who practices mindfulness of breathing will soon realize the unshakable. ",
  "an-blurbs:an5.99": "A lion is always respectful when it kills. So too when the Buddha teaches he always respects his audience. ",
  "an-blurbs:an5.100": "Kakudha, Venerable Moggallāna’s lay supporter, having recently passed away, returned to warn him about Devadatta’s fall. The Buddha analyses different kinds of teacher. ",
  "an-blurbs:an5.101": "Five factors in which a trainee is assured.",
  "an-blurbs:an5.102": "Five reasons why even a good mendicant might be suspected of bad behavior. ",
  "an-blurbs:an5.103": "Five tricks used by thieves to hide, and similar tricks used by bad mendicants. ",
  "an-blurbs:an5.104": "Five qualities of the most refined type of ascetic.",
  "an-blurbs:an5.105": "Five ways in which a mendicant can live comfortably with their spiritual companions.",
  "an-blurbs:an5.106": "The Buddha explains to Ānanda five ways in which a mendicant can live comfortably with their spiritual companions.",
  "an-blurbs:an5.107": "Five factors of a worthy mendicant.",
  "an-blurbs:an5.108": "Five factors of a worthy mendicant.",
  "an-blurbs:an5.109": "Five factors by which a mendicant covers all the directions.",
  "an-blurbs:an5.110": "Five factors that show whether a mendicant is ready to live in the wilderness.",
  "an-blurbs:an5.111": "Five qualities that endear a mendicant who visits families. ",
  "an-blurbs:an5.112": "Five factors to be observed by a companion who follows on alms-round; this would typically be a novice or junior mendicant.",
  "an-blurbs:an5.113": "To enter samādhi, a mendicant must be able to endure sense impacts.",
  "an-blurbs:an5.114": "Five qualities to instill in recently ordained mendicants.",
  "an-blurbs:an5.115": "Five good and five bad qualities that determine a nun’s destiny after death.",
  "an-blurbs:an5.116": "Five good and five bad qualities that determine a nun’s destiny after death.",
  "an-blurbs:an5.117": "Five good and five bad qualities that determine a nun’s destiny after death.",
  "an-blurbs:an5.118": "Five good and five bad qualities that determine a nun’s destiny after death.",
  "an-blurbs:an5.119": "Five good and five bad qualities that determine a nun’s destiny after death.",
  "an-blurbs:an5.120": "Five good and five bad qualities that determine a nun’s destiny after death.",
  "an-blurbs:an5.121": "Five meditations recommended for sick mendicants.",
  "an-blurbs:an5.122": "Five meditations that lead to perfection or non-return.",
  "an-blurbs:an5.123": "Five qualities that make a patient hard to nurse.",
  "an-blurbs:an5.124": "Five requirements that a carer or nurse should meet before looking after a patient.",
  "an-blurbs:an5.125": "Things that assist or impede longevity.",
  "an-blurbs:an5.126": "Things that assist or impede longevity.",
  "an-blurbs:an5.127": "Five factors that show whether a mendicant is ready to live apart from the Sangha.",
  "an-blurbs:an5.128": "Things that make an ascetic happy or unhappy.",
  "an-blurbs:an5.129": "Five deeds that condemn the perpetrator to hell.",
  "an-blurbs:an5.130": "Worldly or moral losses and their consequences.",
  "an-blurbs:an5.131": "Five qualities by which a wheel-turning monarch rules justly, and five corresponding qualities by which the Buddha rolls the Wheel of Dhamma.",
  "an-blurbs:an5.132": "Five qualities by which a wheel-turning monarch’s son rules justly, and five corresponding qualities by which Sāriputta keeps rolling the Wheel of Dhamma.",
  "an-blurbs:an5.133": "Even a wheel-turning monarch has a king, as does the Buddha.",
  "an-blurbs:an5.134": "A wheel-turning monarch always lives in his own realm, and so does a mendicant whose mind is freed.",
  "an-blurbs:an5.135": "A wheel-turning monarch’s son aspires to kingship, as a mendicant aspires to awakening.",
  "an-blurbs:an5.136": "A wheel-turning monarch’s son aspires to be a viceroy, as a mendicant aspires to awakening.",
  "an-blurbs:an5.137": "Five people who sleep little.",
  "an-blurbs:an5.138": "Even a clumsy royal elephant is considered to be a royal elephant, and so too even a clumsy mendicant is still a mendicant.",
  "an-blurbs:an5.139": "A royal elephant who can’t endure sense impacts is unfit, and so too a mendicant.",
  "an-blurbs:an5.140": "A royal elephant with five factors is fit, and so too a mendicant.",
  "an-blurbs:an5.141": "Five people susceptible to various flaws.",
  "an-blurbs:an5.142": "Those who violate moral precepts may regret it or may not.",
  "an-blurbs:an5.143": "The Licchavis discuss the greatest treasures in the world. The Buddha, criticizing them for their fixation on sensual pleasures, suggests spiritual treasures.",
  "an-blurbs:an5.144": "Five meditations that train a mendicant to shift their perception at will.",
  "an-blurbs:an5.145": "Reasons one is cast down to hell or raised to heaven.",
  "an-blurbs:an5.146": "Don’t befriend a mendicant with five qualities; look instead for the five opposites.",
  "an-blurbs:an5.147": "Good and bad ways of offering gifts.",
  "an-blurbs:an5.148": "The way a good person gives gifts and the outcome. ",
  "an-blurbs:an5.149": "A mendicant who has found only temporary freedom may decline for five reasons.",
  "an-blurbs:an5.150": "A mendicant who has found only temporary freedom may decline for five reasons.",
  "an-blurbs:an5.151": "Qualities that prevent one who is listening to the teaching from understanding.",
  "an-blurbs:an5.152": "Qualities that prevent one who is listening to the teaching from understanding.",
  "an-blurbs:an5.153": "Qualities that prevent one who is listening to the teaching from understanding.",
  "an-blurbs:an5.154": "Things that lead to the decline or the prosperity of the Dhamma.",
  "an-blurbs:an5.155": "Things that lead to the decline or the prosperity of the Dhamma.",
  "an-blurbs:an5.156": "Things that lead to the decline or the prosperity of the Dhamma.",
  "an-blurbs:an5.157": "Certain topics are inappropriate to discuss with certain kinds of people.",
  "an-blurbs:an5.158": "Confidence or lack thereof in mendicants is due to their practice.",
  "an-blurbs:an5.159": "When told Venerable Udāyī is teaching, the Buddha defines five factors that a Dhamma teacher should establish in themselves.",
  "an-blurbs:an5.160": "Five things that are hard to dispel once they have arisen",
  "an-blurbs:an5.161": "Five reflections to help eliminate resentment, in brief.",
  "an-blurbs:an5.162": "Five reflections to help eliminate resentment, an explanation by Sāriputta..",
  "an-blurbs:an5.163": "Qualifications for a mendicant to hold a Dhamma discussion.",
  "an-blurbs:an5.164": "Qualifications for a mendicant to share their way of life.",
  "an-blurbs:an5.165": "Sāriputta explains five reasons for asking a question, and the reason he asks a question.",
  "an-blurbs:an5.166": "Udāyī refuses to believe Sāriputta’s description of the achievements of an accomplished meditator. The Buddha dismisses Udāyī’s foolishness, and outlines the reasons senior mendicants should be respected. ",
  "an-blurbs:an5.167": "Factors that a mendicant should establish in themselves before accusing another.",
  "an-blurbs:an5.168": "Lack of ethics prevents the attaining of samādhi, wisdom, and freedom.",
  "an-blurbs:an5.169": "Ānanda asks Sāriputta to explain what it means to be quick-witted, but Sāriputta gets Ānanda to explain it himself.",
  "an-blurbs:an5.170": "Ānanda asks Bhaddaji about the best sense objects, and corrects his answer.",
  "an-blurbs:an5.171": "Confidence or lack thereof in layfolk is due to their precepts.",
  "an-blurbs:an5.172": "Confidence or lack thereof in layfolk is due to their precepts.",
  "an-blurbs:an5.173": "Reasons one is cast down to hell or raised to heaven.",
  "an-blurbs:an5.174": "Breaking of precepts is a threat and a danger.",
  "an-blurbs:an5.175": "An outcaste is not born, but they make themselves an outcaste by their behavior. ",
  "an-blurbs:an5.176": "The Buddha encourages Anāthapiṇḍika to not rest short with generosity, but to practice meditation too.",
  "an-blurbs:an5.177": "Five kinds of trade that are wrong livelihood.",
  "an-blurbs:an5.178": "Kings do not punish people for keeping precepts.",
  "an-blurbs:an5.179": "Qualities possessing which a lay person may claim to be a stream-enterer.",
  "an-blurbs:an5.180": "The Buddha tells of the layman Gavesī in the time of Buddha Kassapa, and how he went forth with all his followers.",
  "an-blurbs:an5.181": "Different reasons why someone might dwell in the wilderness.",
  "an-blurbs:an5.182": "Different reasons why someone might wear rag robes.",
  "an-blurbs:an5.183": "Different reasons why someone might dwell at the root of a tree.",
  "an-blurbs:an5.184": "Different reasons why someone might dwell in a charnel ground.",
  "an-blurbs:an5.185": "Different reasons why someone might dwell in the open air.",
  "an-blurbs:an5.186": "Different reasons why someone might never lie down.",
  "an-blurbs:an5.187": "Different reasons why someone might sleep wherever a mat is laid down.",
  "an-blurbs:an5.188": "Different reasons why someone might eat once per day.",
  "an-blurbs:an5.189": "Different reasons why someone might refuse food offered late.",
  "an-blurbs:an5.190": "Different reasons why someone might eat only from their bowl.",
  "an-blurbs:an5.191": "Ancient traditions of the brahmins that are these days only seen among dogs.",
  "an-blurbs:an5.192": "The brahmin Doṇa accuses the Buddha of not respecting brahmins, so the Buddha responds by analyzing the different kinds of brahmin.",
  "an-blurbs:an5.193": "Saṅgārava the brahmin asks why memorized hymns are sometimes clear to the mind and sometimes not. The Buddha answers with the five hindrances.",
  "an-blurbs:an5.194": "The brahmins Kāraṇapālī and Piṅgiyānī extol the good qualities of the Buddha.",
  "an-blurbs:an5.195": "During a visit by the Licchavis, the brahmin Piṅgiyānī utters a verse in praise of the Buddha.",
  "an-blurbs:an5.196": "Before his awakening, the bodhisatta had five great dreams that foretold profound aspects of his awakening and dispensation.",
  "an-blurbs:an5.197": "Weather forecasters remain ignorant of these five obstacles to rain.",
  "an-blurbs:an5.198": "Five factors of good speech.",
  "an-blurbs:an5.199": "When a renunciate visits a family, they make merit on five bases.",
  "an-blurbs:an5.200": "Five kinds of escape, showing how different aspects of suffering are escaped by different practices.",
  "an-blurbs:an5.201": "Things that lead to the long-lasting of the Dhamma after the Buddha’s death. ",
  "an-blurbs:an5.202": "Five benefits of listening to the teaching.",
  "an-blurbs:an5.203": "Factors that make a thoroughbred worthy of a king.",
  "an-blurbs:an5.204": "Five spiritual powers.",
  "an-blurbs:an5.205": "Five kinds of emotional barrenness that can affect mendicants.",
  "an-blurbs:an5.206": "Five kinds of emotional shackle that can affect mendicants.",
  "an-blurbs:an5.207": "The five health benefits of eating porridge.",
  "an-blurbs:an5.208": "The five health problems of not cleaning one’s teeth with chew sticks.",
  "an-blurbs:an5.209": "Why you shouldn’t recite Dhamma in an overly drawn-out singing style.",
  "an-blurbs:an5.210": "Why you shouldn’t fall asleep unmindfully.",
  "an-blurbs:an5.211": "Why a mendicant shouldn’t speak ill of their spiritual companions.",
  "an-blurbs:an5.212": "Why a mendicant shouldn’t start arguments.",
  "an-blurbs:an5.213": "Five drawbacks of failure in morality, and the corresponding benefits of the reverse.",
  "an-blurbs:an5.214": "Five drawbacks for a person who talks a lot, and the corresponding benefits of the reverse.",
  "an-blurbs:an5.215": "Five drawbacks of intolerance, and the corresponding benefits of the reverse.",
  "an-blurbs:an5.216": "Five drawbacks of intolerance, and the corresponding benefits of the reverse.",
  "an-blurbs:an5.217": "Five drawbacks of uninspiring conduct, and the corresponding benefits of the reverse.",
  "an-blurbs:an5.218": "Five drawbacks of uninspiring conduct, and the corresponding benefits of the reverse.",
  "an-blurbs:an5.219": "Five drawbacks of sitting around a fire.",
  "an-blurbs:an5.220": "Five drawbacks of the city of Madhura.",
  "an-blurbs:an5.221": "For five reasons, a mendicant should wander a reasonable amount, not aimlessly.",
  "an-blurbs:an5.222": "For five reasons, a mendicant should wander a reasonable amount, not aimlessly.",
  "an-blurbs:an5.223": "For five reasons, a mendicant should stay in a monastery a reasonable length of time, not excessively.",
  "an-blurbs:an5.224": "For five reasons, a mendicant should stay in a monastery a reasonable length of time, not excessively.",
  "an-blurbs:an5.225": "A mendicant who visits families risks the following five problems.",
  "an-blurbs:an5.226": "A mendicant who visits families risks the following five problems.",
  "an-blurbs:an5.227": "Five drawbacks of riches, and five benefits.",
  "an-blurbs:an5.228": "Five drawbacks for families who eat overly late, and five benefits of eating at a reasonable hour.",
  "an-blurbs:an5.229": "Five ways a woman is like a black snake.",
  "an-blurbs:an5.230": "Five ways a woman is like a black snake.",
  "an-blurbs:an5.231": "Reasons a resident mendicant is admirable, and the reverse.",
  "an-blurbs:an5.232": "Reasons a resident mendicant is admirable.",
  "an-blurbs:an5.233": "Reasons a resident mendicant beautifies a monastery.",
  "an-blurbs:an5.234": "Reasons a resident mendicant helps a monastery.",
  "an-blurbs:an5.235": "How a mendicant shows compassion to lay folk.",
  "an-blurbs:an5.236": "Reasons a resident mendicant is cast down to hell or raised to heaven.",
  "an-blurbs:an5.237": "Reasons a resident mendicant is cast down to hell or raised to heaven.",
  "an-blurbs:an5.238": "Reasons a resident mendicant is cast down to hell or raised to heaven.",
  "an-blurbs:an5.239": "Reasons a resident mendicant is cast down to hell or raised to heaven.",
  "an-blurbs:an5.240": "Reasons a resident mendicant is cast down to hell or raised to heaven.",
  "an-blurbs:an5.241": "Drawbacks of bad conduct, and the reverse.",
  "an-blurbs:an5.242": "Drawbacks of bad bodily conduct, and the reverse.",
  "an-blurbs:an5.243": "Drawbacks of bad verbal conduct, and the reverse.",
  "an-blurbs:an5.244": "Drawbacks of bad mental conduct, and the reverse.",
  "an-blurbs:an5.245": "Drawbacks of bad conduct, and the reverse.",
  "an-blurbs:an5.246": "Drawbacks of bad bodily conduct, and the reverse.",
  "an-blurbs:an5.247": "Drawbacks of bad verbal conduct, and the reverse.",
  "an-blurbs:an5.248": "Drawbacks of bad mental conduct, and the reverse.",
  "an-blurbs:an5.249": "Why a person may have the same defects as a charnel ground.",
  "an-blurbs:an5.250": "Placing faith in an individual is dangerous for five reasons.",
  "an-blurbs:an5.251": "Qualifications for one who should give an ordination.",
  "an-blurbs:an5.252": "Qualifications for one who should give dependence.",
  "an-blurbs:an5.253": "Qualifications for one who should have a novice as attendant.",
  "an-blurbs:an5.254": "Material and spiritual stinginess.",
  "an-blurbs:an5.255": "Getting rid of the five kinds of stinginess.",
  "an-blurbs:an5.256": "Give up stinginess to enter the first absorption.",
  "an-blurbs:an5.257-263": "Give up stinginess to enter the absorptions and higher attainments.",
  "an-blurbs:an5.264": "Give up stinginess to enter the first absorption.",
  "an-blurbs:an5.265-271": "Give up stinginess to enter the absorptions and higher attainments.",
  "an-blurbs:an5.272": "Qualities of one who is appointed to assign meals.",
  "an-blurbs:an5.273-285": "Qualities of one who is appointed to assign lodgings, and other monastery responsibilities.",
  "an-blurbs:an5.286": "Why a monk is cast down to hell or raised up to heaven.",
  "an-blurbs:an5.287-292": "Why a nun, etc. is cast down to hell or raised up to heaven.",
  "an-blurbs:an5.293": "Why an ājīvaka ascetic is cast down to hell or raised up to heaven.",
  "an-blurbs:an5.294-302": "Why various ascetics are cast down to hell or raised up to heaven.",
  "an-blurbs:an5.303": "Develop insight into greed starting with ugliness.",
  "an-blurbs:an5.304": "Develop insight into greed starting with impermanence.",
  "an-blurbs:an5.305": "Develop insight into greed starting with impermanence.",
  "an-blurbs:an5.306": "Develop insight into greed through the faculties.",
  "an-blurbs:an5.307": "Develop insight into greed through the powers.",
  "an-blurbs:an5.308-1152": "Develop complete undestanding, etc., of greed.",
  "an-blurbs:an6.1": "A mendicant is worthy of gifts because of equanimity for the six senses.",
  "an-blurbs:an6.2": "A mendicant is worthy of gifts because of the six higher knowledges.",
  "an-blurbs:an6.3": "A mendicant is worthy of gifts because of six faculties.",
  "an-blurbs:an6.4": "A mendicant is worthy of gifts because of six powers.",
  "an-blurbs:an6.5": "A steed is worthy of the king for six reasons, and a mendicant is worthy for six similar reasons.",
  "an-blurbs:an6.6": "A steed is worthy of the king for six reasons, and a mendicant is worthy for six similar reasons.",
  "an-blurbs:an6.7": "A steed is worthy of the king for six reasons, and a mendicant is worthy for six similar reasons.",
  "an-blurbs:an6.8": "Six things that are unsurpassable.",
  "an-blurbs:an6.9": "Six topics for recollection.",
  "an-blurbs:an6.10": "The Buddha teaches his relative Mahānāma that a noble disciple often practices the six recollections, which lead to joy and peace.",
  "an-blurbs:an6.11": "Six warm-hearted qualities practiced among the mendicants.",
  "an-blurbs:an6.12": "Six warm-hearted qualities practiced among the mendicants.",
  "an-blurbs:an6.13": "The Buddha’s teachings are effective, so we can’t claim to have practiced them fully if we’re still afflicted by the various forms of suffering.",
  "an-blurbs:an6.14": "A mendicant who lives well and doesn’t waste time will have a good death.",
  "an-blurbs:an6.15": "A mendicant who lives well and doesn’t waste time dies without regret.",
  "an-blurbs:an6.16": "A sick householder is consoled by his wife, who says there is no need for him to be worried about dying, as she is well able to support the family and practice the Dhamma. He recovers, and visits the Buddha to sing the praises of his kind and wise wife.",
  "an-blurbs:an6.17": "Neither a king nor a mendicant gets anything accomplished if they just sleep all the time.",
  "an-blurbs:an6.18": "Those whose livelihood is the killing of animals do not prosper.",
  "an-blurbs:an6.19": "Many of those who practice mindfulness of death don’t do so urgently enough. Death might come to us at any moment.",
  "an-blurbs:an6.20": "A method for recollecting one’s own death that leads to urgency, diligence, and joy.",
  "an-blurbs:an6.21": "Even the gods know that some monks are falling away from their practice.",
  "an-blurbs:an6.22": "In the past, future, and present, practicing six good qualities protects against decline.",
  "an-blurbs:an6.23": "Sensual pleasures are perilous.",
  "an-blurbs:an6.24": "A mendicant who has fully mastered meditation could even split apart the Himalayas.",
  "an-blurbs:an6.25": "The six recollections are a way to escape from greed.",
  "an-blurbs:an6.26": "Mahākaccāna teaches that the six recollections are a way to escape from greed and lead to a mind as vast as space.",
  "an-blurbs:an6.27": "The right time to visit an esteemed mendicant is when you need spiritual guidance and support.",
  "an-blurbs:an6.28": "Some senior mendicants discuss the right time to see an esteemed mendicant, and Mahākaccāna answers by quoting the Buddha from AN 6.27.",
  "an-blurbs:an6.29": "When the Buddha asks about the topics for recollection, a monk reveals his ignorance. Ānanda then gives an unusual list of five recollections, which the Buddha supplements with a sixth.",
  "an-blurbs:an6.30": "There are things in the world considered to be unsurpassed, but none of them compare with the Dhamma.",
  "an-blurbs:an6.31": "Things leading to decline or non-decline.",
  "an-blurbs:an6.32": "A god speaks on things leading to decline or non-decline.",
  "an-blurbs:an6.33": "The Buddha recounts the events of the previous discourse.",
  "an-blurbs:an6.34": "Mahāmoggallāna is visited by a Brahmā god who had formerly been a mendicant, and they discuss which of the gods are stream-enterers.",
  "an-blurbs:an6.35": "Six kinds of perception that lead to wisdom.",
  "an-blurbs:an6.36": "If a mendicant nurses six kinds of defilements it leads to bitterness and disputes in the Saṅgha.",
  "an-blurbs:an6.37": "Seeing the laywoman Veḷukaṇṭakī preparing a meal for the Saṅgha, the Buddha celebrated by saying that giving is of great benefit when the donor and the recipient each possess three qualities.",
  "an-blurbs:an6.38": "The Buddha rebuts a brahmin’s claim that there is no such thing as actions initiated by oneself.",
  "an-blurbs:an6.39": "Greed, hate, and delusion are the roots of deeds.",
  "an-blurbs:an6.40": "The Buddha explains to Venerable Kimbila the reasons why Buddhism lasts long after the Buddha’s demise.",
  "an-blurbs:an6.41": "Even a simple block of wood can be perceived in different ways by a mendicant with advanced meditation.",
  "an-blurbs:an6.42": "When visited by a noisy crowd, the Buddha speaks to his attendant Nāgita of his love of seclusion and solitude, and of his regard for forest mendicants.",
  "an-blurbs:an6.43": "When going for a bath, the Buddha encounters a giant royal elephant. But a spiritual giant is even more impressive.",
  "an-blurbs:an6.44": "In response to criticism, the Buddha explains that it is difficult to compare the spiritual development of different individuals, so we should not be judgmental.",
  "an-blurbs:an6.45": "Poor people suffer when they get in debt. Spiritual practitioners who are devoid of good qualities suffer in a similar way.",
  "an-blurbs:an6.46": "In a discourse evidently set some time after the Buddha’s passing, Venerable Mahācunda urges different groups of meditators, whether they emphasize serenity or insight, to respect and support each other.",
  "an-blurbs:an6.47": "The Buddha explains to the wanderer Moliyasīvaka how the teaching may be realized in the present life.",
  "an-blurbs:an6.48": "The Buddha explains a brahmin how the teaching may be realized in the present life.",
  "an-blurbs:an6.49": "Two monks separately come to the Buddha and speak of awakening in terms of letting go conceit. The Buddha affirms that they are, in fact, awakened, and that such indirect means are the proper way to make such declarations.",
  "an-blurbs:an6.50": "Just as a tree without leaves cannot grow, sense restraint is the foundation for spiritual growth.",
  "an-blurbs:an6.51": "Venerables Ānanda and Sāriputta discuss how a mendicants gets to further their learning and understanding.",
  "an-blurbs:an6.52": "The Buddha explains to the brahmin Jāṇussoṇī the ambition, quest, commitment, insistence, and ultimate goal of aristocrats, brahmins, householders, women, bandits, and ascetics.",
  "an-blurbs:an6.53": "With a series of vivid similes, the Buddha shows how diligence leads to benefits in both this life and the next.",
  "an-blurbs:an6.54": "The monk Dhammika annoys both the monks and the layfolk so badly that they banish him. He comes to the Buddha, who consoles him and raises his spirits with a story, while at the same time showing him the error of his ways.",
  "an-blurbs:an6.55": "When Venerable Soṇa thinks of disrobing, the Buddha comes and encourages him with the famous simile of the lute that is tuned neither too loose nor too tight.",
  "an-blurbs:an6.56": "The Buddha consoles Venerable Phagguṇa on his deathbed, and he dies at peace. The Buddha then explains to Ānanda the benefits of hearing the Dhamma at the right time.",
  "an-blurbs:an6.57": "Ānanda asks the Buddha about the six classes of people described by the rival ascetic Pūraṇa Kassapa. The Buddha rejects them, and proposes an alternate scheme, emphasizing the importance ones deeds in this life.",
  "an-blurbs:an6.58": "The Buddha explains diverse methods for overcoming diverse kinds of defilements.",
  "an-blurbs:an6.59": "The householder Dārukammika claims to give gifts to arahants. But the Buddha warns him that it’s hard to know who is really an arahant, and encourage him instead to make offerings to the Saṅgha.",
  "an-blurbs:an6.60": "The junior monk Citta Hatthisāriputta rudely interrupts his seniors, and is admonished by Mahākoṭṭhita. His friends speak in his defense, but Mahākoṭṭhita warns them with a long explanation of how hard it is to know another’s mind. Ultimately, Citta disrobes.",
  "an-blurbs:an6.61": "Several senior mendicants discuss the “Questions of Metteyya” from the Pārāyana (Snp 5.3). Each propose an interpretation, and they then ask the Buddha. He praises each reading, but gives his own intended meaning.",
  "an-blurbs:an6.62": "A monk asks whether, when the Buddha said that Devadatta was going to hell, he was speaking metaphorically. The Buddha castigates him, wondering how anyone could misunderstand such a straightforward statement, and explains how he reads the minds of others and understands where their deeds will lead them.",
  "an-blurbs:an6.63": "A detailed analysis of several central themes, including sense perception, feeling, defilements, kamma, etc.",
  "an-blurbs:an6.64": "The Buddha possesses six spiritual powers that enable him to roar his lion’s roar. ",
  "an-blurbs:an6.65": "Six things lead to non-return.",
  "an-blurbs:an6.66": "Six things lead to perfection.",
  "an-blurbs:an6.67": "With bad friends, a mendicant cannot fulfill six good qualities, but with good friends they can.",
  "an-blurbs:an6.68": "A mendicant who loves to socialize can’t find peace in meditation, but one who loves solitude can.",
  "an-blurbs:an6.69": "A god speaks on the factors of non-decline. When the Buddha repeats what he says, Sāriputta gives an explaination.",
  "an-blurbs:an6.70": "Without samādhi or immersion it is impossible to realize the higher truths of the path.",
  "an-blurbs:an6.71": "Six qualities that enable a mendicant to gain understanding.",
  "an-blurbs:an6.72": "Six qualities that enable a mendicant to gain strength in meditation.",
  "an-blurbs:an6.73": "Six qualities that enable a mendicant to gain the first absorption.",
  "an-blurbs:an6.74": "Six qualities that enable a mendicant to gain the first absorption.",
  "an-blurbs:an6.75": "Six qualities that lead to suffering, and whose absence leads to happiness.",
  "an-blurbs:an6.76": "Qualities for realizing arahantship.",
  "an-blurbs:an6.77": "Qualities for realizing superhuman states.",
  "an-blurbs:an6.78": "Qualities leading to happiness.",
  "an-blurbs:an6.79": "Qualities for gaining and strengthening good qualities.",
  "an-blurbs:an6.80": "Possessing six qualities a mendicant attains to greatness.",
  "an-blurbs:an6.81": "Things leading to hell or heaven.",
  "an-blurbs:an6.82": "Things leading to hell or heaven.",
  "an-blurbs:an6.83": "Things leading to or obstructing the attainment of perfection.",
  "an-blurbs:an6.84": "Things leading to growth or deterioration by day or night.",
  "an-blurbs:an6.85": "Possessing six qualities a mendicant attains to coolness.",
  "an-blurbs:an6.86": "Things that enable or obstruct true understanding while listening to the teachings. ",
  "an-blurbs:an6.87": "Things that enable or obstruct true understanding while listening to the teachings. ",
  "an-blurbs:an6.88": "Things that enable or obstruct true understanding while listening to the teachings. ",
  "an-blurbs:an6.89": "Requirements for becoming a stream-enterer.",
  "an-blurbs:an6.90": "Things given up by a stream-enterer.",
  "an-blurbs:an6.91": "Things impossible for a stream-enterer.",
  "an-blurbs:an6.92": "Things impossible for a stream-enterer.",
  "an-blurbs:an6.93": "Things impossible for a stream-enterer.",
  "an-blurbs:an6.94": "Things impossible for a stream-enterer.",
  "an-blurbs:an6.95": "Things impossible for a stream-enterer.",
  "an-blurbs:an6.96": "Things rare to find in the world.",
  "an-blurbs:an6.97": "Benefits of stream-entry.",
  "an-blurbs:an6.98": "A mendicant on the path cannot see any condition as permanent.",
  "an-blurbs:an6.99": "A mendicant on the path cannot see any condition as pleasurable.",
  "an-blurbs:an6.100": "A mendicant on the path cannot see any thing as not-self.",
  "an-blurbs:an6.101": "A mendicant on the path cannot see extinguishment as suffering.",
  "an-blurbs:an6.102": "Reasons for meditating on impermanence.",
  "an-blurbs:an6.103": "Reasons for meditating on suffering.",
  "an-blurbs:an6.104": "Reasons for meditating on not-self.",
  "an-blurbs:an6.105": "Giving up rebirth in the three realms of existence, and developing the three trainings.",
  "an-blurbs:an6.106": "Giving up conceit and craving.",
  "an-blurbs:an6.107": "Antidotes for greed, hate, and delusion.",
  "an-blurbs:an6.108": "Antidotes for bad conduct.",
  "an-blurbs:an6.109": "Antidotes for bad thoughts.",
  "an-blurbs:an6.110": "Antidotes for harmful perceptions.",
  "an-blurbs:an6.111": "Antidotes for harmful properties.",
  "an-blurbs:an6.112": "Antidotes for views of gratification, self, and wrong views.",
  "an-blurbs:an6.113": "Antidotes for discontent, cruelty, and misconduct.",
  "an-blurbs:an6.114": "Antidotes for discontent, unawareness, and desire.",
  "an-blurbs:an6.115": "Antidotes for being hard to correct, bad friendship, and distraction.",
  "an-blurbs:an6.116": "Antidotes for restlessness, lack of restraint, and heedlessness.",
  "an-blurbs:an6.117": "Things that enable or obstruct meditation on the body.",
  "an-blurbs:an6.118": "Things that enable or obstruct meditation on various things.",
  "an-blurbs:an6.119": "Possessing six qualities, the householder Tapussa sees the Dhamma.",
  "an-blurbs:an6.120-139": "Possessing six qualities, various householders see the Dhamma.",
  "an-blurbs:an7.1": "Seven qualities that make a mendicant either agreeable or disagreeable to their fellow monastics.",
  "an-blurbs:an7.2": "Seven qualities that make a mendicant either agreeable or disagreeable to their fellow monastics.",
  "an-blurbs:an7.3": "The powers of faith, energy, conscience, prudence, mindfulness, samādhi, and wisdom.",
  "an-blurbs:an7.4": "The powers of faith, energy, conscience, prudence, mindfulness, samādhi, and wisdom.",
  "an-blurbs:an7.5": "The wealth of faith, energy, conscience, prudence, learning, generosity, and wisdom.",
  "an-blurbs:an7.6": "The wealth of faith, energy, conscience, prudence, learning, generosity, and wisdom.",
  "an-blurbs:an7.7": "Migāra of Rohaṇa is a wealthy man, but even his riches are vulnerable to the vicissitudes of life, unlike spiritual wealth.",
  "an-blurbs:an7.8": "The fetters of compliance, repulsion, views, doubt, conceit, desire to be reborn, and ignorance.",
  "an-blurbs:an7.9": "The purpose of the spiritual life is to give up the fetters of compliance, repulsion, views, doubt, conceit, desire to be reborn, and ignorance.",
  "an-blurbs:an7.10": "The fetters of compliance, repulsion, views, doubt, conceit, envy, and stinginess.",
  "an-blurbs:an7.11": "The underlying tendencies of sensual desire, repulsion, views, doubt, conceit, desire to be reborn, and ignorance.",
  "an-blurbs:an7.12": "The purpose of the spiritual life is to give up the underlying tendencies of sensual desire, repulsion, views, doubt, conceit, desire to be reborn, and ignorance.",
  "an-blurbs:an7.13": "Factors that make a family worth visiting.",
  "an-blurbs:an7.14": "Seven persons who are worthy of gifts and veneration.",
  "an-blurbs:an7.15": "Seven people found in the world who are like those in water.",
  "an-blurbs:an7.16": "Seven persons who are worthy of gifts and veneration.",
  "an-blurbs:an7.17": "Seven persons who are worthy of gifts and veneration.",
  "an-blurbs:an7.18": "Seven persons who are worthy of gifts and veneration.",
  "an-blurbs:an7.19": "Seven persons who are worthy of gifts and veneration.",
  "an-blurbs:an7.20": "A mendicant with seven qualities is qualified to graduate.",
  "an-blurbs:an7.21": "The Buddha teaches the seven principles of non-decline to the Licchavis at the Sārandada shrine near Vesālī. ",
  "an-blurbs:an7.22": "King Ajātasattu of Magadha wishes to invade the Vajjians, and sends his minister Vassakāra to tell the Buddha of his intentions. The Buddha recalls the time he taught the seven principles of non-decline to the Vajjians.",
  "an-blurbs:an7.23": "The Buddha teaches the seven principles of non-decline to the mendicants.",
  "an-blurbs:an7.24": "The Buddha teaches seven principles of non-decline to the mendicants.",
  "an-blurbs:an7.25": "The Buddha teaches seven principles of non-decline to the mendicants.",
  "an-blurbs:an7.26": "The Buddha teaches seven principles of non-decline to the mendicants.",
  "an-blurbs:an7.27": "The Buddha teaches seven principles of non-decline to the mendicants.",
  "an-blurbs:an7.28": "Seven qualities leading to the decline of a mendicant who is a trainee.",
  "an-blurbs:an7.29": "Seven qualities leading to the decline of a lay follower.",
  "an-blurbs:an7.30": "Seven failures for a lay follower.",
  "an-blurbs:an7.31": "Seven ruins for a lay follower.",
  "an-blurbs:an7.32": "A god speaks of the the seven principles of non-decline to the Buddha, who repeats it to the mendicants.",
  "an-blurbs:an7.33": "The Buddha tells of hearing the seven principles of non-decline from a god.",
  "an-blurbs:an7.34": "The Buddha tells of hearing the seven principles of non-decline from a god.",
  "an-blurbs:an7.35": "The Buddha tells of hearing the seven principles of non-decline from a god. Sāriputta offers additional explanation.",
  "an-blurbs:an7.36": "When a friend has seven factors, one should associate with them.",
  "an-blurbs:an7.37": "When a mendicant has seven factors, one should stay close to them even if they send you away.",
  "an-blurbs:an7.38": "With seven qualities, a mendicant will soon realize the four kinds of textual analysis.",
  "an-blurbs:an7.39": "With seven qualities, Sāriputta realized the four kinds of textual analysis.",
  "an-blurbs:an7.40": "Seven qualities leading to mastery of meditation.",
  "an-blurbs:an7.41": "With seven qualities, Sāriputta became a master of meditation.",
  "an-blurbs:an7.42": "Sāriputta visits a sectarian hermitage and hears them saying that someone who lives the spiritual life for twelve years is fit to graduate. The Buddha rejects this, saying that a mendicant is qualified to graduate not merely by completing a certain number of years, but because of their spiritual qualities.",
  "an-blurbs:an7.43": "Ānanda visits a sectarian hermitage and hears them saying that someone who lives the spiritual life for twelve years is fit to graduate. The Buddha rejects this, saying that a mendicant is qualified to graduate not merely by completing a certain number of years, but because of their spiritual qualities.",
  "an-blurbs:an7.44": "Seven planes of consciousness in which beings may be reborn.",
  "an-blurbs:an7.45": "The path factors are the prerequisite for right immersion.",
  "an-blurbs:an7.46": "Seven fires, some physical, some psychological.",
  "an-blurbs:an7.47": "The brahmin Uggatasarīra has arranged a great sacrifice. On Ānanda’s advice, he asks the Buddha how to make a sacrifice beneficial.",
  "an-blurbs:an7.48": "Meditating on seven perceptions leads to the deathless, in brief.",
  "an-blurbs:an7.49": "Meditating on seven perceptions leads to the deathless, in detail.",
  "an-blurbs:an7.50": "The brahmin Jāṇussoṇī asks the Buddha about behaviors that are a blemish to the celibate life.",
  "an-blurbs:an7.51": "By focusing on their own gendered attributes, a man or woman becomes attached to them and develops lust for the opposite sex.",
  "an-blurbs:an7.52": "The lay followers of Campā seek a teaching from the Buddha. Together with Sāriputta, they ask the Buddha about what makes a gift fruitful.",
  "an-blurbs:an7.53": "Sāriputta and Moggallāna are on tour in the southern hills. A deity informs the laywoman Veḷukaṇṭakī that they are approaching. When Sāriputta expresses his amazement that she speaks with the gods, she goes on to list many other of her own amazing qualities.",
  "an-blurbs:an7.54": "The Buddha explains why a noble disciple has no doubt when it comes to the unexplained points.",
  "an-blurbs:an7.55": "Seven kinds of rebirth for non-returners, as well as extinguishment by not grasping.",
  "an-blurbs:an7.56": "Two gods come to the Buddha on Vulture’s Peak and declare that the nuns are liberated. Moggallāna interrogates one of the deities on what he means, and the Buddha adds further explanation.",
  "an-blurbs:an7.57": "The Buddha explains the benefits of giving that are visible in the present life, and one that is only apparent in the next.",
  "an-blurbs:an7.58": "Four areas where the Realized One has nothing to hide, and three ways he is irreproachable.",
  "an-blurbs:an7.59": "Venerable Kimbila asks the Buddha the reasons for the long-lasting of Buddhism after the Buddha’s demise.",
  "an-blurbs:an7.60": "Qualities required for arahantship.",
  "an-blurbs:an7.61": "Before his awakening, Moggallāna is struggling with sleepiness in meditation. The Buddha visits him and gives seven ways to dispel drowsiness, and other important teachings.",
  "an-blurbs:an7.62": "The incalculable benefits of merit that last for many aeons.",
  "an-blurbs:an7.63": "Anāthapiṇḍika’s home was in an uproar due to the badly behaved Sujātā, newly wedded to one of his sons. The Buddha speaks to her on the different kinds of wives.",
  "an-blurbs:an7.64": "When someone is angry, they wish ill upon their enemy, and are disappointed if they do well. This sutta includes a powerful set of verses.",
  "an-blurbs:an7.65": "A sense of conscience is the foundation that leads step by step to liberation.",
  "an-blurbs:an7.66": "A rare discourse on cosmic evolution. The Buddha describes the successive appearance of seven suns and how even the earth will be burned up.",
  "an-blurbs:an7.67": "When a king’s fortress is well supplied with seven things and has four kinds of food supplies it is impregnable. Similarly, a noble disciple with seven qualities and the four absorptions is impregnable.",
  "an-blurbs:an7.68": "A mendicant who has seven qualities is worthy, with a special emphasis on listening to and learning the teaching.",
  "an-blurbs:an7.69": "The blossoming of the Shady Orchid Tree delights the gods of the Thirty-Three, and in the same way, the renunciation of a Buddhist ascetic is delightful.",
  "an-blurbs:an7.70": "Sāriputta reflects on what a mendicant should revere in order to develop the wholesome. He reports to the Buddha that these things are indeed found in himself.",
  "an-blurbs:an7.71": "Liberation doesn’t happen because you wish for it, but because you develop the path.",
  "an-blurbs:an7.72": "It would be better for a monk to embrace a blazing fire than to lie with a maiden.",
  "an-blurbs:an7.73": "There have been many great teachers in the past, who should not be reviled. But reviling a single noble disciple is even more serious.",
  "an-blurbs:an7.74": "Araka was a famous teacher long ago, when the life span was much greater than today. Nevertheless, he still taught impermanence; how much more is it relevant today!",
  "an-blurbs:an7.75": "An expert in monastic conduct has seven qualities.",
  "an-blurbs:an7.76": "An expert in monastic conduct has seven qualities.",
  "an-blurbs:an7.77": "An expert in monastic conduct has seven qualities.",
  "an-blurbs:an7.78": "An expert in monastic conduct has seven qualities.",
  "an-blurbs:an7.79": "An expert in monastic conduct shines with seven qualities.",
  "an-blurbs:an7.80": "An expert in monastic conduct shines with seven qualities.",
  "an-blurbs:an7.81": "An expert in monastic conduct shines with seven qualities.",
  "an-blurbs:an7.82": "An expert in monastic conduct shines with seven qualities.",
  "an-blurbs:an7.83": "The Buddha teaches the Vinaya expert Upāli a short summary of the teaching.",
  "an-blurbs:an7.84": "Seven principles for settling issues and disputes that have arisen in the community.",
  "an-blurbs:an7.85": "A mendicant destroys seven defilements.",
  "an-blurbs:an7.86": "An ascetic  destroys seven defilements.",
  "an-blurbs:an7.87": "A brahmin destroys seven defilements.",
  "an-blurbs:an7.88": "A scholar destroys seven defilements.",
  "an-blurbs:an7.89": "A bathed initiate destroys seven defilements.",
  "an-blurbs:an7.90": "A knowledge master destroys seven defilements.",
  "an-blurbs:an7.91": "A noble one destroys seven defilements.",
  "an-blurbs:an7.92": "A perfected one destroys seven defilements.",
  "an-blurbs:an7.93": "Seven bad qualities starting with faithlessness.",
  "an-blurbs:an7.94": "Seven good qualities starting with faith.",
  "an-blurbs:an7.95": "Seven people worthy of offerings due to observing impermanence in the eye.",
  "an-blurbs:an7.96-614": "Seven people worthy of offerings due to observing suffering, etc., in the eye, etc.",
  "an-blurbs:an7.615": "Develop insight into greed through the awakening factors.",
  "an-blurbs:an7.616": "Develop insight into greed through seven perceptions starting with impermanence.",
  "an-blurbs:an7.617": "Develop insight into greed through seven perceptions starting with ugliness.",
  "an-blurbs:an7.618-644": "Develop complete understanding, etc., of greed.",
  "an-blurbs:an7.645-1124": "Develop complete understanding, etc., of hate, etc.",
  "an-blurbs:an8.1": "The eight benefits of practicing the meditation on love.",
  "an-blurbs:an8.2": "Eight conditions that lead to the arising of wisdom, its growth and perfection.",
  "an-blurbs:an8.3": "Due to eight qualities, a mendicant is displeasing to their fellow monastics, but with the opposite qualities is pleasing.",
  "an-blurbs:an8.4": "Due to eight qualities, a mendicant is displeasing to their fellow monastics, but with the opposite qualities is pleasing.",
  "an-blurbs:an8.5": "The eight worldly conditions in brief: gain and loss, fame and disgrace, praise and blame, pleasure and pain.",
  "an-blurbs:an8.6": "The eight worldly conditions in detail: gain and loss, fame and disgrace, praise and blame, pleasure and pain.",
  "an-blurbs:an8.7": "Devadatta’s downfall was the eight worldly conditions.",
  "an-blurbs:an8.8": "In a discourse evidently set some time after the Buddha’s passing, Venerable Uttara, staying in a distant land, teaches that a mendicant should review their own failings and those of others. Questioned by Sakka, the Lord of Gods, Uttara affirms that he learned this from the Buddha.",
  "an-blurbs:an8.9": "The Buddha praises the grace and restraint of Venerable Nanda.",
  "an-blurbs:an8.10": "When a certain monk was admonished, he responded by attacking his reprovers. The Buddha tells the other monks to expel him, explaining that when such a monk lives hidden in the Saṅgha, his corruption can spread to the other monks.",
  "an-blurbs:an8.11": "The brahmin Verañja rebukes the Buddha for his lack of respect for senior brahmins. He levels a series of criticisms, each of which the Buddha deflects by redefining terms. The Buddha affirms that his claim to superiority is because he was the first to achieve awakening.",
  "an-blurbs:an8.12": "General Sīha, a prominent disciple of the Jains, visits the Buddha against the wishes of Mahāvīra, the Jain leader. He challenges the Buddha by bringing up the various ways that people criticize him. Convinced by the Buddha’s response, Sīha wishes to take refuge in the Buddha; but the Buddha urges him to be cautious and to continue supporting the Jains.",
  "an-blurbs:an8.13": "With eight qualities a royal thoroughbred is worthy of a king. Likewise, with eight qualities a mendicant is worthy.",
  "an-blurbs:an8.14": "Eight flaws in wild horses, similar to eight flaws in mendicants.",
  "an-blurbs:an8.15": "Eight different kinds of stain.",
  "an-blurbs:an8.16": "A mendicant with eight qualities is worthy of being sent on a mission.",
  "an-blurbs:an8.17": "A woman imprisons a man in eight ways.",
  "an-blurbs:an8.18": "A man imprisons a woman in eight ways.",
  "an-blurbs:an8.19": "Demons delight in the ocean for eight reasons, and likewise the mendicants delight in the Dhamma for eight reasons.",
  "an-blurbs:an8.20": "On a full-moon night, the Buddha was to recite the code of conduct for the monks. However, he remained silent until dawn, due to the presence of a corrupt monk.",
  "an-blurbs:an8.21": "The Buddha celebrates the eight amazing qualities of the householder Ugga of Vesālī. Ugga himself speaks of these qualities.",
  "an-blurbs:an8.22": "The Buddha celebrates the eight amazing qualities of the householder Ugga of Hatthigāma. Ugga himself speaks of these qualities.",
  "an-blurbs:an8.23": "The Buddha celebrates the seven amazing qualities of the householder Hatthaka of Āḷavī. When he hears of this, Hatthaka is anxious to know that no lay people were present. Learning of this, the Buddha adds humility as an eight quality.",
  "an-blurbs:an8.24": "The Buddha learns from Hatthaka of Āḷavī how he maintains a large following. He then celebrates Hatthaka’s eight good qualities.",
  "an-blurbs:an8.25": "Questioned by his relative Mahānāma, the Buddha explains what makes someone a Buddhist lay follower, a virtuous lay follower, and a lay follower practicing for the welfare of all.",
  "an-blurbs:an8.26": "Questioned by Jīvaka Komārabhacca, the Buddha explains what makes someone a Buddhist lay follower, a virtuous lay follower, and a lay follower practicing for the welfare of all.",
  "an-blurbs:an8.27": "Eight very different kinds of powers.",
  "an-blurbs:an8.28": "Eight powers of a perfected one.",
  "an-blurbs:an8.29": "Eight lost opportunities for spiritual practice.",
  "an-blurbs:an8.30": "Venerable Anuruddha reflects that the teachings is for someone who is of few wishes, content, secluded, energetic, mindful, peaceful, and wise. To these seven thoughts, the Buddha adds an eighth: the teaching is for those who delight in non-proliferation. Practicing in line with these eight thoughts of a great man, Venerable Anuruddha achieves perfection.",
  "an-blurbs:an8.31": "Eight ways of giving a gift.",
  "an-blurbs:an8.32": "This verse on qualities of a good person appears to be a fragment of text, perhaps originally part of the previous sutta.",
  "an-blurbs:an8.33": "Eight grounds for giving.",
  "an-blurbs:an8.34": "The rewards of giving are compared to fields of different qualities.",
  "an-blurbs:an8.35": "When giving, if you expect a certain result in the next life, you can get it, if the conditions are right.",
  "an-blurbs:an8.36": "The good deeds of giving, ethics, and meditation lead to good rebirths, depending on the level to which they are developed.",
  "an-blurbs:an8.37": "A good person gives gifts in eight ways.",
  "an-blurbs:an8.38": "When a good person is born, it benefits eight kinds of people, like a rain-cloud showering all over the land.",
  "an-blurbs:an8.39": "Eight streams of merit, consisting in going for refuge and five kinds of gifts.",
  "an-blurbs:an8.40": "Eight kinds of misdeed are conducive to bad outcomes.",
  "an-blurbs:an8.41": "When the sabbath is observed by following the eight precepts, one lives for that day like the perfected ones. Such a sabbath is glorious.",
  "an-blurbs:an8.42": "When the sabbath is observed by following the eight precepts, one lives for that day like the perfected ones. The benefits are explained at length.",
  "an-blurbs:an8.43": "The Buddha teaches the wealthy laywoman Visākhā that when the sabbath is observed by following the eight precepts, one lives for that day like the perfected ones.",
  "an-blurbs:an8.44": "The Buddha teaches the layman Vāseṭṭha that when the sabbath is observed by following the eight precepts, one lives for that day like the perfected ones. Vāseṭṭha exclaims that such a practice would be widely beneficial.",
  "an-blurbs:an8.45": "The Buddha teaches the laywoman Bojjhā that when the sabbath is observed by following the eight precepts, one lives for that day like the perfected ones. Bojjhā exclaims that such a practice would be widely beneficial.",
  "an-blurbs:an8.46": "Some “Agreeable” gods put on a display of music and dance for Venerable Anuruddha, but he is not impressed. He then asks the Buddha how women are reborn in such a heaven.",
  "an-blurbs:an8.47": "The Buddha teaches the laywoman Visākhā eight qualities through which a woman may be reborn among the Agreeable gods.",
  "an-blurbs:an8.48": "The Buddha teaches the housewife Nakulamātā eight qualities through which a woman may be reborn among the Agreeable gods.",
  "an-blurbs:an8.49": "The Buddha teaches the laywoman Visākhā four qualities through which a woman succeeds in this life, and four through which she succeeds in the next.",
  "an-blurbs:an8.50": "The Buddha teaches the mendicants four qualities through which a woman succeeds in this life, and four through which she succeeds in the next.",
  "an-blurbs:an8.51": "Mahāpajāpatī Gotamī, the Buddha’s foster mother, requests ordination from the Buddha. He declines, until urged to relent by Ānanda. He allows Mahāpajāpatī to go forth on eight conditions.",
  "an-blurbs:an8.52": "With eight qualities a monk may be appointed to teach the nuns.",
  "an-blurbs:an8.53": "Mahāpajāpatī wishes to go on retreat, so the Buddha teaches her eight principles that summarize the Dhamma in brief.",
  "an-blurbs:an8.54": "Dīghajāṇu of the Koliyans asks the Buddha to teach in a way suitable for lay people who enjoy life. The Buddha teaches four practical ways to ensure success in this life, and another four ways to ensure success in the next.",
  "an-blurbs:an8.55": "The brahmin Ujjaya is going abroad, and asks the Buddha to teach him. The Buddha teaches four practical ways to ensure success in this life, and another four ways to ensure success in the next.",
  "an-blurbs:an8.56": "The Buddha explains how addiction to sensual pleasures is perilous.",
  "an-blurbs:an8.57": "With eight qualities, a mendicant is worthy.",
  "an-blurbs:an8.58": "With eight qualities, a mendicant is worthy.",
  "an-blurbs:an8.59": "Eight kinds of person are worthy.",
  "an-blurbs:an8.60": "Eight kinds of person are worthy.",
  "an-blurbs:an8.61": "The Buddha describes eight cases where a mendicant has a desire for material things. Sometimes they fall under the sway of that desire, but sometimes they rise above it.",
  "an-blurbs:an8.62": "Eight sets of qualities pertain to benefiting oneself and others.",
  "an-blurbs:an8.63": "A monk asks for teachings before going on retreat, but the Buddha rebukes him, as he has not practiced sincerely. Nevertheless, he persists, and the Buddha teaches him meditation in detail.",
  "an-blurbs:an8.64": "At Gayā, the Buddha describes his meditation before awakening. He was able to see lights and forms, converse with gods, and understand the deeds that made them gods.",
  "an-blurbs:an8.65": "Eight dimensions of meditative mastery, based on the vision of certain shapes and colors.",
  "an-blurbs:an8.66": "Eight meditative liberations, based on the vision of forms and the attainment of the formless.",
  "an-blurbs:an8.67": "Eight kinds of ignoble statement that misrepresent the truth.",
  "an-blurbs:an8.68": "Eight kinds of noble statement that convey the truth.",
  "an-blurbs:an8.69": "Eight kinds of assemblies: aristocrats, brahmins, householders, ascetics, and various deities. The Buddha has visited each of these in disguise.",
  "an-blurbs:an8.70": "When the Buddha gives up his life-force, an earthquake is felt. The Buddha explains to Ānanda the eight causes of earthquakes.",
  "an-blurbs:an8.71": "Beginning with faith, a mendicant completes all good qualities that fulfill liberation.",
  "an-blurbs:an8.72": "Beginning with faith, a mendicant completes all good qualities that fulfill liberation.",
  "an-blurbs:an8.73": "Various mendicants practice mindfulness of death, but do so inadequately. The Buddha explains how to do so with proper urgency,",
  "an-blurbs:an8.74": "A mendicant should reflect each night on the dangers that lie around them, and practice mindfulness of death with urgency to give up the unwholesome.",
  "an-blurbs:an8.75": "Eight accomplishments, both worldly and spiritual.",
  "an-blurbs:an8.76": "Eight accomplishments, both worldly and spiritual, in detail.",
  "an-blurbs:an8.77": "Sāriputta describes eight cases where a mendicant has a desire for material things. Sometimes they fall under the sway of that desire, but sometimes they rise above it.",
  "an-blurbs:an8.78": "Eight sets of qualities pertain to benefiting oneself and others, explained by Sāriputta.",
  "an-blurbs:an8.79": "Eight conditions for the decline or success of a trainee mendicant.",
  "an-blurbs:an8.80": "Eight grounds for laziness, and the corresponding eight grounds for energy.",
  "an-blurbs:an8.81": "Mindfulness and situational awareness are a foundation for developing higher spiritual qualities leading to liberation.",
  "an-blurbs:an8.82": "Venerable Puṇṇiya asks the Buddha why he sometimes feels like teaching and other times doesn’t.",
  "an-blurbs:an8.83": "The root of all things, and other factors that apply to all things.",
  "an-blurbs:an8.84": "The Buddha teaches how to be a success as a master thief. Unusually, this discourse has no “spiritual” counterpart, so it sounds like the Buddha just giving a lesson in thievery! ",
  "an-blurbs:an8.85": "Different titles for the Buddha.",
  "an-blurbs:an8.86": "When the householders of Icchānaṅgala make a racket in the monastery, the Buddha asks his attendant Nāgita what is going on. The Buddha speaks strongly of his dislike for material gains, and his love of seclusion.",
  "an-blurbs:an8.87": "Eight reasons the Saṅgha may overturn the bowl against a lay follower.",
  "an-blurbs:an8.88": "Eight reasons the lay followers may declare no confidence or confidence regarding a mendicant.",
  "an-blurbs:an8.89": "Eight reasons the lay followers may enjoin an act of reconciliation on a mendicant, or relax said act.",
  "an-blurbs:an8.90": "Eight things a mendicant charged with aggravated misconduct must observe.",
  "an-blurbs:an9.1": "Beginning with good friendship, the Buddha teaches nine things that give rise to the qualities that lead to awakening.",
  "an-blurbs:an9.2": "The things that a mendicant relies on as supports in spiritual practice.",
  "an-blurbs:an9.3": "Venerable Meghiya, while attending on the Buddha, wants to go off and meditate in a forest alone. The Buddha discourages him, but he goes anyway. When his meditation doesn’t go well, he returns chastened to the Buddha, who teaches him about the benefits of good companions and other fundamentals of a balanced spiritual practice.",
  "an-blurbs:an9.4": "Nandaka is teaching the monks when the Buddha arrives. Unbeknown to those inside, the Buddha waits until the talk was finished, then enters. Nandaka is embarrassed at keeping the Buddha waiting, but the Buddha praises him and offers a teaching on the four things a mendicant should complete. Nandaka then teaches five benefits of listening to Dhamma.",
  "an-blurbs:an9.5": "A noble disciple who develops four powers overcomes five fears.",
  "an-blurbs:an9.6": "Four kinds of person who one should or should not associate with. A similar distinction is made regarding robes, almsfood, lodgings, towns, and countries.",
  "an-blurbs:an9.7": "The wanderer Sutavā asks the Buddha about five things a perfected one cannot do; the Buddha expands it to nine.",
  "an-blurbs:an9.8": "The wanderer Sajjha asks the Buddha about five things a perfected one cannot do; the Buddha expands it to nine, which differ slightly from AN 9.7.",
  "an-blurbs:an9.9": "Nine kinds of persons: the eight noble persons and the ordinary person.",
  "an-blurbs:an9.10": "Nine persons are worthy of gifts: the eight noble persons and a member of the spiritual family.",
  "an-blurbs:an9.11": "After the rains season, Sāriputta takes leave of the Buddha. Another monk falsely accuses Sāriputta of hitting him before leaving. The Buddha calls Sāriputta to answer the accusation. Before the Saṅgha, Sāriputta denies it, uttering a powerful statement of spiritual prowess.",
  "an-blurbs:an9.12": "Sāriputta visits some wanderers, who claim that only perfected ones are free from bad rebirth. Sāriputta has no opinion on this, but asks the Buddha, who replies that even stream-enterers are freed from lower rebirth.",
  "an-blurbs:an9.13": "Venerables Mahākoṭṭhita and Sāriputta discuss whether the spiritual path is for the purpose of changing the results of deeds.",
  "an-blurbs:an9.14": "Sāriputta questions Venerable Samiddhi on the basis of intentions and thoughts.",
  "an-blurbs:an9.15": "The body is compared to a boil with nine orifices.",
  "an-blurbs:an9.16": "Nine perceptions to be developed in meditation.",
  "an-blurbs:an9.17": "Nine factors in how a family relates to the Saṅgha.",
  "an-blurbs:an9.18": "Nine factors for a glorious sabbath: the eight precepts and the meditation on love.",
  "an-blurbs:an9.19": "Some deities come to the Buddha and speak of how their practice in their past life was limited and unsatisfactory.",
  "an-blurbs:an9.20": "The wealthy and devoted lay supporter Anāthapiṇḍika rather curiously says that only poor alms are given in his home. The Buddha praises gracious and bounteous generosity. But meditation surpasses even the greatest offering.",
  "an-blurbs:an9.21": "A comparison of the people of India, of Uttarakuru, and of the heaven of the Thirty-Three.",
  "an-blurbs:an9.22": "Nine kinds of horses are compared with nine kinds of monks.",
  "an-blurbs:an9.23": "Nine things that are rooted in craving.",
  "an-blurbs:an9.24": "Nine realms into which sentient beings may be reborn.",
  "an-blurbs:an9.25": "Nine reflections by which a mendicant knows their mind has wisdom.",
  "an-blurbs:an9.26": "Venerables Candikāputta and Sāriputta differ in their interpretation of a teaching proposed by the notorious schismatic Devadatta.",
  "an-blurbs:an9.27": "A householder who has eliminated the perils that come with breaking the five precepts, and possesses the four factors of stream-entry is freed from lower rebirths.",
  "an-blurbs:an9.28": "A householder who has eliminated the perils that come with breaking the five precepts, and possesses the four factors of stream-entry is freed from lower rebirths.",
  "an-blurbs:an9.29": "Nine grounds for resentment.",
  "an-blurbs:an9.30": "Nine ways of removing resentment.",
  "an-blurbs:an9.31": "Nine meditative states, each of which arises from the cessation of something present in the previous state.",
  "an-blurbs:an9.32": "Nine progressive meditation states.",
  "an-blurbs:an9.33": "Nine progressive meditation states, explained in detail.",
  "an-blurbs:an9.34": "Sāriputta declares that extinguishment is bliss, precisely because nothing is felt there. He explains this apparent paradox with reference to the nine progressive meditations.",
  "an-blurbs:an9.35": "Just as a foolish cow can get in trouble wandering the mountains, a foolish mendicant can get lost practicing absorption if they do it wrongly.",
  "an-blurbs:an9.36": "The ending of defilements happens due to the practice of absorption meditation.",
  "an-blurbs:an9.37": "Ānanda exclaims how amazing it is that the Buddha has found a way to freedom while still experiencing the world. Questioned by the monk Udāyī, Ānanda recounts a discussion on advanced meditation with the nun Jaṭilagāhiyā.",
  "an-blurbs:an9.38": "Two brahmin cosmologists ask the Buddha to decide between competing claims as to whether the cosmos is infinite. Rejecting metaphysical claims, the Buddha says that there is no end of the world that can be reached by traveling; but without reaching the end of the world you can’t be free of suffering.",
  "an-blurbs:an9.39": "In the wars between gods and demons, they find safety only in their own fortress. Similarly, a mendicant finds safety in absorption.",
  "an-blurbs:an9.40": "A bull elephant, annoyed by living in the herd, goes off by himself. Similarly, a mendicant feeling crowded in a monastery goes off by themselves and happily meditates in seclusion.",
  "an-blurbs:an9.41": "The householder Tapussa reflects that it is renunciation that distinguishes lay from monastic. The Buddha responds by giving a long account of his practice of absorption before awakening.",
  "an-blurbs:an9.42": "At Udāyī’s request, Ānanda explains an obscure verse spoken (in SN 2.7) by a deity. The nine progressive meditations are the escape from confinement.",
  "an-blurbs:an9.43": "The Buddha speaks of a “direct witness’, that is, someone who personally has thorough and proficient experience of the different meditation states.",
  "an-blurbs:an9.44": "One liberated by wisdom first enters the meditation states, then understands them.",
  "an-blurbs:an9.45": "One freed both ways is both proficient in and understands the meditation states.",
  "an-blurbs:an9.46": "The teaching apparent in the present life is experienced provisionally in deep meditation, and completely when the defilements end.",
  "an-blurbs:an9.47": "Extinguishment apparent in the present life is experienced provisionally in deep meditation, and completely when the defilements end.",
  "an-blurbs:an10.1": "The purpose of ethics, leading step by step to liberation.",
  "an-blurbs:an10.2": "There’s no need to make a wish to get enlightened; it happens naturally when the conditions are there.",
  "an-blurbs:an10.3": "The Buddha teaches how, like a tree that grows due to its leaves, liberation follows when ethics is present.",
  "an-blurbs:an10.4": "Sāriputta teaches how, like a tree that grows due to its leaves, liberation follows when ethics is present.",
  "an-blurbs:an10.5": "Ānanda teaches how, like a tree that grows due to its leaves, liberation follows when ethics is present.",
  "an-blurbs:an10.6": "Ānanda asks the Buddha about a mysterious state of immersion in meditation where there is no normal perception, yet one is still conscious.",
  "an-blurbs:an10.7": "Ānanda asks Sāriputta about a mysterious state of immersion in meditation where there is no normal perception, yet one is still conscious. Sāriputta confirms that there is, and claims to have attained it.",
  "an-blurbs:an10.8": "Ten factors, beginning with faith, that a mendicant should fulfill.",
  "an-blurbs:an10.9": "Ten factors, beginning with faith, that a mendicant should fulfill.",
  "an-blurbs:an10.10": "Ten factors, beginning with faith, that a mendicant should fulfill.",
  "an-blurbs:an10.11": "Five factors that a mendicant should have, and five factors of a lodging that they should occupy.",
  "an-blurbs:an10.12": "A mendicant should abandon the five hindrances and possess the five factors of the adept.",
  "an-blurbs:an10.13": "Five lower and five higher fetters.",
  "an-blurbs:an10.14": "Five kinds of emotional barrenness and five emotional shackles.",
  "an-blurbs:an10.15": "Diligence is the foremost of all good qualities.",
  "an-blurbs:an10.16": "Ten persons who are worthy.",
  "an-blurbs:an10.17": "Ten qualities that serve as protector.",
  "an-blurbs:an10.18": "Ten qualities that serve as protector, in detail.",
  "an-blurbs:an10.19": "Ten noble abodes in which the noble ones of the past, present and future abide.",
  "an-blurbs:an10.20": "Ten noble abodes in which the noble ones of the past, present and future abide, in detail.",
  "an-blurbs:an10.21": "Like a lion, a Realized One roars his preeminence based on ten powers.",
  "an-blurbs:an10.22": "The Buddha claims to be assured regarding the various different doctrinal hypotheses, based on the ten powers.",
  "an-blurbs:an10.23": "Some things are to be given by body, others by speech, and still others by wisdom.",
  "an-blurbs:an10.24": "Venerable Mahācunda teaches that, though a mendicant might claim to be free of greed, hate, and delusion, this is not always the case.",
  "an-blurbs:an10.25": "Ten universal dimensions of meditation, or kasiṇas.",
  "an-blurbs:an10.26": "The female lay follower Kāḷī of Kuraraghara in Avantī asks Venerable Mahākaccāna about a verse spoken by the Buddha in “The Maidens’ Questions” (SN 4.25). He replies in terms of the ten universal dimensions of meditation.",
  "an-blurbs:an10.27": "Some wanderers claim to teach the direct knowledge of all things, just like the Buddha. However the Buddha disputes this by presenting ten “Great Questions” that they cannot answer.",
  "an-blurbs:an10.28": "Some lay people ask the nun from Kajaṅgalā regarding the ten “Great Questions”. Though she has not heard this teaching herself, she explains from her own understanding, and is praised by the Buddha.",
  "an-blurbs:an10.29": "Starting with a comparison with the King of Kosala, the Buddha teaches a series of ten advanced teachings. He culminates by affirming that he teaches the full understanding of sensual pleasures, forms, and feelings.",
  "an-blurbs:an10.30": "King Pasenadi returns victorious from battle and immediately goes to see the Buddha, bowing reverentially to his feet, and declaring ten reasons for his love and devotion to the Buddha.",
  "an-blurbs:an10.31": "The Buddha teaches Venerable Upāli the ten reasons for establishing the training rules.",
  "an-blurbs:an10.32": "Ten reasons for suspending the recitation of the code of conduct.",
  "an-blurbs:an10.33": "Ten qualities a mendicant should have to be appointed to judge a dispute.",
  "an-blurbs:an10.34": "Ten qualities a mendicant should have to give ordination.",
  "an-blurbs:an10.35": "Ten qualities a mendicant should have to give dependence.",
  "an-blurbs:an10.36": "Ten qualities a mendicant should have to be attended by a novice.",
  "an-blurbs:an10.37": "Ten reasons for schism in the Saṅgha.",
  "an-blurbs:an10.38": "Ten reasons for harmony in the Saṅgha.",
  "an-blurbs:an10.39": "The Buddha teaches Ānanda the ten reasons for schism in the Saṅgha, as well as the outcome of causing schism.",
  "an-blurbs:an10.40": "The Buddha teaches Ānanda the ten reasons for harmony in the Saṅgha, as well as the outcome of creating harmony.",
  "an-blurbs:an10.41": "Ten reasons for disputes in the Saṅgha.",
  "an-blurbs:an10.42": "Ten roots for disputes in the Saṅgha.",
  "an-blurbs:an10.43": "Ten roots for disputes in the Saṅgha.",
  "an-blurbs:an10.44": "A mendicant who wishes to admonish another should first reflect on five things in themselves and establish a further five.",
  "an-blurbs:an10.45": "Ten dangers for a monk who enters a royal harem. ",
  "an-blurbs:an10.46": "The Sakyans say that they don’t always observe the eight precepts on the sabbath. The Buddha strongly admonishes them to be more consistent.",
  "an-blurbs:an10.47": "Mahāli the Licchavi asks the Buddha for the causes of bad deeds.",
  "an-blurbs:an10.48": "Topics for frequent reflection by one gone forth.",
  "an-blurbs:an10.49": "Ten things that depend on the body.",
  "an-blurbs:an10.50": "Some monks are arguing, so the Buddha teaches them ten warm-hearted principles.",
  "an-blurbs:an10.51": "The Buddha teaches that, if you can’t read anyone else’s mind, read your own by regular self-reflection.",
  "an-blurbs:an10.52": "Sāriputta teaches that, if you can’t read anyone else’s mind, read your own by regular self-reflection.",
  "an-blurbs:an10.53": "The Buddha doesn’t praise stagnation in wholesome qualities, let alone decline.",
  "an-blurbs:an10.54": "The Buddha teaches that, if you can’t read anyone else’s mind, read your own by regular self-reflection. Includes a teaching on various things that should or should not be cultivated.",
  "an-blurbs:an10.55": "Sāriputta explains what the Buddha meant by a mendicant who is in decline.",
  "an-blurbs:an10.56": "Ten meditative perceptions that lead to the deathless.",
  "an-blurbs:an10.57": "Ten meditative perceptions that lead to the deathless.",
  "an-blurbs:an10.58": "The root of all things, and similar principles.",
  "an-blurbs:an10.59": "Ten reflections that strengthen the mind of a renunciate.",
  "an-blurbs:an10.60": "The monk Girimānanda is sick. The Buddha encourages Ānanda to visit him and speak of ten perceptions.",
  "an-blurbs:an10.61": "Even though ignorance has no discernible first point, it still has a cause.",
  "an-blurbs:an10.62": "Even though craving has no discernible first point, it still has a cause.",
  "an-blurbs:an10.63": "Those who have certainty in the Buddha may realize the final goal in this life or the next.",
  "an-blurbs:an10.64": "Stream-enterers may realize the final goal in this life or the next.",
  "an-blurbs:an10.65": "Sāriputta explains to the wanderer Sāmaṇḍakāni that rebirth is suffering, freedom from rebirth is happiness.",
  "an-blurbs:an10.66": "Sāriputta explains to the wanderer Sāmaṇḍakāni that dissatisfaction is suffering, enjoyment is happiness.",
  "an-blurbs:an10.67": "At Naḷakapāna the Buddha invites Sāriputta to teach. He speaks of ten qualities that lead to decline or non-decline.",
  "an-blurbs:an10.68": "At Naḷakapāna the Buddha invites Sāriputta to teach. He speaks of ten qualities that lead to decline or non-decline.",
  "an-blurbs:an10.69": "The monks are sitting around chatting about this and that. The Buddha admonishes them and teaches ten topics of conversation suitable for mendicants.",
  "an-blurbs:an10.70": "The monks are sitting around chatting about this and that. The Buddha admonishes them and teaches ten grounds of praise.",
  "an-blurbs:an10.71": "If a mendicant wishes to attain spiritual heights, they should begin by practicing the code of training rules.",
  "an-blurbs:an10.72": "When the Buddha receives noisy visitors, several monks withdraw to a nearby forest to meditate. The Buddha praises them, saying that noise is a thorn to absorption.",
  "an-blurbs:an10.73": "Ten desirable things that are hard to get.",
  "an-blurbs:an10.74": "Ten aspects of prosperity.",
  "an-blurbs:an10.75": "The female lay disciple Migasālā questions Ānanda how the Buddha could have declared her father and her uncle had the same level of spiritual attainment, when one was much more strict than the other. Ānanda conveys this to the Buddha, who responds that only such as he can pass judgment, since the spiritual faculties of individuals are complex and hard to understand.",
  "an-blurbs:an10.76": "Without rebirth, old age, and death, there would be no teaching of Dhamma. The Buddha teaches a series of sets of three things leading to liberation.",
  "an-blurbs:an10.77": "A bad monk has ten bad qualities, like a crow.",
  "an-blurbs:an10.78": "Jain ascetics have ten bad qualities.",
  "an-blurbs:an10.79": "Ten ground for resentment.",
  "an-blurbs:an10.80": "Ten ways of removing resentment.",
  "an-blurbs:an10.81": "Giving up ten things, the Buddha lives free of limits.",
  "an-blurbs:an10.82": "A mendicant cannot achieve progress if they have ten bad qualities starting with lack of faith.",
  "an-blurbs:an10.83": "Venerable Puṇṇiya asks why the Buddha sometimes feels like teaching, other times not.",
  "an-blurbs:an10.84": "When a mendicant declares enlightenment, the Buddha or another accomplished meditator examines them.",
  "an-blurbs:an10.85": "Venerable Mahācunda teaches that when a mendicant boasts about spiritual attainments, the Buddha or another accomplished meditator examines them.",
  "an-blurbs:an10.86": "Venerable Mahākassapa teaches that when a mendicant declares enlightenment, the Buddha or another accomplished meditator examines them.",
  "an-blurbs:an10.87": "The Buddha, speaking in reference to the monk Kalandaka, explains ten qualities that lead to discord or unity.",
  "an-blurbs:an10.88": "A mendicant who insults their spiritual companions incurs ten disasters.",
  "an-blurbs:an10.89": "The monk Kokālika accuses Sāriputta and Moggallāna of having evil wishes. The Buddha defends them. Later, Kokālika suffers calamity and is reborn in hell.",
  "an-blurbs:an10.90": "Ten powers by which a mendicant knows that they have ended the defilements.",
  "an-blurbs:an10.91": "The Buddha teaches Anāthapiṇḍika ten kinds of persons who enjoy sensual pleasures.",
  "an-blurbs:an10.92": "A noble disciple has eliminated five perils, realized the four factors of stream-entry, and seen the noble process.",
  "an-blurbs:an10.93": "Anāthapiṇḍika visits some wanderers, who ask him about the Buddha’s views. Anāthapiṇḍika asks them to explain their own view first. He then declares his own understanding of impermanence, leaving the wanderers speechless.",
  "an-blurbs:an10.94": "The householder Vajjiyamāhita visits some wanderers, who accuse the Buddha of condemning all asceticism. Vajjiyamāhita counters this by saying the Buddha only criticizes what is worthy of criticism. The Buddha praises him, and explains in detail what this means.",
  "an-blurbs:an10.95": "The wanderer Uttiya asks the Buddha a series of ten metaphysical questions as to whether the cosmos is finite, etc. The Buddha responds by saying that he only teaches the end of suffering. Uttiya goes on to ask whether all beings will be liberated. The Buddha is silent, and Ānanda answers on his behalf.",
  "an-blurbs:an10.96": "The wanderer Kokanada meets Ānanda at the baths and engages him on the topic of the ten metaphysical questions.",
  "an-blurbs:an10.97": "With ten qualities, a mendicant is worthy.",
  "an-blurbs:an10.98": "With ten qualities, a senior mendicant is at ease wherever they live.",
  "an-blurbs:an10.99": "When Upāli asks to go into retreat, the Buddha warns him that secluded wilderness dwellings are hard to endure unless one is accomplished in meditation. He gives a long account of the training required before going into solitude, and ends by encouraging Upāli to stay in the Saṅgha.",
  "an-blurbs:an10.100": "Ten things must be given up before attaining perfection.",
  "an-blurbs:an10.101": "Three ascetic perceptions lead to seven results.",
  "an-blurbs:an10.102": "The seven factors of awakening lead to realizing the three knowledges.",
  "an-blurbs:an10.103": "The tenfold wrong path leads to failure, the tenfold right path leads to success.",
  "an-blurbs:an10.104": "When a person has wrong view, all their path development is wrong. But when they have right view, everything good follows.",
  "an-blurbs:an10.105": "Ignorance is the precursor of wrong view and the other bad qualities, while right view is the opposite.",
  "an-blurbs:an10.106": "Each of the ten path factors wears away its opposite.",
  "an-blurbs:an10.107": "The Buddha speaks of a southern land called “Bath”, but says that a spiritual bath is better.",
  "an-blurbs:an10.108": "The Buddha speaks of a purgative for curing ailments, but says that a spiritual purgative is better.",
  "an-blurbs:an10.109": "The Buddha speaks of a emetic for curing ailments, but says that a spiritual emetic is better.",
  "an-blurbs:an10.110": "The ten path factors each expel their opposite.",
  "an-blurbs:an10.111": "An adept has fulfilled the ten path factors.",
  "an-blurbs:an10.112": "An adept has fulfilled the ten path factors.",
  "an-blurbs:an10.113": "One should understand what is the teaching and what is contrary to the teaching, in brief.",
  "an-blurbs:an10.114": "One should understand what is the teaching and what is contrary to the teaching, in detail.",
  "an-blurbs:an10.115": "One should understand what is the teaching and what is contrary to the teaching. After hearing this in brief from the Buddha, the mendicants seek a detailed answer from Ānanda.",
  "an-blurbs:an10.116": "The wanderer Ajita informs the Buddha that a philosopher has proposed 500 cases for knowing that and argument has been won or lost. The Buddha asks the mendicants about these.",
  "an-blurbs:an10.117": "The wrong path is the near shore where most people dwell; the right path is the far shore, where few have crossed over.",
  "an-blurbs:an10.118": "The wrong path is the near shore where most people dwell; the right path is the far shore, where few have crossed over.",
  "an-blurbs:an10.119": "The Buddha sees Jāṇussoṇī observing the brahmanical ceremony of “descent”. The Buddha teaches his revised version.",
  "an-blurbs:an10.120": "The Buddha teaches his revised version of the brahmanical ceremony of “descent” to the mendicants.",
  "an-blurbs:an10.121": "As the dawn is the forerunner of the sunrise, right view is the forerunner of the path.",
  "an-blurbs:an10.122": "The ten path factors lead to the end of the defilements.",
  "an-blurbs:an10.167": "The Buddha sees Jāṇussoṇī observing the brahmanical ceremony of “descent”. The Buddha teaches his revised version.",
  "an-blurbs:an10.168": "The Buddha teaches his revised version of the brahmanical ceremony of “descent” to the mendicants.",
  "an-blurbs:an10.169": "The Buddha teaches the brahmin Saṅgārava that the wrong path is the near shore where most people dwell; the right path is the far shore, where few have crossed over.",
  "an-blurbs:an10.170": "The wrong path is the near shore where most people dwell; the right path is the far shore, where few have crossed over.",
  "an-blurbs:an10.171": "One should understand what is the teaching and what is contrary to the teaching, in brief.",
  "an-blurbs:an10.172": "One should understand what is the teaching and what is contrary to the teaching. After hearing this in brief from the Buddha, the mendicants seek a detailed answer from Mahākaccāna.",
  "an-blurbs:an10.173": "One should understand what is the teaching and what is contrary to the teaching, in detail.",
  "an-blurbs:an10.174": "The various kinds of bad deeds are caused by greed, hate, and delusion.",
  "an-blurbs:an10.175": "Through the teaching one may avoid the various kinds of bad deeds.",
  "an-blurbs:an10.176": "Cunda the smith tells the Buddha of rites of purification practiced by the western brahmins. The Buddha explains purification in his teaching.",
  "an-blurbs:an10.177": "Jāṇussoṇī describes brahmanical memorial rites for the dead, and asks if sharing merit actually benefits dead relatives. The Buddha replies that it might do in some circumstances.",
  "an-blurbs:an10.211": "The ten kinds of bad deeds lead you to hell; the ten good deeds to heaven.",
  "an-blurbs:an10.216": "Those who do the ten kinds of bad deeds are like creepy creatures.",
  "an-blurbs:an10.217": "The Buddha asserts that one’s kamma must be exhausted before making an end of suffering. This statement precedes a long explanation of deeds and their causes.",
  "an-blurbs:an10.218": "The Buddha asserts that one’s kamma must be exhausted before making an end of suffering. This statement precedes a long explanation of deeds and their causes.",
  "an-blurbs:an10.219": "The Buddha asserts that one’s kamma must be exhausted before making an end of suffering. If one develops the heart’s release through love, no bad deeds can persist there.",
  "an-blurbs:an10.220": "The Buddha teaches a brahmin that bad conduct leads to hell, good conduct to heaven.",
  "an-blurbs:an11.1": "Good conduct leads to non-regret, to joy, and so on all the way to liberation.",
  "an-blurbs:an11.2": "A virtuous person need not make a wish; it is natural for the path to flow on.",
  "an-blurbs:an11.3": "The Buddha teaches that ethical conduct is the vital cause of the good qualities that lead to awakening.",
  "an-blurbs:an11.4": "Sāriputta teaches that ethical conduct is the vital cause of the good qualities that lead to awakening.",
  "an-blurbs:an11.5": "Ānanda teaches that ethical conduct is the vital cause of the good qualities that lead to awakening.",
  "an-blurbs:an11.6": "When a mendicant abuses their fellow monastics, eleven disasters follow.",
  "an-blurbs:an11.7": "Ānanda asks the Buddha about a deep state of meditation where all normal perception has ceased, but there is still perception. The Buddha affirms that such a state exists. Ānanda puts the same question to Sāriputta, and gets the same answer.",
  "an-blurbs:an11.8": "Ānanda asks the Buddha about a deep state of meditation where all normal attention has ceased, but there is still attention. The Buddha affirms that such a state exists.",
  "an-blurbs:an11.9": "The Buddha tells Venerable Sandha to meditate like a trained thoroughbred, not like a wild colt. Doing so, they may attain a deep state.",
  "an-blurbs:an11.10": "Possessing various sets of qualities, a mendicant is best among gods and men.",
  "an-blurbs:an11.11": "Mahānāma the Sakyan sees that the monks are preparing robes after the rains season. Knowing that the Buddha will soon depart, he asks how they are to live with their busy lives.",
  "an-blurbs:an11.12": "Mahānāma the Sakyan sees that the monks are preparing robes after the rains season. Knowing that the Buddha will soon depart, he asks how they are to live with their busy lives.",
  "an-blurbs:an11.13": "Nandiya the Sakiyan moves to Sāvatthī to be near the Buddha. At the end of the rains, he asks the Buddha’s advice on how to live.",
  "an-blurbs:an11.14": "Venerable Subhūti brings the young monk Saddha to meet the Buddha. The Buddha goes on to teach the manifestations of faith.",
  "an-blurbs:an11.15": "The meditation on love has eleven benefits.",
  "an-blurbs:an11.16": "Asked by a householder to teach a path to freedom, Venerable Ānanda explains no less than eleven meditative states that may serve as doors to the deathless.",
  "an-blurbs:an11.17": "A cowherd with eleven qualities is competent to look after a herd of cattle. Likelwise, a mendicant with eleven qualities can grow in the Dhamma.",
  "an-blurbs:an11.18": "The Buddha is asked by the mendicants about a deep state of meditation where all normal perception has ceased, but there is still perception.",
  "an-blurbs:an11.19": "The Buddha teaches the mendicants about a deep state of meditation where all normal perception has ceased, but there is still perception.",
  "an-blurbs:an11.20": "Sāriputta is asked by the mendicants about a deep state of meditation where all normal perception has ceased, but there is still perception.",
  "an-blurbs:an11.21": "Sāriputta teaches the mendicants about a deep state of meditation where all normal perception has ceased, but there is still perception."
}