{
  "iti-blurbs:iti-ekakanipata": "",
  "iti-blurbs:iti-ekakanipata-pathamavagga": "",
  "iti-blurbs:iti1": "Abandon greed, and you’re guaranteed non-return.",
  "iti-blurbs:iti2": "Abandon aversion, and you’re guaranteed non-return.",
  "iti-blurbs:iti3": "Abandon delusion, and you’re guaranteed non-return.",
  "iti-blurbs:iti4": "Abandon anger, and you’re guaranteed non-return.",
  "iti-blurbs:iti5": "Abandon contempt, and you’re guaranteed non-return.",
  "iti-blurbs:iti6": "Abandon conceit, and you’re guaranteed non-return.",
  "iti-blurbs:iti7": "When the mind, cleansed of passion for the All, abandons it, you are capable of putting an end to suffering.",
  "iti-blurbs:iti8": "When the mind, cleansed of passion for conceit, abandons it, you are capable of putting an end to suffering.",
  "iti-blurbs:iti9": "When the mind, cleansed of passion for greed, abandons it, you are capable of putting an end to suffering.",
  "iti-blurbs:iti10": "When the mind, cleansed of passion for aversion, abandons it, you are capable of putting an end to suffering.",
  "iti-blurbs:iti-ekakanipata-dutiyavagga": "",
  "iti-blurbs:iti11": "When the mind, cleansed of passion for delusion, abandons it, you are capable of putting an end to suffering.",
  "iti-blurbs:iti12": "When the mind, cleansed of passion for anger, abandons it, you are capable of putting an end to suffering.",
  "iti-blurbs:iti13": "When the mind, cleansed of passion for contempt, abandons it, you are capable of putting an end to suffering.",
  "iti-blurbs:iti14": "Hindered by the hindrance of ignorance, people go wandering and transmigrating on for a long, long time.",
  "iti-blurbs:iti15": "Fettered with the fetter of craving, beings go wandering and transmigrating on for a long, long time.",
  "iti-blurbs:iti16": "Appropriate attention as the prime internal factor to help those in training.",
  "iti-blurbs:iti17": "Friendship with admirable people as the prime external factor to help those in training.",
  "iti-blurbs:iti18": "Schism in the Sangha leads to the detriment and unhappiness of many beings, both human and divine.",
  "iti-blurbs:iti19": "Concord in the Sangha leads to the welfare and happiness of many beings, both human and divine.",
  "iti-blurbs:iti20": "Corrupt-mindedness leads to rebirth in the planes of deprivation.",
  "iti-blurbs:iti-ekakanipata-tatiyavagga": "",
  "iti-blurbs:iti21": "Clear-mindedness leads to rebirth in a heavenly world.",
  "iti-blurbs:iti22": "“Acts of merit” is a synonym for what is blissful, desirable, pleasing, endearing, charming. The Buddha recalls the results he himself has experienced from doing meritorious deeds.",
  "iti-blurbs:iti23": "Heedfulness with regard to skillful qualities keeps both kinds of benefit secure: benefit in this live and benefit in lives to come.",
  "iti-blurbs:iti24": "In this course of transmigrating, one person would leave behind a heap of bones as large as a mountain—if there were someone to collect the bones and the collection were not destroyed.",
  "iti-blurbs:iti25": "A person who tells a deliberate lie is capable of any evil deed.",
  "iti-blurbs:iti26": "If you knew, as the Buddha did, the results of giving and sharing, you wouldn’t eat without having shared.",
  "iti-blurbs:iti27": "Goodwill far outshines all other ways of making merit.",
  "iti-blurbs:iti-dukanipata": "",
  "iti-blurbs:iti-dukanipata-pathamavagga": "",
  "iti-blurbs:iti28": "Not guarding the doors of the sense faculties and knowing no moderation in food leads to suffering in this life and the next.",
  "iti-blurbs:iti29": "Guarding the doors of the sense faculties and knowing moderation in food leads to ease in this life and the next.",
  "iti-blurbs:iti30": "Two things that cause remorse.",
  "iti-blurbs:iti31": "Two things that cause lack of remorse.",
  "iti-blurbs:iti32": "A person of evil habits and evil views is as if in hell in this lifetime.",
  "iti-blurbs:iti33": "A person of auspicious habits and auspicious views is as if in heaven in this lifetime.",
  "iti-blurbs:iti34": "To lack ardency and compunction makes you incapable of unbinding.",
  "iti-blurbs:iti35": "The holy life is lived for the purpose of restraint and abandoning.",
  "iti-blurbs:iti36": "The holy life is lived for the purpose of direct knowledge and full comprehension.",
  "iti-blurbs:iti37": "A sense of urgency and appropriate exertion bring ease here-and-now, and lead to the ending of the defilements.",
  "iti-blurbs:iti38": "Two thoughts that often occur to the Buddha as he delights in non-ill will and seclusion.",
  "iti-blurbs:iti-dukanipata-dutiyavagga": "",
  "iti-blurbs:iti39": "Two Dhamma sequences: see evil as evil, and become released from it.",
  "iti-blurbs:iti40": "Ignorance leads to lack of conscience and prudence.",
  "iti-blurbs:iti41": "The rewards of noble discernment.",
  "iti-blurbs:iti42": "Conscience and prudence safeguard the world.",
  "iti-blurbs:iti43": "The existence of an unfabricated dimension allows for the escape from conditions.",
  "iti-blurbs:iti44": "Two unbinding properties: with fuel remaining and with no fuel remaining.",
  "iti-blurbs:iti45": "Live enjoying aloofness, delighting in aloofness, inwardly committed to awareness-tranquility, not neglecting jhāna, endowed with clear-seeing insight, and frequenting empty buildings.",
  "iti-blurbs:iti46": "Live with the trainings as your reward, with discernment uppermost, with release the essence, and with mindfulness the governing principle.",
  "iti-blurbs:iti47": "Be wakeful, mindful, alert, centered, sensitive, clear, and calm. And there you should, at the appropriate times, see clearly into skillful mental qualities.",
  "iti-blurbs:iti48": "Two types of behavior that lead to hell.",
  "iti-blurbs:iti49": "How those with vision differ from those who adhere to craving for rebirth and those who slip past into craving to be annihilated.",
  "iti-blurbs:iti-tikanipata": "",
  "iti-blurbs:iti-tikanipata-pathamavagga": "",
  "iti-blurbs:iti50": "Three roots of what is unskillful.",
  "iti-blurbs:iti51": "Three properties: form, formlessness, cessation.",
  "iti-blurbs:iti52": "Three feelings.",
  "iti-blurbs:iti53": "How the three types of feeling should be viewed.",
  "iti-blurbs:iti54": "Three searches: for sensuality, for rebirth, for a holy life.",
  "iti-blurbs:iti55": "Three searches: for sensuality, for rebirth, for a holy life.",
  "iti-blurbs:iti56": "Three defilements.",
  "iti-blurbs:iti57": "Three defilements.",
  "iti-blurbs:iti58": "Three cravings.",
  "iti-blurbs:iti59": "Three qualities that lead beyond Māra’s domain.",
  "iti-blurbs:iti-tikanipata-dutiyavagga": "",
  "iti-blurbs:iti60": "Three grounds for meritorious activity.",
  "iti-blurbs:iti61": "Three eyes: the eye of flesh, the divine eye, and the eye of discernment.",
  "iti-blurbs:iti62": "The noble attainments described in terms of three faculties.",
  "iti-blurbs:iti63": "Three time periods and the importance of comprehending signs.",
  "iti-blurbs:iti64": "Three kinds of misconduct.",
  "iti-blurbs:iti65": "Three kinds of good conduct.",
  "iti-blurbs:iti66": "Three kinds of cleanliness: bodily, verbal, and mental.",
  "iti-blurbs:iti67": "Three forms of sagacity: bodily, verbal, and mental.",
  "iti-blurbs:iti68": "One whose passion, aversion, and delusion are abandoned is freed from Māra’s power.",
  "iti-blurbs:iti69": "To abandon passion, aversion, and delusion is like crossing over the dangers of the ocean.",
  "iti-blurbs:iti-tikanipata-tatiyavagga": "",
  "iti-blurbs:iti70": "The Buddha reports having seen, for himself, beings reborn in planes of deprivation in line with their wrong views and evil actions.",
  "iti-blurbs:iti71": "The Buddha reports having seen, for himself, beings reborn in good destinations in line with their right views and good actions.",
  "iti-blurbs:iti72": "Three properties for escape: from sensuality, from form, and from whatever is fabricated and dependently co-arisen.",
  "iti-blurbs:iti73": "Formless phenomena are more peaceful than forms; cessation, more peaceful than formless phenomena.",
  "iti-blurbs:iti74": "Three types of sons and daughters (when compared to their parents): of heightened birth, of similar birth, and of lowered birth.",
  "iti-blurbs:iti75": "Three types of people: one like a cloud without rain, one who rains locally, and one who rains everywhere.",
  "iti-blurbs:iti76": "Aspiring to three forms of bliss, wise people should guard their virtue.",
  "iti-blurbs:iti77": "This body falls apart; consciousness is subject to fading; all acquisitions are inconstant, sufferingful, subject to change.",
  "iti-blurbs:iti78": "Like attracts like. It’s in accordance with their properties—either low or admirable—that beings come together and associate with one another.",
  "iti-blurbs:iti79": "Three things lead to the falling away of a monk in training.",
  "iti-blurbs:iti-catutthavagga": "",
  "iti-blurbs:iti80": "Three kinds of unskillful thinking.",
  "iti-blurbs:iti81": "The dangers of letting your mind be overcome by the fact that you either receive offerings or don’t receive offerings.",
  "iti-blurbs:iti82": "Three occasions on which devas give voice to joy over the behavior of human beings.",
  "iti-blurbs:iti83": "Five omens that appear when a deva is about to pass away, and the encouragement that other devas give at that time.",
  "iti-blurbs:iti84": "Three people who appear for the benefit of the world.",
  "iti-blurbs:iti85": "The rewards of focusing on the foulness of the body, of establishing mindfulness of breathing to the fore, and of focusing on the inconstancy of all conditions.",
  "iti-blurbs:iti86": "Practicing the Dhamma in accordance with the Dhamma.",
  "iti-blurbs:iti87": "Three kinds of unskillful thinking; three kinds of skillful thinking.",
  "iti-blurbs:iti88": "Three inside stains.",
  "iti-blurbs:iti89": "Conquered by three forms of false Dhamma, Devadatta was incurably doomed to deprivation.",
  "iti-blurbs:iti-pancamavagga": "",
  "iti-blurbs:iti90": "Three supreme objects of confidence: the Buddha, the Dhamma, and the Saṅgha.",
  "iti-blurbs:iti91": "Why reasonable people take up the life of alms-going, and the dangers that lie in wait if they do not train their minds.",
  "iti-blurbs:iti92": "To see the Dhamma is to see the Buddha and to be close to him, even when physically far away.",
  "iti-blurbs:iti93": "The three fires: of passion, aversion, and delusion.",
  "iti-blurbs:iti94": "On having consciousness neither externally scattered and diffused, nor internally positioned.",
  "iti-blurbs:iti95": "Three ways in which devas obtain sensual pleasures.",
  "iti-blurbs:iti96": "The yoke of sensuality and the yoke of rebirth.",
  "iti-blurbs:iti97": "Admirable virtue, admirable qualities, and admirable discernment defined.",
  "iti-blurbs:iti98": "Two kinds of gifts, sharing, and assistance: in material things and in Dhamma.",
  "iti-blurbs:iti99": "The three knowledges that characterize a brahman in the Buddha’s sense of the word.",
  "iti-blurbs:iti-catukkanipata": "",
  "iti-blurbs:iti-brahmanadhammayagavagga": "",
  "iti-blurbs:iti100": "The Buddha as doctor; the monks as his heirs in Dhamma, not in material things.",
  "iti-blurbs:iti101": "The four basic requisites are easy to gain and blameless. To be content with them is a factor of the contemplative life.",
  "iti-blurbs:iti102": "For one knowing and seeing the four noble truths, there is the ending of suffering.",
  "iti-blurbs:iti103": "To see the four noble truths is to count as a true contemplative.",
  "iti-blurbs:iti104": "The rewards of associating with those who genuinely count as admirable friends.",
  "iti-blurbs:iti105": "Where a monk’s craving takes birth.",
  "iti-blurbs:iti106": "Mother and father as the Brahmās and first teachers of their children.",
  "iti-blurbs:iti107": "The reciprocal ways in which monks and lay supporters benefit one another.",
  "iti-blurbs:iti108": "Monks who are and who are not the Buddha’s true followers.",
  "iti-blurbs:iti109": "An extended metaphor for the dangers of “going with the flow.”",
  "iti-blurbs:iti110": "What it means to have ardency and compunction.",
  "iti-blurbs:iti111": "When one is consummate in virtue, what more is to be done?",
  "iti-blurbs:iti112": "The qualities that entitle the Buddha to be called Tathāgata."
}