{
  "pv-blurbs:pv1": "Arahants are like a field where we can plant offerings.",
  "pv-blurbs:pv2": "Even using harsh speech is enough to cause suffering.",
  "pv-blurbs:pv3": "A ghost explains the danger of using harsh speech.",
  "pv-blurbs:pv4": "How do we help our departed relatives?",
  "pv-blurbs:pv5": "The Supreme Buddha explains how to share merit with past relatives.",
  "pv-blurbs:pv6": "A ghost explains her suffering due to lying and evil deeds from a previous life.",
  "pv-blurbs:pv7": "Jealousy and hatred can only lead to suffering.",
  "pv-blurbs:pv8": "How do we help those who are stricken with grief?",
  "pv-blurbs:pv9": "What happens when you insult those who give?",
  "pv-blurbs:pv10": "A ghost explains the value of giving and sharing merit.",
  "pv-blurbs:pv11": "Why is important to give when we have the opportunity?",
  "pv-blurbs:pv12": "Is it possible to not be sad when someone dies? It is for noble disciples of the Supreme Buddha.",
  "pv-blurbs:pv13": "What could happen if we don’t give and are greedy?",
  "pv-blurbs:pv14": "How can we reduce our past relatives’ suffering?",
  "pv-blurbs:pv15": "Even minor evil actions can result in immense suffering.",
  "pv-blurbs:pv16": "Harsh speech and evil actions only brings negative results.",
  "pv-blurbs:pv17": "What should we do to secure happiness in our next life?",
  "pv-blurbs:pv18": "How should we think to overcome grief?",
  "pv-blurbs:pv19": "What can happen if we don’t give and insult those who do?",
  "pv-blurbs:pv20": "Why should we share merit with our past relatives?",
  "pv-blurbs:pv21": "Giving will always bring good results.",
  "pv-blurbs:pv22": "Harsh speech against those who do good result in suffering.",
  "pv-blurbs:pv23": "Even a small action can bring immense merit.",
  "pv-blurbs:pv24": "A ghost explains the severity of sexual misconduct.",
  "pv-blurbs:pv25": "An ascetic consoles Queen Ubbari and extinguishes her grief.",
  "pv-blurbs:pv26": "Generosity will lead to happiness and good results.",
  "pv-blurbs:pv27": "A ghost reveals how to share merit with his past relatives.",
  "pv-blurbs:pv28": "A ghost explains how to direct merit towards a good destination.",
  "pv-blurbs:pv29": "Greed and deceit only brings pain and suffering.",
  "pv-blurbs:pv30": "How does one escape from their evil past?",
  "pv-blurbs:pv31": "What happens when you let greed cloud your judgement?",
  "pv-blurbs:pv32": "Keeping precepts even for a small duration will provide benefits.",
  "pv-blurbs:pv33": "Taking the life of another will only lead to suffering.",
  "pv-blurbs:pv34": "What are the dangers of lying, gossip and divisive speech?",
  "pv-blurbs:pv35": "Insulting those who worship the Buddha’s relics will only bring suffering.",
  "pv-blurbs:pv36": "How does one escape from the path leading to hell?",
  "pv-blurbs:pv37": "A deva explains the results of good actions and following precepts to a group of merchants lost in the desert.",
  "pv-blurbs:pv38": "A ghost advises a king on the dangers of wrong views and the importance of taking refuge in the Triple Gem.",
  "pv-blurbs:pv39": "Two hell wardens explain to Revati the results of her evil deeds and show her the results of her husband’s merit.",
  "pv-blurbs:pv40": "A monk explains to a ghost the results of giving reluctantly.",
  "pv-blurbs:pv41": "What are the results of indulging in excessive sensual pleasures?",
  "pv-blurbs:pv42": "What happened to a prince that committed evil actions towards a Pacceka Buddha?",
  "pv-blurbs:pv43": "What happens when you associate with evil monks?",
  "pv-blurbs:pv44": "A ghost explains the results of associating with an evil monk.",
  "pv-blurbs:pv45": "Arahant Moggallana talks with ghosts who suffer due to their stinginess in the human world.",
  "pv-blurbs:pv46": "A woman and a ghost discuss doing meritorious deeds to avoid bad destinations.",
  "pv-blurbs:pv47": "What happens when you share merits with your past relatives?",
  "pv-blurbs:pv48": "What was the result of giving a small gift?",
  "pv-blurbs:pv49": "What happens when you earn money in bad ways?",
  "pv-blurbs:pv50": "Ghosts discuss their past about not practicing generosity.",
  "pv-blurbs:pv51": "Arahant Moggallana asks a ghost about his past evil actions."
}