{
  "sn-blurbs:sn-sagathavaggasamyutta": "The “Book With Verses” is the first of the five books of the Linked Discourses. It is divided into eleven <i lang='pi' translate='no'>saṁyuttas</i> or “sections”, with a total of 271 suttas. Most of these are further subdivided into <i lang='pi' translate='no'>vaggas</i> of ten suttas. The word <i lang='pi' translate='no'>vagga</i> is thus used of both the major overarching “book” and the subsidiary “chapter”. Each of the suttas in this collection contains verse with a prose narrative structure, although in many cases the prose has been omitted through abbreviation. Where most of the Saṁyutta is organized around subject matter, here the organizational principle is people. Each <i lang='pi' translate='no'>saṁyutta</i> contains conversation involving the Buddha or his disciples with a different person or kind of person, such as gods, kings, nuns, or brahmins. A typical sutta has a bare narrative framework, where someone comes to the Buddha and utters a verse, and the Buddha replies with a better one. In some cases, notably the Sakkasaṁyutta, the narrative element is developed into a lively exchange. Some of the texts in this collection are well known and widely quoted, such as the invitation of Brahmā or the nun Vajirā’s simile of the person as a chariot. Most of the suttas here have parallels in the Chinese Saṁyuktāgama translations; the partial translations SA 2 and SA 3 include Sagāthāvagga material. In addition, many of the verses have parallels elsewhere throughout the Buddhist literature in all languages.",
  "sn-blurbs:sn1": "The “Linked Discourses on Deities” contains 81 discourses, each one of which depicts the Buddha in conversation with a deity. Typically a deity approaches the Buddha in the monastery at Sāvatthī, illuminating the night with their glory. The deity addresses the Buddha with a question or verse, which may be a praise, a challenge, a riddle, or simply a reflection. The Buddha responds, usually elevating the discourse to a higher plane. As always in Buddhist texts, a deity is not worshiped, but is regarded as a temporary rebirth in a higher plane; the deities learn from the Buddha, not the other way around. In most cases, the narrative framework is slim, and after a while it is dropped entirely, retaining just the verses. There’s no particular theme to the discourses, which range from the simple to the profound.",
  "sn-blurbs:sn2": "The “Linked Discourses on Gods” contains 30 discourses, each one of which depicts the Buddha in conversation with a god. Here the term <i lang='pi' translate='no'>devaputta</i> is used, rather than <i lang='pi' translate='no'>devatā</i> in the previous <i lang='pi' translate='no'>saṁyutta</i>. The difference is purely nominal and there is no difference in the meaning. The style of discourses is similar to the “Linked Discourses on Deities”, although here there is a greater emphasis on the theme of renunciation. A number of these discourses are regularly recited in modern Theravāda; the Tāyana verses on diligent striving at SN 2.8 are often recited by monastics, while the discourses on the sun and the moon (SN 2.9 and SN 2.10) are popular protection chants, which are also found in Tibetan.",
  "sn-blurbs:sn3": "The “Linked Discourses with the Kosalan” contains 25 discourses featuring King Pasenadi of Kosala. Pasenadi shines through in the early texts as a complex human figure, one with foibles and foolishness, but with a great devotion and capacity to grow. He appears frequently elsewhere in the suttas; MN 87 tells the story of how Queen Mallikā led him to the Dhamma. Here Mallikā appears again, and in SN 3.8 she shows how she is not afraid to challenge her king. The suttas in this collection typically set the verses in substantive prose narratives, illustrating the struggles and problems that beset a king intent on Dhamma who must nonetheless rule in a world with spies, sacrifices, punishments, wars, and the many temptations of royal life.",
  "sn-blurbs:sn4": "The “Linked Discourses with Māra” contains 25 discourses featuring Māra, the god of temptation, deceit, and death. In these discourses, Māra typically appears in some terrifying or beguiling form, hoping to disturb the Buddha, or else he challenges the Buddha with a critical verse. Like the previous section, the narrative prose here is substantive. The Buddha recognizes him at once and exposes his deceit in a verse. Māra also appears throughout the next collection, where the nuns take him on. ",
  "sn-blurbs:sn5": "The “Linked Discourses with Nuns” contains 10 discourses describing occasions when various nuns retreat to a forest for meditation, only to be challenged by Māra. The verses here partly overlap with the Therīgāthā, though there are some that are unique to this context, and we also have a prose narrative to flesh out the context. Māra’s challenges are various; sometimes he is sexist, alleging that women are weak in wisdom (SN 5.2). Several of these short texts are among the most frequently quoted of all the suttas.",
  "sn-blurbs:sn6": "The “Linked Discourses with Brahmās” contains 15 discourses featuring high brahmanical deities. Most commonly we meet the “Great Brahmā”, regarded as the creator God, but he is merely one of a class of deities, and here we meet several others. Brahmā is depicted here and elsewhere in early Buddhist texts in a respectful way, regarded as a glorious deity reborn in his realm due to powerful good kamma. As here, he frequently acts as a champion for the Buddhist cause. However, like all the gods, he is still under the influence of delusion and has nor escaped rebirth.",
  "sn-blurbs:sn7": "The “Linked Discourses with Brahmins” contains 22 discourses featuring the Buddha interacting with various members of the brahmanical caste. The brahmins were the custodians of the brahmanical scriptures and traditions, and saw themselves as the spiritual elite of society. A central platform of the Buddha’s ethical teaching was that one’s worth is determined by one’s deeds, not by caste. This was a direct challenge to brahmanical authority, and a number of discourses have an understandably combative air to them. But the brahmins were a diverse community, and it’s just as common to find them relating to the Buddha with respect and gratitude.",
  "sn-blurbs:sn8": "The “Linked Discourses with Vaṅgīsa” contains 12 discourses with verses spoken by Vaṅgīsa, the most renowned poet of early Buddhism. His verses have a sophistication and personal vulnerability that stamp them as perhaps the most distinctive literary voice of the early texts. Several of these discourses speak of his insecurities and struggles, and how he was helped to overcome them. Others speak from his joyous devotion to the Buddha and the Saṅgha, and of his final triumph.",
  "sn-blurbs:sn9": "The “Linked Discourses in the Woods” contains 14 discourses with verses telling the experiences of certain monks living the woods. Typically the monk is slack or negligent in some way, and a deity appears to call them out and encourage them to greater diligence.",
  "sn-blurbs:sn10": "The “Linked Discourses with Spirits” contains 12 discourses with verses telling the encounters between the Buddha—or in one case the monk Anuruddha—and various spirits (<i lang='pi' translate='no'>yakkha</i>). The spirits were local deities worshiped in ancient India, of a lower order than the gods and Brahmās. While in later forms of Buddhism, such spirits were typically depicted as malevolent or dangerous, in the early texts they are more ambivalent, and many of them are friendly, merely asking Dhamma questions, or extolling Dhamma virtues like mindfulness. That’s not to say they couldn’t be scary, and several discourses reveal a more ferocious aspect. Particularly interesting is the emphasis on the love that the female spirits feel for their children.",
  "sn-blurbs:sn11": "The “Linked Discourses with Sakka” contains 25 discourses with verses telling stories involving Sakka, the Lord of the Thirty-Three gods. Many of these discourses are relatively lengthy, featuring substantive prose and extended dialogues in verse. Sakka is shown devoted to the Buddha, defending Buddhist virtues of kindness and forgiveness, even in the waging of war with the demons.",
  "sn-blurbs:sn-nidanavaggasamyutta": "The “Book of Causation” is the second of the five books of the Linked Discourses. It is named after the first and longest <i lang='pi' translate='no'>saṁyutta</i>, which deals with causation through the core Buddhist teaching of Dependent Origination. The remaining nine <i lang='pi' translate='no'>saṁyuttas</i> deal with miscellaneous secondary themes, some organized by subject, others by person.",
  "sn-blurbs:sn12": "The “Linked Discourses on Causation” is a major collection containing 93 discourses on the core Buddhist teaching of dependent origination. Dependent origination presents a series of conditional links laying bare how suffering originates and how it ends. As such, it is an extended treatment of the second and third noble truths. It integrates psychological and existential aspects of suffering, showing how when bound by attachment we make choices that bind us to transmigrating into future lives. One of the core purposes is to explain how rebirth takes place without having to invoke metaphysical concepts such as a “soul”. The collection begins by defining each of the terms in the standard 12-linked chain, definitions which are assumed to apply throughout. Remaining discourses iterate on this theme, introducing new perspectives and formulations. ",
  "sn-blurbs:sn13": "The “Linked Discourses on the Breakthrough” contains 11 discourses on the value of realizing the Dhamma. Each discourse features a memorable simile illustrating the truly momentous implications of seeing the four noble truths.",
  "sn-blurbs:sn14": "The “Linked Discourses on the Elements” contains 39 discourses on various factors classified as “elements” (<i lang='pi' translate='no'>dhātu</i>). In Buddhism, the term “element” is applied to a range of phenomena, most commonly the main material properties of earth, water, fire and air. Here, however, these four elements play only a small role, and much of the text is devoted to analysis of the perceptual process, and to various character traits. The relation or dependence of elements on each other is a major theme, and this chapter can be seen as an appendix to the chapter on causality.",
  "sn-blurbs:sn15": "The “Linked Discourses on the Unknowable Beginning” contains 20 discourses that speak of how the ultimate origin of the process of transmigration (<i lang='pi' translate='no'>saṁsāra</i>) is unknowable. This theme is a direct counter to the hubris of the creation myths found in most religions, which confidently recount events which are in fact permanently hidden from view. The Buddha emphasized that transmigration has been ongoing for a fathomless period of time, illustrating it with a series of powerful similes.",
  "sn-blurbs:sn16": "The “Linked Discourses with Kassapa” contains 13 discourses featuring one of the most famous of the Buddha’s disciples, the monk Kassapa. Kassapa was an ascetic and diligent practitioner, whose sometimes critical voice was tempered by a love of nature and a tender concern for the lay community. These discourses show his magnificent spiritual attainments, and his overriding concern for the health and longevity of the Buddhist community.",
  "sn-blurbs:sn17": "The “Linked Discourses on Gains and Honor” contains 43 discourses warning the mendicants of the terrible dangers inherent in material possessions and love of popularity and honors.",
  "sn-blurbs:sn18": "The “Linked Discourses with Rāhula” contains 22 discourses with the Buddha interrogating his son Rāhula on fundamental doctrines such as the aggregates or sense fields.",
  "sn-blurbs:sn19": "The “Linked Discourses with Lakkhaṇa” contains 21 discourses with the Buddha featuring the monk Lakkhaṇa (“Mark”). Through his psychic powers he sees beings in various states of torment and distress, and describes them to the Buddha.",
  "sn-blurbs:sn20": "The “Linked Discourses with Similes” contains 12 discourses with parables or similes illustrating diverse points of the teaching. This chapter highlights the Buddha’s skill in choosing vivid and suitable similes for any occasion.",
  "sn-blurbs:sn21": "The “Linked Discourses with Monks” contains 12 discourses featuring different monks. Unlike the chapter on nuns, this does not use a consistent template, but depicts a diverse range of scenarios. Each case shows a personal challenge or spiritual triumph, shedding a light on the life of the monks.",
  "sn-blurbs:sn-khandhavaggasamyutta": "The “Book of the Aggregates” is the third of the five books of the Linked Discourses. It is named after the first and longest <i lang='pi' translate='no'>saṁyutta</i>, which deals with the core Buddhist teaching of the five aggregates. Of the remaining twelve <i lang='pi' translate='no'>saṁyuttas</i>, three also take up the theme of the aggregates, while the remainder deal with miscellaneous secondary themes, some organized by subject, others by person.",
  "sn-blurbs:sn22": "The “Linked Discourses on the Aggregates” contains 159 discourses on the core doctrinal topic of the five aggregates. This term was introduced in the first sermon as the summary of the noble truth of suffering, and became a foundational teaching in all forms of Buddhism. The basic idea of an “aggregate” is a set or class of phenomena. The five are form (<i lang='pi' translate='no'>rūpa</i>, i.e. “physical phenomena”, or sometimes simply “body”; note that in Buddhism, <i lang='pi' translate='no'>rūpa</i> includes all things with material properties such as shape and color, including visions perceived only in the mind), feeling (<i lang='pi' translate='no'>vedanā</i>, i.e. the pleasant, painful, or neutral tone of experience), perception (<i lang='pi' translate='no'>saññā</i>, i.e. the recognition or interpretation of experience, <em>not</em> sense awareness), choices (<i lang='pi' translate='no'>saṅkhārā</i>, i.e. intention, will, or volition; the choice to perform an act, especially one with an ethical dimension), and consciousness (<i lang='pi' translate='no'>viññāṇa</i>, i.e. the subjective process of awareness itself). The “aggregates” are the various different phenomena so classified. Almost always, they are referred to as the “aggregates connected with grasping” (<i lang='pi' translate='no'>upādānakkhandha</i>). The relation between “grasping” and “aggregate” encompasses a number of aspects. The aggregates are the <em>subject</em> of grasping, in that they are the things that are normally attached to and taken to be the permanent “self”. But they are not merely passive spectators: they are also the <em>functional support</em> of grasping, the things that make grasping work. As active participants in the process of grasping, they <em>stimulate</em> grasping to themselves (<i lang='pi' translate='no'>upādāniya</i>). And finally, they are the <em>product</em> of grasping in the sense that attachments in past lives have given rise to the aggregates in this life (<i lang='pi' translate='no'>upādinna</i>). One of the key functions of the aggregates is to categorize theories of the self. From the discourses, non-Buddhists seem to be familiar with this, yet we cannot identify the aggregates in any pre-Buddhist texts. Regardless of whether the set of categories was pre-Buddhist, the Buddha treated them in his own distinctive way, emphasizing that nothing in the aggregates was a permanent self or soul. In this collection we find a large number of striking and lively narratives, showing how the aggregates could be a solace at the time of death, a guide to the knotty theoretical debates on identity, or a framework for insight meditation. Many of the short abbreviated texts are built from the same templates employed in the “Linked Discourses on the Six Sense Fields”.",
  "sn-blurbs:sn23": "The “Linked Discourses with Rādha” contains 46 discourses with a monk named Rādha on the topic of the five aggregates, and may be considered as an appendix to the previous <i lang='pi' translate='no'>saṁyutta</i>. ",
  "sn-blurbs:sn24": "The “Linked Discourses on Views” contains 96 discourses on views, methodically analyzed through the lens of the aggregates. A wide variety of views is assessed, most of which are familiar from elsewhere in the canon, although the first one is unique.",
  "sn-blurbs:sn25": "The “Linked Discourses on Arrival” is the first of three similar sections, each of which takes a set of ten doctrinal items (shared also with SN 18 Rāhula) and presents it according to a set pattern. The current chapter focuses on the distinction between those who accept the teachings by either faith or intellectual understanding, and those who have realized them for themselves.",
  "sn-blurbs:sn26": "The “Linked Discourses on Arising” is the second of three similar sections, each of which takes a set of ten doctrinal items and presents it according to a set pattern. The current chapter focuses on the fact that anyone who has these things will suffer.",
  "sn-blurbs:sn27": "The “Linked Discourses on Corruptions” is the third of three similar sections, each of which takes a set of ten doctrinal items and presents it according to a set pattern. The current chapter focuses on the fact that desire for these things is a corruption of the mind.",
  "sn-blurbs:sn28": "The “Linked Discourses with Sāriputta” describes Sāriputta’s deep meditation practice, and his conversations with Ānanda, who noticed how radiant and glowing he was. An exception to this pattern is the final sutta, which depicts Sāriputta responding to the challenges of a female wanderer.",
  "sn-blurbs:sn29": "The “Linked Discourses on Dragons” is the first of four similar sections dealing with the modes in which various semi-celestial beings may be reborn. The current chapter is on the “dragons” or <i lang='pi' translate='no'>nāgas</i>, a powerful but morally ambiguous serpentine creature of the waterways.",
  "sn-blurbs:sn30": "The “Linked Discourses on Phoenixes” is the second of four similar sections dealing with the modes in which various semi-celestial beings may be reborn. The current chapter is on the “phoenixes” or <i lang='pi' translate='no'>supaṇṇas</i>, otherwise known as <i lang='pi' translate='no'>garuḍa</i>, powerful bird-spirits that are the natural antagonists to the dragons in Indian mythology.",
  "sn-blurbs:sn31": "The “Linked Discourses on Fairies” is the third of four similar sections dealing with the modes in which various semi-celestial beings may be reborn. The current chapter is on the “fairies” or <i lang='pi' translate='no'>gandhabbas</i>, who take on a number of benign aspects as minor deities associated with music, childbirth, and as here, plants.",
  "sn-blurbs:sn32": "The “Linked Discourses on Cloud Gods” is the last of four similar sections dealing with the modes in which various semi-celestial beings may be reborn. The current chapter is on the “cloud gods” or <i lang='pi' translate='no'>valāhakas</i>, who are deities of the weather controlling the clouds.",
  "sn-blurbs:sn33": "The “Linked Discourses with Vacchagotta” contains 55 discourses, each with a philosophical inquiry by the wanderer Vacchagotta. These do not exhaust his questions; he also appears in a number of other discourses, notably MN 71–73, where he resolves his doubts and becomes perfected. The current chapter shows him repeatedly raising the question of the ten speculative views, and why they appear. The discourses are entirely formulaic and appear to have been produced from a template. Unusually for a section of this length, it lacks <i lang='pi' translate='no'>vaggas</i>.",
  "sn-blurbs:sn34": "The “Linked Discourses on Absorption” (Jhānasaṁyutta) is also known as the “Linked Discourses on Immersion” (Samādhisaṁyutta). It contains 55 discourses dealing with the meditative skills required to perfect absorption. Each discourse describes a meditator who is skilled in some aspects, but not in others, and holds the one skilled in all aspects to be the best.",
  "sn-blurbs:sn-salayatanavaggasamyutta": "The “Book of the Six Sense Fields” is the fourth of the five books of the Linked Discourses. It is named after the first and longest <i lang='pi' translate='no'>saṁyutta</i>, which deals with the core Buddhist teaching of the six sense fields. The second <i lang='pi' translate='no'>saṁyutta</i> on Feelings also deals with a major doctrinal topic. The remaining eight <i lang='pi' translate='no'>saṁyuttas</i> deal with miscellaneous secondary themes, some organized by subject, others by person.",
  "sn-blurbs:sn35": "The number of discourses in the “Linked Discourses on the Six Sense Fields” varies between editions, mainly due to the way repetitions are counted; SuttaCentral follows Bhikkhu Bodhi’s translation in counting 248 discourses. The six sense fields complement the five aggregates as the summary of the noble truth of suffering. Where the aggregates focus on the functional structure of experience as basis for views of self, the emphasis here is on how sense experience stimulates desire. Despite this difference in orientation, the two collections share much in common, and often the exact same template is applied in both cases. The six sense fields are the means through which the world is known, and so each of them has an “inner” and an “outer” aspect—the “eye” and “sights”, etc. Though common, it’s best to avoid thinking of the external sense field as the “object”, since in the suttas they are depicted in relation to the observing mind, and not as independently existing entities. This is straightforward until we come to the last sense, the “mind” and “thoughts” or “mental phenomena”. Just to clear up a possible confusion, this “sixth sense” is simply the mental faculty, and has nothing to do with psychic powers. The outer aspect is <i lang='pi' translate='no'>dhammā</i>, a term so ambiguous its translation is always difficult. Here it refers to anything that may be known directly by the mind, distinct from the five senses. The most technically correct translation is probably “mental phenomena”, but “thought’ may be used as a more colloquial rendering, so long as it includes ideas, imagination, and so on, not just verbalized cognition.",
  "sn-blurbs:sn36": "The “Linked Discourses on Feelings” contains 31 discourses on the three kinds of feeling. In Sinhalese-script manuscripts, this is reckoned as the last portion of the section on six sense fields. The term “feelings” renders <i lang='pi' translate='no'>vedanā</i>, which is the simple affective or hedonic tone of experience as pleasant, painful, and neutral, rather than the complex states we call “emotions”. In the process of experience, feeling emerges from sense contact, and stimulates craving. One of the aims of mental development is to first loosen, then eliminate that second link, so that one still has feelings, but does not experience craving for them. The current collection includes a number of rich and significant discourses on this theme.",
  "sn-blurbs:sn37": "The “Linked Discourses on Females” contains 34 discourses regarding various qualities of women. Note that the Pali texts use two distinct terms for women, <i lang='pi' translate='no'>itthī</i> and <i lang='pi' translate='no'>mātugāma</i>, the latter of which can be translated as “females”. These texts deal with such themes as the kinds of suffering unique to women, why women are reborn in various states, or the qualities that lead to a woman taking charge in her marriage.",
  "sn-blurbs:sn38": "The “Linked Discourses with Jambukhādaka” contains 16 discourses recording the answers given by Sāriputta to the questions of a wanderer named Jambukhādaka. The questions cover a wide range of themes, from the nature of extinguishment to the difficulty of practicing the Dhamma. This chapter is practically identical to the next, differing only in the name of the wanderer.",
  "sn-blurbs:sn39": "The “Linked Discourses with Sāmaṇḍaka” contains 16 discourses recording the answers given by Sāriputta to the questions of a wanderer named Sāmaṇḍaka. The questions cover a wide range of themes, from the nature of extinguishment to the difficulty of practicing the Dhamma. This chapter is practically identical to the previous, differing only in the name of the wanderer, and the Pali editions abbreviate, instructing that it is to be expanded.",
  "sn-blurbs:sn40": "The “Linked Discourses with Moggallāna” contains 11 discourses featuring Moggallāna, one of the chief disciples. He tells the monks of his struggles in meditation, and how he was encouraged by the Buddha. In the last two discourses, he visit the heavens and teaches the gods.",
  "sn-blurbs:sn41": "The “Linked Discourses with Citta” contains 10 discourses featuring the householder Citta, who was praised by the Buddha as the foremost lay disciple in speaking on the Dhamma. Here he engages in a series of insightful and sharp-witted dialogues with various monks. Citta emerges as a distinctive personality, knowledgeable and witty, curious and incisive, with no lack of humor. But he is more than just a clever speaker, for he also lays claim to exalted meditation and spiritual attainments.",
  "sn-blurbs:sn42": "The “Linked Discourses with Chiefs” contains 13 discourses featuring various headmen or chiefs. They sometimes ask questions relating to their professions, from entertainers to warriors, while several discourses touch on familiar Dhamma themes, such as overcoming anger, the validity of brahmanical rites, or whether monastics should use money. Some of the chiefs are quite adversarial, aiming to trip up the Buddha in debate, or accusing him of being a magician. In the end, though, the Buddha’s compassionate and measured responses win them over.",
  "sn-blurbs:sn43": "The “Linked Discourses on the Unconditioned” contains 44 discourses on the theme of the unconditioned, i.e. <i lang='pi' translate='no'>nibbāna</i> or “extinguishment”. They focus on the various practices that lead to the unconditioned. This chapter includes an extensive range of terms and idioms describing the final goal of Buddhist practice.",
  "sn-blurbs:sn44": "The “Linked Discourses on the Undeclared” contains 44 discourses on the theme of the ten “undeclared” questions. These are a stock series of metaphysical hypotheses, which the Buddha dismissed as being based on the implicit assumption of a self, and hence as being counterproductive to liberation. The first discourse here features a conversation between King Pasenadi and the nun Khemā on this topic.",
  "sn-blurbs:sn-mahavaggasamyutta": "The “Great Book” is the last and largest of the five books of the Linked Discourses. It consists of twelve <i lang='pi' translate='no'>saṁyuttas</i>, almost all of which deal with an aspect of Buddhist practice, or the path. The first of these, indeed, is the “Section on the Path” (<i lang='pi' translate='no'>Maggasaṁyutta</i>), and in the northern canons the book as a whole is referred to as the “Book of the Path” (<i lang='pi' translate='no'>Maggavagga</i>). The first seven of the <i lang='pi' translate='no'>saṁyuttas</i> treat the familiar set of seven groups of factors on Buddhist practice known to the later traditions as the <i lang='pi' translate='no'>bodhipakkhiyā dhammā</i>, or “qualities leading to awakening”. This book is the primary source for these teachings. Subsequent <i lang='pi' translate='no'>saṁyuttas</i> deal with the path from different perspectives, while the final two deal with stream-entry and the four noble truths respectively.",
  "sn-blurbs:sn45": "The “Linked Discourses on the Path” contains 180 discourses on the noble eightfold path, the “middle way” which is the first and most important of all the Buddha’s teachings on the path of spiritual practice. It is mentioned in the first discourse as the fourth noble truth. It begins with “right view” which is initially an accurate conceptual understanding, based on hearing the teachings and reflecting on their meaning. The second factor is right intention, referring to the attitude or motivation that shapes practice. Next come three factors dealing with ethical conduct. And the final three factors directly deal with meditation. Once all these factors are mature, “right immersion” or the four absorptions (<i lang='pi' translate='no'>jhānas</i>) enables the initial conceptual understanding to ascend to a higher level of insight and letting go. While this and subsequent chapters contains many substantive discourses on this theme, the large number of discourses is mainly attributable to the formulaic “repetition series” which append each chapter.",
  "sn-blurbs:sn46": "The “Linked Discourses on the Awakening Factors” contains 184 discourses on the seven awakening factors. These are qualities such as mindfulness and investigation which lead the meditator to awakening. The focus here is specifically on meditation, rather than the more holistic approach included in the previous chapter on the Path. Some distinctive features of this collection include the use recitation of the awakening factors in order to inspire those who are sick, and the frequent contrast between the seven awakening factors and the five hindrances.",
  "sn-blurbs:sn47": "The “Linked Discourses on Mindfulness Meditation” contains 104 discourses on the four kinds of mindfulness meditation (<i lang='pi' translate='no'>satipaṭṭhāna</i>, otherwise known as the “foundations of mindfulness” or “establishments of mindfulness”). These are the body, feelings, mind, and principles. The last of these is translated in various ways, but a close reading of the texts in this chapter shows that it originally referred to the “principles” of causality underlying the process of meditation itself. These discourses on this fundamental topic are much less known than the longer “Discourse on Mindfulness Meditation” found in versions in MN 10 and DN 22; however, they are historically earlier than that late compilation. Where MN 10 emphasizes insight meditation, in this collection we frequently find mindfulness closely connected to absorption, as it is the factor of the path that leads directly to “right immersion”. Insight is mentioned only rarely. The root meaning of the term mindfulness (<i lang='pi' translate='no'>sati</i>) is “memory”, and when used in meditation it refers to not “forgetting” one’s meditation, but keeping focus on the breath or other theme of meditation. This collection presents a range of perspectives on mindfulness meditation; one of its most memorable features is a series of similes or parables illustrating the practice. The partner of mindfulness (<i lang='pi' translate='no'>sati</i>) is “situational awareness” (<i lang='pi' translate='no'>sampajañña</i>, sometimes rendered as “clear comprehension”), which refers to keeping a broad awareness and understanding especially in daily activities.",
  "sn-blurbs:sn48": "The “Linked Discourses on the Faculties” contains 178 discourses on various sets of “faculties” (<i lang='pi' translate='no'>indriya</i>). The “five faculties” of faith, energy, mindfulness, immersion, and wisdom are the most natural fit in this context. However the chapter also finds room for discourses on a wider range of 22 faculties, including the six sense faculties, five affective faculties (kinds of feeling), three faculties relating the process of enlightenment, and three concerning biology and gender. This flexible category thus serves as a link between the teachings on wisdom and those on the path.",
  "sn-blurbs:sn49": "The “Linked Discourses on the Right Efforts” contains 54 discourses, which are, however, a mere instantiation of the standard repetition series as applied to the four right efforts. There are many discourses on right effort throughout the Pali <i lang='pi' translate='no'>nikāyas</i>, but for some reason the redactors did not collect them here.",
  "sn-blurbs:sn50": "The “Linked Discourses on the Five Powers” contains 108 discourses, which are, however, a mere instantiation of the standard repetition series as applied to the five powers. These powers are effectively identical with the five faculties, as stated at SN 48.43, being merely distinguished as a different teaching approach. There are several discourses on these qualities found mainly in the Aṅguttara Fives, but for some reason the redactors did not collect them here.",
  "sn-blurbs:sn51": "The “Linked Discourses on the Bases of Psychic Power” contains 86 discourses dealing with the qualities of enthusiasm or desire for practice, energy, higher consciousness, and inquiry, which are said to lead to the development of various psychic powers. The purpose of Buddhism, of course, is not to develop such powers. But they are a matter of constant interest and intrigue among spiritual practitioners—not just in ancient India—and it seems the Buddha formulated this approach to the path to inspire those interested in them. The emphasis is on the development of deep meditation immersion (<i lang='pi' translate='no'>samādhi</i>) through applying effort.",
  "sn-blurbs:sn52": "The “Linked Discourses with Anuruddha” contains 24 discourses with Anuruddha, famous for his powers of clairvoyance, but here revealed as an exponent of mindfulness meditation. It is to mindfulness meditation that he attributes his spiritual attainments, whether psychic powers, absorptions, or awakening. This series of texts can be regarded as a supplement to SN 47.",
  "sn-blurbs:sn53": "The “Linked Discourses on Absorption” contains 54 discourses on the topic of absorption meditation (<i lang='pi' translate='no'>jhāna</i>), which however merely apply the standard repetition series to the formula for the four absorptions.",
  "sn-blurbs:sn54": "The “Linked Discourses on Breath Meditation” contains 20 discourses on breath meditation (<i lang='pi' translate='no'>ānāpānassati</i>), the most revered form of meditation from early Buddhism until the present day. It was practiced by the Buddha himself. The meditation is taught in a detailed series of sixteen steps. These are partially sequential, but also overlap in some cases. The development of these fulfills all four kinds of mindfulness meditation and the seven factors of awakening. Thus this one form of meditation can lead to awakening; which is not, however, to say that it is invariably the best approach. The Buddha taught many different meditations for a reason; each has its own qualities and benefits. Breath meditation is seen as a peaceful and pleasant meditation which helps still distracting thoughts. It is a simple practice broadly suitable for most meditators, but leading to profound depths.",
  "sn-blurbs:sn55": "The “Linked Discourses on Stream-Entry” contains 74 discourses on the topic of stream-entry, or more precisely, two sets of four qualities, one of which distinguishes a person as a stream-enterer, and one which help lead to stream-entry. The primary qualities of the first set are faith and ethical conduct. For the second, it is hearing the teaching and practicing accordingly. Note that these sets do not exhaust the qualities of a stream-enterer, many others of which are described elsewhere, but serve to emphasis the crucial role especially of faith.",
  "sn-blurbs:sn56": "The “Linked Discourses on the Truths” contains 131 discourses on the four noble truths: suffering, its origin, its cessation, and the path. These formed the main subject of the Buddha’s first discourse, which is included here as SN 56.11. The Buddha said that all of his teaching was comprised within the four noble truths. Indeed, the overall structure of the main doctrinal Saṁyuttas can be seen as an expanded example of this: The sections on the Aggregates and the Sense Fields deal with the first noble truth; Dependent Origination deals with the second and third; and the chapters on the Path deal with the final truth. This chapter thus provides an overall perspective on the other teachings, and the chapter occurs at the end just as the realization of the four noble truths emerges from the path.",
  "sn-blurbs:sn1.1": "The Buddha crossed the flood of suffering by neither standing nor swimming.",
  "sn-blurbs:sn1.2": "Freedom comes when we end attachment to rebirth.",
  "sn-blurbs:sn1.3": "Life is short, so we should drop the world’s bait.",
  "sn-blurbs:sn1.4": "Time flies, so we should drop the world’s bait.",
  "sn-blurbs:sn1.5": "A cryptic set of questions, which the Buddha answers equally cryptically.",
  "sn-blurbs:sn1.6": "How many are awake while others are asleep?",
  "sn-blurbs:sn1.7": "Those who comprehend the teachings live smooth amid the rough.",
  "sn-blurbs:sn1.8": "Those who are unconfused live smooth amid the rough.",
  "sn-blurbs:sn1.9": "Unless you give up conceit you’ll be trapped in the domain of Death.",
  "sn-blurbs:sn1.10": "Spiritual practitioners have clear complexions, despite their simple life.",
  "sn-blurbs:sn1.11": "Even the divine Garden of Delight is impermanent.",
  "sn-blurbs:sn1.12": "We think our attachments bring us happiness, but they really bring sorrow.",
  "sn-blurbs:sn1.13": "Like many of these discourses, here the Buddha repeats a god’s verses with a subtle twist towards the Dhamma.",
  "sn-blurbs:sn1.14": "A god’s worldly values are improved by the Buddha’s version.",
  "sn-blurbs:sn1.15": "The quiet murmuring of the jungle can be scary—but not to the Buddha.",
  "sn-blurbs:sn1.16": "Laziness is an obstruction to the path.",
  "sn-blurbs:sn1.17": "Life is hard for an unrestrained ascetic; they should draw in their thoughts like a tortoise.",
  "sn-blurbs:sn1.18": "Does anyone have a sense of conscience and shame?",
  "sn-blurbs:sn1.19": "Do you have a little hut and a little nest—or are you free?",
  "sn-blurbs:sn1.20": "A deity tries to tempt a monk to first enjoy sensual pleasures and then go forth. ",
  "sn-blurbs:sn1.21": "A mendicant should live as if their head was on fire.",
  "sn-blurbs:sn1.22": "The evil you do hurts yourself.",
  "sn-blurbs:sn1.23": "This generation is all tangled up like a nest of matted hair. But who can unravel the tangle?",
  "sn-blurbs:sn1.24": "One should rein in the mind, but only from that which is evil.",
  "sn-blurbs:sn1.25": "If a perfected one has gone beyond all sense of self, would they still refer to themselves as “I”? ",
  "sn-blurbs:sn1.26": "How many lights are there that light up the world?",
  "sn-blurbs:sn1.27": "The stream of rebirth stops flowing when name and form ceases.",
  "sn-blurbs:sn1.28": "Even the rich are full of greed for more—is there anyone free of greed?",
  "sn-blurbs:sn1.29": "A riddle on the topic of escape.",
  "sn-blurbs:sn1.30": "The Buddha is asked how to find release from suffering.",
  "sn-blurbs:sn1.31": "A series of deities give verses praising association with the good, and the Buddha gives his own response.",
  "sn-blurbs:sn1.32": "A series of deities give verses praising generosity, and the Buddha gives his own response.",
  "sn-blurbs:sn1.33": "A series of deities give verses praising generosity, and the Buddha gives his own response, saying that practice of the Dhamma goes beyond this.",
  "sn-blurbs:sn1.34": "Two deities exchange verses with the Buddha on how sensual pleasures give rise to suffering.",
  "sn-blurbs:sn1.35": "Some deities come to find fault with the Buddha. He responds to their critique, which stimulates a further discussion on wrong-doing and forgiveness.",
  "sn-blurbs:sn1.36": "A series of Satullapa gods address the Buddha with verses on various topics. The identifications of the verses in this unclear, and comparison with the Chinese parallels suggests the Pali may have suffered textual loss.",
  "sn-blurbs:sn1.37": "A vast congregation of deities assembles to see the Buddha and the Saṅgha at Kapilavatthu.",
  "sn-blurbs:sn1.38": "A series of deities praise the Buddha’s resilience and composure when his foot is injured by a stone.",
  "sn-blurbs:sn1.39": "A goddess identifying herself as Kokanadā claims to confirm with her own experience the Buddha’s teachings on karma.",
  "sn-blurbs:sn1.40": "A goddess identified as Kokanada, possibly the sister of the previous, sums up the teaching in a pithy verse.",
  "sn-blurbs:sn1.41": "A deity recites to the Buddha some verses ",
  "sn-blurbs:sn1.42": "Different kinds of gifts have different purposes.",
  "sn-blurbs:sn1.43": "Gods and humans love to eat, so what kind of being does not like food?",
  "sn-blurbs:sn1.44": "A single verse in the form of a Dhamma riddle.",
  "sn-blurbs:sn1.45": "A verse in praise of the Buddha.",
  "sn-blurbs:sn1.46": "To escape from the Forest of Delusion, one needs the vehicle of the Dhamma.",
  "sn-blurbs:sn1.47": "For those who give the gift of a monastery, merit always grows.",
  "sn-blurbs:sn1.48": "Verses in praise of the Jetavana monastery, the Dhamma, and venerable Sāriputta, apparently spoken by the deity Anāthapiṇḍika.",
  "sn-blurbs:sn1.49": "The Buddha is asked about the future destiny of people who are stingy and those who are generous.",
  "sn-blurbs:sn1.50": "Ghaṭīkāra, a disciple of the former Buddha Kassapa, comes to the Buddha and speaks of his past life, and of the attainments of six friends.",
  "sn-blurbs:sn1.51": "Morality is good even in old age.",
  "sn-blurbs:sn1.52": "Morality is good when it doesn’t decay.",
  "sn-blurbs:sn1.53": "Things that are friends in this life and the next.",
  "sn-blurbs:sn1.54": "What is it that sustains various beings? Unusually, this verse lacks a “Dhamma” counterpart.",
  "sn-blurbs:sn1.55": "A person is created by craving and fears suffering.",
  "sn-blurbs:sn1.56": "A person is created by craving and is not freed from suffering",
  "sn-blurbs:sn1.57": "A person is created by craving and their destiny is shaped by their deeds.",
  "sn-blurbs:sn1.58": "What is the wrong path?",
  "sn-blurbs:sn1.59": "A person’s true companion is their faith.",
  "sn-blurbs:sn1.60": "A pair of verses on the nature of poetry, and lacking a Dhamma counterpart.",
  "sn-blurbs:sn1.61": "“Name” weighs everything down.",
  "sn-blurbs:sn1.62": "The mind leads the world around and controls it all.",
  "sn-blurbs:sn1.63": "The mind leads the world around and craving controls it.",
  "sn-blurbs:sn1.64": "The world is fettered by craving.",
  "sn-blurbs:sn1.65": "The world is bound by craving.",
  "sn-blurbs:sn1.66": "The world is afflicted with death and old age, and burning with desire.",
  "sn-blurbs:sn1.67": "The world is caught by craving and built on suffering.",
  "sn-blurbs:sn1.68": "The world is shut in by death.",
  "sn-blurbs:sn1.69": "The world is bound by desire.",
  "sn-blurbs:sn1.70": "A Dhamma riddle whose answer, enigmatically, is “six”.",
  "sn-blurbs:sn1.71": "The killing of anger is the only killing praised by the noble ones.",
  "sn-blurbs:sn1.72": "What is the sign or token of a chariot, a fire, a nation, and a woman?",
  "sn-blurbs:sn1.73": "A series of questions on what is best.",
  "sn-blurbs:sn1.74": "A series of questions asked by one deity, answered by another, and then given a better answer by the Buddha.",
  "sn-blurbs:sn1.75": "Why is it that, though the path has been taught, people still fear?",
  "sn-blurbs:sn1.76": "A series of questions on the path.",
  "sn-blurbs:sn1.77": "A series of questions on diverse matters.",
  "sn-blurbs:sn1.78": "What is it that one should not give away?",
  "sn-blurbs:sn1.79": "A series of questions on diverse topics.",
  "sn-blurbs:sn1.80": "A series of questions on diverse topics.",
  "sn-blurbs:sn1.81": "A series of questions on diverse kinds of people",
  "sn-blurbs:sn2.1": "A deity named Kassapa comes to the Buddha and speaks of the training of a mendicant in seclusion and right speech.",
  "sn-blurbs:sn2.2": "The deity Kassapa speaks of how a mendicant should be a meditator, peaceful and free.",
  "sn-blurbs:sn2.3": "The god Māgha asks the Buddha about what one should slay in order to sleep well and be without sorrow.",
  "sn-blurbs:sn2.4": "The deity Māgadha asks the Buddha how many sources of light there are in the world. The Buddha speaks of five lights, but the Buddha is the best of them.",
  "sn-blurbs:sn2.5": "Dāmali the god suggests that a true brahmin must strive to abandon desire. The Buddha disagrees, saying that a true holy one has already completed their work.",
  "sn-blurbs:sn2.6": "The deity Kāmada addresses the Buddha with a series of cryptic statements lamenting the difficulty of spiritual practice. The Buddha agrees, but points out that true practitioners do it even though it’s hard.",
  "sn-blurbs:sn2.7": "Pañcālacaṇḍa praises the Buddha for finding the opening amid the confinement of the world. But the Buddha affirms that anyone with mindfulness and stillness may find such an escape.",
  "sn-blurbs:sn2.8": "Tāyana, a deity who was in a past life was a leader of a non-Buddhist sect, speaks a series of verses in praise of strenuous exertion and discipline. These famous verses are commonly recited by Theravadin monks.",
  "sn-blurbs:sn2.9": "In a parable of a lunar eclipse, the moon god Candimā is swallowed by the demon lord Rāhu. Candimā appeals to the Buddha, who tells Rāhu to let go. This sutta is recited as a protection verse.",
  "sn-blurbs:sn2.10": "In a parable of a solar eclipse, the sun god Suriya is swallowed by the demon lord Rāhu. Suriya appeals to the Buddha, who tells Rāhu to let go. This sutta is recited as a protection verse.",
  "sn-blurbs:sn2.11": "The deity Candimasa says that those who practice absorption will surely find escape. The Buddha adds that they must also be diligent and discard flaws.",
  "sn-blurbs:sn2.12": "The deity Veṇhu celebrates the joy of those who follow the Buddha’s teaching. The Buddha affirms that such will escape death. Veṇhu is the Pali spelling of Sanskrit Viṣṇu, and this marks a rare appearance of a god of this name in the early texts.",
  "sn-blurbs:sn2.13": "Dīghalaṭṭhi the god comes to the Buddha at Rājagaha and praises a mendicant who is a meditator.",
  "sn-blurbs:sn2.14": "The deity Nandana asks the Buddha who is virtuous, wise, beyond suffering, worshiped by the gods themselves. The Buddha replies that such a person is an arahant.",
  "sn-blurbs:sn2.15": "Candana asks who crosses the flood. The Buddha replies that it is one who is virtuous , wise, peaceful, and beyond attachment to rebirth.",
  "sn-blurbs:sn2.16": "The deity Vasudatta says that a mendicant should live like their hair is on fire so as to give up lust. The Buddha changes his verse to emphasize giving up attachment to self.",
  "sn-blurbs:sn2.17": "Subrahmā the god asks for the escape from fear. The Buddha says there is no escape from fear without letting go of everything.",
  "sn-blurbs:sn2.18": "At Sāketa the god Kakudha asks the Buddha if he delights or sorrows. The Buddha replies that since he has no attachments he neither delights nor sorrows.",
  "sn-blurbs:sn2.19": "The god Uttara speaks of the transience of life, saying one should do good to be reborn in a happy future life. The Buddha replies that one should let go attachment.",
  "sn-blurbs:sn2.20": "A deity who had been the Buddha’s supporter Anāthapiṇḍika in his former life comes to Buddha and speaks verses in celebration of the Jeta’s Grove monastery—which he had offered for the Buddha’s use—good deeds, the Dhamma, and Venerable Sāriputta.",
  "sn-blurbs:sn2.21": "The deity Siva says one should associate only with the good, and this will lead to happiness. The Buddha adds that associating with the good leads to the end of suffering. Siva is the Pali spelling of Sanskrit Śiva, and this marks a rare appearance of a god of this name in the early texts.",
  "sn-blurbs:sn2.22": "The deity Khema utters a series of verses in praise of good deeds. The Buddha responds with a simile for someone who departs the path of the good.",
  "sn-blurbs:sn2.23": "The deity Serī speaks of how everyone loves food., to which the Buddha responds with verses in praise of giving. Serī speaks of his own generosity in a past life.",
  "sn-blurbs:sn2.24": "The deity Ghaṭīkāra speaks of the seven mendicants reborn in the Aviha realm. The sutta is similar to SN 1.50.",
  "sn-blurbs:sn2.25": "Some monks in Kosala fell into negligence, and were admonished by the deity Jantu.",
  "sn-blurbs:sn2.26": "Rohitassa asks the Buddha if it is possible to reach the end of the world by traveling. The Buddha says no; and Rohitassa tells of how in a past life as a seer he had tried to accomplish this very feat and failed. The Buddha says the end of the world is found in this body.",
  "sn-blurbs:sn2.27": "Nanda speaks of the transience of life, saying one should do good to be reborn in a happy future life. The Buddha replies that one should let go attachment.",
  "sn-blurbs:sn2.28": "The god Nandivisāla gives an elaborate metaphor for the body, and asks how to escape from it. ",
  "sn-blurbs:sn2.29": "The Buddha asks Ānanda if he likes Sāriputta, and when he replies that he does, the god Susīma and his assembly appear, rejoicing in Sāriputta’s praises, and radiating in lustrous colors.",
  "sn-blurbs:sn2.30": "A series of deities who had formerly been ascetics in the non-Buddhist sects came to the Buddha, speaking verses in praise—or occasional criticism—of their former teachers",
  "sn-blurbs:sn3.1": "King Pasenadi meets the Buddha for the first time. He wonders how the Buddha can claim to be awakened when he is still so young. The Buddha teaches him four things that should not be looked down on for their youth.",
  "sn-blurbs:sn3.2": "Pasenadi asks of the things that cause suffering when they arise in oneself.",
  "sn-blurbs:sn3.3": "Pasenadi asks if anything that is born can escape from old age and death.",
  "sn-blurbs:sn3.4": "Reporting on a reflection that arose while on retreat, Pasenadi says that those who do bad deeds treat themselves as enemy. The Buddha expresses his agreement in verse.",
  "sn-blurbs:sn3.5": "Even if protected by an entire army, one who does bad deeds is still unprotected.",
  "sn-blurbs:sn3.6": "There are few in the world who do not become negligent and complacent once they obtain material luxuries. ",
  "sn-blurbs:sn3.7": "Pasenadi laments how in his judgment hall he sees people lying all the time for the sake of sensual pleasures.",
  "sn-blurbs:sn3.8": "Pasandi asks Queen Mallikā who is most dear. They both agree that the one most dear is oneself, and the Buddha agrees.",
  "sn-blurbs:sn3.9": "A great sacrifice involving the slaughter of many animals was being prepared for King Pasenadi. The Buddha condemns such sacrifices and says a fruitful sacrifice involves a blameless and harmless offering.",
  "sn-blurbs:sn3.10": "When many people are put in chains by Pasenadi, the matter is reported to the Buddha.",
  "sn-blurbs:sn3.11": "A diverse group of ascetics passes by, and Pasenadi asks the Buddha if any of them are perfected ones. The Buddha says it is not easy for one such as Pasenadi to judge the spiritual achievements of others. Pasenadi reveals that the men are, in fact, his spies.",
  "sn-blurbs:sn3.12": "Five kings including Pasenadi are enjoying themselves and wonder which of the senses affords the highest pleasure. They ask the Buddha, who replies that it is subjective, depending on a persons preferences. Inspired, the laymen Candanaṅgalika offers a verse in praise of the Buddha.",
  "sn-blurbs:sn3.13": "In what is probably the world’s first weight loss diet, when Pasenadi shows up overweight and out of breath, the Buddha advises him to cut down his eating. He gives a verse to one of the king’s attendants, and asks him to recite it whenever the king is eating.",
  "sn-blurbs:sn3.14": "Pasenadi loses a battle against his nephew King Ajātasattu of Magadha.",
  "sn-blurbs:sn3.15": "In a battle subsequent to SN 3.14, Pasenadi defeats Ajātasattu and takes him prisoner. Acting compassionately, he confiscates Ajātasattu’s military assets but releases him alive.",
  "sn-blurbs:sn3.16": "Pasenadi is disappointed to hear that Queen Mallikā has given birth to a daughter. But the Buddha consoles him, saying a woman may turn out better than a man.",
  "sn-blurbs:sn3.17": "Pasenadi asks the Buddha if there is one thing that secures benefit both in this life and the next.",
  "sn-blurbs:sn3.18": "In answer to Pasenadi’s praise of good friendship, the Buddha recounts an earlier conversation with Ānanda on the topic. He then goes on to say that when one has good friends, it is important to develop diligence.",
  "sn-blurbs:sn3.19": "A wealthy man dies childless, having not enjoyed his riches. The Buddha says that wealth should be properly enjoyed and shared.",
  "sn-blurbs:sn3.20": "A wealthy man dies childless, having not enjoyed his riches. The Buddha tells of how in the time of a solitary Buddha of the past named Tagarasikhī, a householder made an offering but later regretted it.",
  "sn-blurbs:sn3.21": "The Buddha teaches Pasenadi of four kinds of person, going from dark to dark, dark to light, light to dark, and light to light.",
  "sn-blurbs:sn3.22": "Pasenadi laments the death of his aged grandmother.",
  "sn-blurbs:sn3.23": "How many things give rise to suffering in oneself?",
  "sn-blurbs:sn3.24": "“Where should I give” and “Where is a gift is most fruitful” are two different questions.",
  "sn-blurbs:sn3.25": "Old age and death roll in upon all like mountains approaching from the four directions, crushing all in their path",
  "sn-blurbs:sn4.1": "Māra accuses the Buddha of having abandoned the path of true austerity.",
  "sn-blurbs:sn4.2": "Māra manifests before the Buddha in the form of a ferocious elephant in order to scare him.",
  "sn-blurbs:sn4.3": "Māra tries to scare the Buddha by taking on shifting forms both beautiful and hideous.",
  "sn-blurbs:sn4.4": "When the Buddha explains to the mendicants how he realized freedom, Māra claims he is still trapped.",
  "sn-blurbs:sn4.5": "When the Buddha explains to the mendicants how he has realized freedom, and so have his mendicant followers, Māra claims he is still trapped.",
  "sn-blurbs:sn4.6": "Māra manifests as a huge serpent, but the Buddha is unshaken.",
  "sn-blurbs:sn4.7": "After meditating all night, the Buddha lies down to sleep at dawn, and Māra scolds him for being lazy.",
  "sn-blurbs:sn4.8": "The Buddha and Māra exchange verses on whether attachments are a source of delight or suffering.",
  "sn-blurbs:sn4.9": "Though the Buddha says that life is short, Māra says it is long.",
  "sn-blurbs:sn4.10": "Though the Buddha says that life is short, Māra says it is long.",
  "sn-blurbs:sn4.11": "Māra smashes boulders in an attempt to scare the Buddha.",
  "sn-blurbs:sn4.12": "Māra criticizes the Buddha for his lion’s roar, asserting that the Buddha is not in fact peerless.",
  "sn-blurbs:sn4.13": "The Buddha rests after being struck by stone splinters, and Māra criticizes him for being lazy.",
  "sn-blurbs:sn4.14": "Māra discourages the Buddha from teaching, warning him that he will become corrupted by favoritism.",
  "sn-blurbs:sn4.15": "Māra threatens the Buddha with a “mental snare” in the sky.",
  "sn-blurbs:sn4.16": "While the mendicants are listening to the teachings, Māra takes the form of an ox and looks as if he will break their almsbowls.",
  "sn-blurbs:sn4.17": "While the mendicants are listening to the teachings, Māra makes an awful roar to distract them.",
  "sn-blurbs:sn4.18": "Māra ensures that the Buddha fails to get alms, but the Buddha is happy to feed on joy.",
  "sn-blurbs:sn4.19": "While the mendicants are listening to the teachings, Māra takes the form of a farmer looking for lost oxen and addresses the Buddha.",
  "sn-blurbs:sn4.20": "The Buddha wonders whether it is possible to rule justly, without violence. Māra appears and encourages the Buddha to purse such a path.",
  "sn-blurbs:sn4.21": "Māra approaches some young mendicants as an old brahmin, and tries to tempt them with talk of the pleasures of youth.",
  "sn-blurbs:sn4.22": "Māra repeatedly pesters the monk Samiddhi when he is on retreat. The Buddha encourages him, until eventually Samiddhi is able to recognize Māra for himself.",
  "sn-blurbs:sn4.23": "Venerable Godhika finds himself repeatedly falling away from his meditation attainments due to severe illness. Eventually he considers suicide, and Māra tries to get the Buddha to deter him. But the Buddha says Godhika has already attained awakening and has died blamelessly.",
  "sn-blurbs:sn4.24": "Māra has tried to distract the Buddha for seven years without success. He laments his failure with the similes of a crab whose limbs are smashed by a group of children, and a crow who tried to eat a stone.",
  "sn-blurbs:sn4.25": "Depressed, Māra laments to his three daughters of his failure to distract the Buddha. So they take on the task themselves, and assume a variety of sensuous forms to tempt him. But they fail too, and Māra castigates them for being so presumptuous",
  "sn-blurbs:sn5.1": "The nun Āḷavikā has entered the Dark Wood seeking seclusion when Māra comes to threaten her, claiming there is no escape and no point in seclusion. She recognizes him instantly and dismisses his taunts, asserting that she is beyond his control.",
  "sn-blurbs:sn5.2": "When meditating in the Dark Wood, the nun Somā is taunted by Māra, who claims that a mere woman can never see the subtle truth. She rejects him, stating that gender does not matter when one is perceiving deep truths, and telling Māra to go see those still attached to gender.",
  "sn-blurbs:sn5.3": "Māra taunts the nun Kisāgotamī, alleging she is mourning sons and longing for a man. She rejects him, stating that she has no need for men, as she has destroyed the mass of darkness and conquered the army of Death.",
  "sn-blurbs:sn5.4": "Māra comes to the nun Vijayā in the form of a handsome youth and tries to tempt her from her path. But she rejects sensual pleasures, as she delights in subtle meditation and has ended ignorance.",
  "sn-blurbs:sn5.5": "Uppalavaṇṇā is rebuked by Māra, who says a beautiful woman like her should fear rogues when alone in the forest. However, she dismisses such fears, saying she can use her psychic powers to defeat thousands of rogues like him.",
  "sn-blurbs:sn5.6": "Māra asks the nun Cālā why she disapproves of rebith. She replies that it necessarily entails suffering.",
  "sn-blurbs:sn5.7": "Māra asks the nun Upacālā where she wishes to be reborn. But as the world everywhere is burning, she rejects all forms of rebirth.",
  "sn-blurbs:sn5.8": "Māra asks the nun Sīsupacālā whose teaching she believes in. She replies that she rejects the various sectarians and follows the Buddha, as his teachings lead to freedom.",
  "sn-blurbs:sn5.9": "Māra asks the nun Selā about who has created this “puppet”, i.e. the form that has been reincarnated. She replies that there is no creator, but it arises as a result of conditions, like the growing of a seed in a field.",
  "sn-blurbs:sn5.10": "Māra asks the nun Vajirā about who has created this being. Recognizing him, she points out that the word “being” is nothing more than a convention used to designate the aggregates, just as the word “cart” is used when the parts are assembled",
  "sn-blurbs:sn6.1": "After his awakening, the Buddha hesitated to teach, thinking that the Dhamma is too subtle for people to understand. But the high divinity Brahmā Sahampati appears and encourages him to teach, pointing out that there are some with “little dust in their eyes” who will understand.",
  "sn-blurbs:sn6.2": "After his awakening, the Buddha reflects that one should live with reverence; but who is he to revere, since he is fully awakened? He realizes that he should live revering the Dhamma. Brahmā Sahampati appears and agrees with him, saying that this is how all Buddhas of past and future live too.",
  "sn-blurbs:sn6.3": "Brahmā Sahampati appears before a woman who is a devotee of his, and tells her to offer food instead to her son, a Buddhist monk, as Brahmās don’t eat the food she offers.",
  "sn-blurbs:sn6.4": "Baka the Brahmā conceives the wrong view that his status is permanent and imperishable. The Buddha goes to dissuade him, and they have an exchange in verse, with the Buddha telling Baka of his past lives. ",
  "sn-blurbs:sn6.5": "An unnamed brahmā god thinks to himself that he is so powerful no asectic can approach him. The Buddha goes straight to his realm and appears wrapped in flame above his head. Mahāmoggallāna and several other disciples follow him. The brahmā and his retinue are sutiably impressed.",
  "sn-blurbs:sn6.6": "The brahmās Subrahmā and Suddhāvāsa note that a fellow-brahmā is living in negligence, overly impressed with his own glory, so they go to shake him from his complacence.",
  "sn-blurbs:sn6.7": "The brahmās Subrahmā and Suddhāvāsa come to the Buddha’s hut and speak on the monk Kokālika, a follower of Devadatta.",
  "sn-blurbs:sn6.8": "The brahmās Subrahmā and Suddhāvāsa come to the Buddha’s hut and speak on the monk Katamorakatissaka, a follower of Devadatta.",
  "sn-blurbs:sn6.9": "The brahmā Tudu tries to persuade Kokālika to have faith in Sāriputta and Moggallāna, but Kokālika wants none of it.",
  "sn-blurbs:sn6.10": "Kokālika goes to the Buddha and criticizes Sāriputta and Moggallāna. But having deliberately slandered such great monks, he dies and Brahmā Sahampati informs the Buddha he has been reborn in hell. The Buddha gives a memorable simile of the length of life in hell.",
  "sn-blurbs:sn6.11": "Brahmā Sanaṅkumāra appears to the Buddha and asserts that the aristocrat or khattiya is the best caste, but the Buddha is the best of people.",
  "sn-blurbs:sn6.12": "Brahmā Sahampati, referring to Devadatta, points out that honors destroy a scoundrel.",
  "sn-blurbs:sn6.13": "Brahmā Sahampati appears to the Buddha and speaks in praise of the renunciates staying fearless in the deep forest, and celebrates the many who have found freedom.",
  "sn-blurbs:sn6.14": "The Buddha tells a story of the past Buddha Sikhī and his disciple Abhibhū. They visit a brahmā realm where they perform many astounding feats and give teachings.",
  "sn-blurbs:sn6.15": "After the Buddha became finally extinguished, Brahmā Sahampati led a series of distinguished beings who uttered verses in commemoration",
  "sn-blurbs:sn7.1": "When a brahmin lady expresses her confidence in the Triple Gem, her husband is annoyed. She encourages him to visit the Buddha, who soothes his anger.",
  "sn-blurbs:sn7.2": "A brahmin visits the Buddha and unleashes a tirade of abuse, but the Buddha refuses to accept it, showing that he remains free of anger.",
  "sn-blurbs:sn7.3": "A brahmin visits the Buddha and abuses him, but the Buddha responds only with patience.",
  "sn-blurbs:sn7.4": "Hearing that a brahmin had gone forth under the Buddha, another brahmin was upset. But once again the Buddha calms him down, pointing out that anger only harms oneself.",
  "sn-blurbs:sn7.5": "A brahmin called “Harmless” visits the Buddha, who teaches him the true meaning of harmlessness.",
  "sn-blurbs:sn7.6": "A brahmin with matted hair asks the Buddha how we can become disentangled. This short set of verses became one of the most important in all of Theravāda Buddhism when it was used as the cornerstone of the commentarial treatise Visuddhimagga (Path of Purification).",
  "sn-blurbs:sn7.7": "The brahmin Suddhika makes the strikingly Buddhist assertion that mere austerities don’t lead to purity; only knowledge and conduct do. ",
  "sn-blurbs:sn7.8": "A brahmin conducting a fire sacrifice invites the Buddha to accept the blessed milk-rice, claiming that the Buddha is a true brahmin.",
  "sn-blurbs:sn7.9": "A brahmin conducting a fire sacrifice wishes to offer the sacrificial cake. He sees the Buddha meditating and wants to give it to him, but hesitates when he realizes he is a shaven-headed ascetic. He asks the Buddha’s caste, but the Buddha argues that conduct is the important thing, not caste. The Buddha gives a metaphorical reinterpretation of the elements of brahmanical ritual.",
  "sn-blurbs:sn7.10": "A brahmin is searching for his lost oxen when he sees the Buddha meditating peacefully in the forest. He laments the many sorrows of his life, celebrating the Buddha’s happiness and freedom from such sorrows.",
  "sn-blurbs:sn7.11": "A brahmin farmer criticizes the Buddha for failing to produce food, merely living off the work of others. But the Buddha shows that his true work is spiritual.",
  "sn-blurbs:sn7.12": "A brahmin complains when the Buddha visits for alms again and again. The Buddha takes the chance to point out that all natural phenomena repeat in cycles, and only an awakened one escapes the cycle.",
  "sn-blurbs:sn7.13": "The Buddha is ill and sends his attendant monk Upavāṇa to fetch some hot water. A brahmin gives him not just water, but also molasses to ease his stomach. Later the brahmin visits the Buddha to discuss generosity.",
  "sn-blurbs:sn7.14": "A brahmin in shabby clothes has been kicked out of his home by ungrateful sons. The Buddha gives him a verse to recite in the village council, comparing his faithless sons to his trusty wooden staff. Ashamed, the sons take back their father, bathe and dress him.",
  "sn-blurbs:sn7.15": "A stuck-up brahmin listening to the Buddha teach is awestruck when the Buddha appears to read his mind. To the surprise of the crowd, he bows and kisses the Buddha’s feet. The Buddha tells him to take his seat, and they exchange verses on the topic of conceit.",
  "sn-blurbs:sn7.16": "A brahmin who loves to contradict everyone approaches the Buddha thinking to challenge him. But when he hears the Buddha speak, he cannot find anything to contradict.",
  "sn-blurbs:sn7.17": "A brahmin is enjoying his work in the woods. Seeing the Buddha in meditation, he wonders what sort of work the Buddha enjoys.",
  "sn-blurbs:sn7.18": "Some brahmin students are collecting firewood when they see the Buddha in meditation. They return and inform their teacher, who visits the Buddha to ask him how he is so peaceful in the wild forest.",
  "sn-blurbs:sn7.19": "A brahmin wonders whether the legitimate seeking of alms is a proper way to support his parents.",
  "sn-blurbs:sn7.20": "The Buddha explains that a true mendicant is one who has gone beyond evil.",
  "sn-blurbs:sn7.21": "A brahmin believes that by bathing he can wash away his sins. But the Buddha speaks of the Dhamma as a lake for true purification.",
  "sn-blurbs:sn7.22": "When the Buddha approaches a brahmin council in session, they complain that he is out of order.",
  "sn-blurbs:sn8.1": "Enticed by the sight of beautiful women, the newly ordained monk Vaṅgīsa dispels desire and celebrates his commitment to the spiritual path in verse.",
  "sn-blurbs:sn8.2": "Vaṅgīsa is troubled again by lust, but manages to dispel it through his own efforts. His verse speak of the way of the renunciate, letting go of desire and wrong views, and dedicated to ethical conduct and seclusion.",
  "sn-blurbs:sn8.3": "As a renowned poet, Vaṅgīsa looked down on less skilled mendicants. Ashamed of his conceit, he exhorted himself in verse to be humble and at peace.",
  "sn-blurbs:sn8.4": "Troubled once more by lust, Vaṅgīsa turned to Ānanda for support. Ānanda tells him to shift his perception so that beautiful things no longer seem so.",
  "sn-blurbs:sn8.5": "The Buddha gives a simple teaching on four qualities of good speech. Vaṅgīsa is inspired to utter a more elaborate set of verses on the topic, praising especially the speech of the Buddha that leads to the Deathless. ",
  "sn-blurbs:sn8.6": "Seeing Sāriputta speak on the Dhamma, and the rapt attention of the Saṅgha, Vaṅgīsa comes out with verses in his praise.",
  "sn-blurbs:sn8.7": "On the Pavāraṇā day at the end of the rains retreat, the Buddha invites the Saṅgha to admonish him. But not only is the Buddha faultless, so are all the 500 monks present. Vaṅgīsa is inspired to utter a elaborate praise of the Buddha.",
  "sn-blurbs:sn8.8": "Seeing the Buddha speak on the Dhamma, and the rapt attention of the Saṅgha, Vaṅgīsa comes out with verses in his praise. When asked if the verses were spontaneous, he replies that they were, and the Buddha invites him to speak further.",
  "sn-blurbs:sn8.9": "Aññā Koṇḍañña, the very first disciple to realize the Dhamma, comes to visit the Buddha after long in seclusion. Inspired, Vaṅgīsa speaks verses in his praise.",
  "sn-blurbs:sn8.10": "Vaṅgīsa speaks in praise of Moggallāna and the Saṅgha.",
  "sn-blurbs:sn8.11": "Vaṅgīsa says the Buddha, like the moon or the sun, outshines the whole world.",
  "sn-blurbs:sn8.12": "Remembering his past as a wandering poet, Vaṅgīsa celebrates the freedom he has found in the Dhamma",
  "sn-blurbs:sn9.1": "A monk in the forest lets his mind drift to thoughts of the lay life, but is warned by a local deity.",
  "sn-blurbs:sn9.2": "When a mendicant falls asleep in the middle of the day, a deity tries to rouse them up. But not all is at it seems.",
  "sn-blurbs:sn9.3": "A monk named Kassapagotta encounters a hunter in the forest and tries to dissuade him from his violent purpose. But a deity warns him not to waste his time.",
  "sn-blurbs:sn9.4": "When a group of mendicants leave the forest in which they had been staying, the local deities lament their absence.",
  "sn-blurbs:sn9.5": "A deity warns Ānanda about getting too involved with teaching lay folk.",
  "sn-blurbs:sn9.6": "A former partner of Venerable Anuruddha, now a deity named Jālinī, tries to tempt him with heavenly pleasures. But he has seen a higher happiness.",
  "sn-blurbs:sn9.7": "When Venerable Nāgadatta spends too much time in the village, a deity admonishes him.",
  "sn-blurbs:sn9.8": "A deity becomes concerned of the gossip about a certain monk who had become close with a family in the village. Taking the form of one of the women of the family, she tries to warn him; but he says a true practitioner is not concerned with gossip.",
  "sn-blurbs:sn9.9": "Hearing the sounds of a city festival, a mendicant feels lonely in the forest. A deity comes to give them solace and support.",
  "sn-blurbs:sn9.10": "When a mendicant gives up their habit of reciting the texts, a deity questions them. But it seems they have now found peace.",
  "sn-blurbs:sn9.11": "A mendicant plagued by bad thoughts is encouraged by a deity.",
  "sn-blurbs:sn9.12": "A deity speaks of the fearfulness of the murmuring forest. But to a mendicant it seems delightful.",
  "sn-blurbs:sn9.13": "A group of mendicants in the forest had fallen into bad ways, becoming conceited and confused. A deity came to admonish them, making clear that they were only speaking of the badly behaved, not all mendicants.",
  "sn-blurbs:sn9.14": "A mendicant takes a bath in a pond and sniffs a lotus. A deity accuses him of being a “thief of scent”. For a person living a life of purity, even such a small matter is a cause for concern",
  "sn-blurbs:sn10.1": "A local spirit asks the Buddha how a body is produced if there is no soul.",
  "sn-blurbs:sn10.2": "A spirit tells the Buddha that if he is truly free he should not be instructing others.",
  "sn-blurbs:sn10.3": "The spirits Khara and Sūciloma argue about whether the Buddha is a true ascetic or not. They approach him initially with threats, but then ask as to the origin of greed and hate.",
  "sn-blurbs:sn10.4": "The spirit Maṇibhadda speaks in praise of mindfulness, opining that a mindful one is free of hate. The Buddha responds that yes, mindfulness is wonderful, but only through developing love is one free of hate.",
  "sn-blurbs:sn10.5": "It seems that the novice Sānu had returned to his home intending to disrobe. To prevent him, a spirit possessed him, encouraging him to pursue the path of good. Sānu’s mother, weeping for her son, also tries to make him stay in robes.",
  "sn-blurbs:sn10.6": "A female spirit hushes her son Piyaṅkara so she can hear the teaching and pursue harmlessness.",
  "sn-blurbs:sn10.7": "A female spirit hushes her children as she listens to the teaching. But her son Punabbasu says that he had not been talking, as he too wants to learn.",
  "sn-blurbs:sn10.8": "When Anāthapiṇḍika heard that a Buddha had arisen in the world, he rose first thing in the morning to go and visit him. But a mysterious darkness caused him to hesitate, so a spirit repeatedly encouraged him to step forward. Finally he reached the Buddha, and asked if he had slept well.",
  "sn-blurbs:sn10.9": "A spirit was full of faith in the nun Sukkā, so he went about the towns and villages encouraging people to listen to her teaching.",
  "sn-blurbs:sn10.10": "A spirit was full of faith in the nun Sukkā, so he went about the towns and villages singing the benefits of giving her offerings.",
  "sn-blurbs:sn10.11": "A spirit was full of faith in the nun Cirā, so he went about the towns and villages singing the benefits of giving her offerings.",
  "sn-blurbs:sn10.12": "The famous story of the spirit Āḷavaka, who tries to bully the Buddha, but is soon persuaded through a surprisingly insightful series of questions and answers. This discourse provided the background for several elaborate legends in the later traditions",
  "sn-blurbs:sn11.1": "When Sakka, the Lord of Gods, tries to organize a counterattack against the demons, he is frustrated by his lazy general Suvīra. Sakka asks Suvīra how one might get what one wants without effort; but Suvīra apparently believes Sakka can grant any wish he wants. The Buddha emphasizes that if effort is valuable among the gods, how much more so for mendicants.",
  "sn-blurbs:sn11.2": "When Sakka, the Lord of Gods, tries to organize a conterattack against the demons, he is frustrated by his lazy general Susīma. Sakka asks Susīma how one might get what one wants without effort; but Susīma apparently believes Sakka can grant any wish he wants. The Buddha emphasizes that if effort is valuable among the gods, how much more so for mendicants.",
  "sn-blurbs:sn11.3": "Sakka rallies his troops with the sight of his banner. But the Buddha points out that the deities, powerful as they are, are not free of fear, but he is. He encourages the mendicants to recollect the Triple Gem to abandon fear.",
  "sn-blurbs:sn11.4": "In a battle between the gods and the demons, and the demon lord Vepacitti is captured and brought in chains to Sakka’s hall. Vepacitti abuses Sakka, who endures his harsh words in patience. The charioteer Mātali asks whether he is silent out of weakness or fear, but Sakka says there is no point is wasting words arguing with a fool.",
  "sn-blurbs:sn11.5": "The demon lord Vepacitti proposes to Sakka that they engage in a battle of wits in debate rather than war. Vepacitti speaks in praise of forceful punishment, while Sakka stands up for patience and forgiveness.",
  "sn-blurbs:sn11.6": "Fleeing the demon host, Sakka’s chariot risks endangering the nests of little birds in the forest. Rather than render the birds homeless, Sakka instructs his charioteer to turn back, even at the cost of his life.",
  "sn-blurbs:sn11.7": "Sakka reflects that one should not harm even one’s enemy. Knowing this, Vepacitti immediately takes advantage of it.",
  "sn-blurbs:sn11.8": "Sakka, lord of gods, and Verocana, lord of demons, approach the Buddha’s hut and speak in praise of effort.",
  "sn-blurbs:sn11.9": "In days gone by, Sakka, lord of gods, and Vepacitti, lord of demons, visited a hermitage of seers. But Vepacitti behaves rudely, while Sakka honors them. However, the seers beg Sakka to leave, on account of the stink of their unwashed bodies. But he says he loves their smell.",
  "sn-blurbs:sn11.10": "In the past, when battle between the gods and demons loomed, some seers sought out the demon lord Sambara to beg for protection. But due to their devotion to Sakka, he rejected them, so they cursed him.",
  "sn-blurbs:sn11.11": "Sakka achieved his status because of seven vows he kept in the past.",
  "sn-blurbs:sn11.12": "Sakka’s many names arose due to the diverse good deeds he did in the past.",
  "sn-blurbs:sn11.13": "Mahāli the Licchavi is skeptical as to whether the Buddha has really seen Sakka.",
  "sn-blurbs:sn11.14": "The gods complain when a poor man is reborn in heaven. But Sakka points out that even though poor, he did many good deeds.",
  "sn-blurbs:sn11.15": "When Sakka asks what place is truly delightful, the Buddha replies that it is wherever the perfected ones dwell.",
  "sn-blurbs:sn11.16": "When Sakka asks where a gift is most fruitful, the Buddha replies that it is the Saṅgha.",
  "sn-blurbs:sn11.17": "Sakka and Brahmā Sahampati come to the Buddha’s hut and speak in his praise.",
  "sn-blurbs:sn11.18": "When Sakka sets out on a pleasure jaunt, he begins by lifting his joined palms to the four quarters . His charioteer Mātali points out that Sakka is venerated by gods and men, and asks who he is venerating. Sakka replies that he venerates both well-practiced mendicants as well as virtuous lay folk.",
  "sn-blurbs:sn11.19": "When Sakka sets out on a pleasure jaunt, he begins by lifting his joined palms to the Buddha. His charioteer Mātali points out that Sakka is venerated by gods and men, and asks who he is venerating. Sakka replies that he venerates the Buddha, the perfected mendicants as well as trainees on the path.",
  "sn-blurbs:sn11.20": "When Sakka sets out on a pleasure jaunt, he begins by lifting his joined palms to the Saṅgha of mendicants. His charioteer Mātal asks why Sakka venerates smelly mendicants. Sakka replies that he venerates them for their renunciation and peacefulness.",
  "sn-blurbs:sn11.21": "Anger is the only thing whose slaying the Buddha commends.",
  "sn-blurbs:sn11.22": "When an ugly spirit takes Sakka’s throne, the gods were outraged. But the more they complained, the prettier he became. Sakka realized this was the so-called “anger eating spirit”, and treated him with kindness and respect. ",
  "sn-blurbs:sn11.23": "When Vepacitti fell ill, Sakka visited his old adversary, who begged to be cured. But Sakka demanded to be taught a powerful magic spell first.",
  "sn-blurbs:sn11.24": "When two mendicants have a falling out, the Buddha recalls the wise words of Sakka on not letting anger ruin friendship.",
  "sn-blurbs:sn11.25": "The Buddha recalls the words of Sakka warning of how anger crushes people like an avalanche",
  "sn-blurbs:sn12.1": "The famous twelve links of dependent origination are spelled out, showing the origin and cessation of suffering dependent on ignorance.",
  "sn-blurbs:sn12.2": "The Buddha gives definitions for each of the twelve links. These are general definitions that apply wherever the twelve links are mentioned.",
  "sn-blurbs:sn12.3": "The origin of suffering is the wrong way, the end is the right way.",
  "sn-blurbs:sn12.4": "In the far past, the Buddha Vipassī reflected on how the world had fallen into suffering, and became awakened by understanding dependent origination.",
  "sn-blurbs:sn12.5": "In the far past, the Buddha Sikhī reflected on how the world had fallen into suffering, and became awakened by understanding dependent origination.",
  "sn-blurbs:sn12.6": "In the far past, the Buddha Vessabhū reflected on how the world had fallen into suffering, and became awakened by understanding dependent origination.",
  "sn-blurbs:sn12.7": "In the far past, the Buddha Kakusandha reflected on how the world had fallen into suffering, and became awakened by understanding dependent origination.",
  "sn-blurbs:sn12.8": "In the far past, the Buddha Koṇāgamana reflected on how the world had fallen into suffering, and became awakened by understanding dependent origination.",
  "sn-blurbs:sn12.9": "In the far past, the Buddha Kassapa reflected on how the world had fallen into suffering, and became awakened by understanding dependent origination.",
  "sn-blurbs:sn12.10": "The current Buddha Gotama, reflecting on how the world had fallen into suffering, became awakened by understanding dependent origination.",
  "sn-blurbs:sn12.11": "The Buddha defines the four kinds of “food” or “nutriment”, which include edible food, contact, intention, and consciousness. These are all produced by craving, and hence connect with dependent origination.",
  "sn-blurbs:sn12.12": "Venerable Moḷiyaphagguna asks who eats the consciousness food. The Buddha says the question is improper, as it assumes a self as agent. Rather, all the factors of dependent origination are simply natural conditions and have nothing to do with a “self”.",
  "sn-blurbs:sn12.13": "One who does not understand dependent origination is no true ascetic.",
  "sn-blurbs:sn12.14": "One who does not understand dependent origination is no true ascetic.",
  "sn-blurbs:sn12.15": "Venerable Kaccānagotta asks the Buddha about right view, and the Buddha answers that right view arises when one sees the origin and cessation of the world and is free of attachments. This sutta, brief but profound and difficult, became renowned as the only canonical reference named in Nāgārjuna’s Mūlamadhyamakakārikā, perhaps the most famous philosophical treatise in all Buddhism.",
  "sn-blurbs:sn12.16": "One is qualified to be called a “Dhamma speaker” if one teaches for the ending of suffering.",
  "sn-blurbs:sn12.17": "A naked ascetic named Kassapa approaches the Buddha while he is on alms round and asks whether suffering is created by oneself, by another, by both, or by chance. Explaining why he rejects all these options, the Buddha asserts that suffering arises due to conditions.",
  "sn-blurbs:sn12.18": "A wanderer named Timbaruka asks the Buddha whether pleasure and pain are created by oneself, by another, by both, or by chance. Explaining why he rejects all these options, the Buddha asserts that pleasure and pain arise due to conditions.",
  "sn-blurbs:sn12.19": "Both the wise and the foolish have been reborn in this life due to their deeds conditioned by ignorance in past lives. But a fool continues to make the same mistakes and is reborn yet again, whereas a wise person does not.",
  "sn-blurbs:sn12.20": "The Buddha distinguishes between “dependently originated phenomena”—the twelve factors—and “dependent origination”—the principle of conditionality. Someone who understands these things no longer worries about the past or future.",
  "sn-blurbs:sn12.21": "The Buddha’s teaching rests on his possession of ten powers and four grounds for self-confidence.",
  "sn-blurbs:sn12.22": "The Buddha’s teaching rests on his possession of ten powers and four grounds for self-confidence. When hearing such an open teaching, a mendicant puts forth great effort, considering the good for both themselves and for others.",
  "sn-blurbs:sn12.23": "The ending of defilements comes only when the truth is seen. But seeing the truth comes about due to a vital condition. In this way, twelve factors leading to freedom are united with the twelve factors leading to suffering.",
  "sn-blurbs:sn12.24": "Sāriputta is asked by various ascetics as to the origin of suffering. He replies that the Buddha teaches that suffering originates by conditions. Moreover, all those who offer opinions as to the source of suffering are themselves part of the web of conditions, as they cannot state their views without contact. Ānanda reports the exchange to the Buddha, who praises Sāriputta’s answer.",
  "sn-blurbs:sn12.25": "Sāriputta is asked by Venerable Bhūmija as to the origin of pleasure and pain. He replies that the Buddha teaches that pleasure and pain originate by conditions. Moreover, all those who offer opinions on this question are themselves part of the web of conditions, as they cannot state their views without contact. Ānanda reports the exchange to the Buddha, who praises Sāriputta’s answer.",
  "sn-blurbs:sn12.26": "The Buddha is asked by Venerable Upavāṇa as to the origin of suffering. He replies that suffering originates by conditions. Moreover, all those who offer opinions as to the source of suffering are themselves part of the web of conditions, as they cannot state their views without contact.",
  "sn-blurbs:sn12.27": "Dependent origination is framed within the four noble truths.",
  "sn-blurbs:sn12.28": "A mendicant who understands dependent origination is a trainee who is accomplished in view.",
  "sn-blurbs:sn12.29": "An ascetic who understands dependent origination will realize the goal of the ascetic life.",
  "sn-blurbs:sn12.30": "An ascetic who understands dependent origination may well escape those conditions.",
  "sn-blurbs:sn12.31": "The Buddha asks Sāriputta to explain a verse from “The Questions of Ajita” in the Parāyana (Snp 5.2). At first, Sāriputta hesitates, but proceeds when the Buddha indicates he is looking for an answer in terms of conditionality.",
  "sn-blurbs:sn12.32": "A mendicant named Kaḷāra the Khattiya informs Sāriputta that the mendicant Moḷiyaphagguna had disrobed. Overinterpreting Sāriputta’s reply, Kaḷāra reports to the Buddha that Sāriputta had claimed to have ended all defilements. The Buddha calls Sāriputta to clarify his statements, and Sāriputta explains in terms of dependent origination.",
  "sn-blurbs:sn12.33": "An analysis of 44 contexts for developing insight with regard to dependent origination. This includes an important distinction between knowledge arising from direct vision of the present, and that derived from inference as to the past and future.",
  "sn-blurbs:sn12.34": "An analysis of 77 contexts for developing insight with regard to dependent origination.",
  "sn-blurbs:sn12.35": "A mendicant asks who possesses old age and death, and the other factors. The Buddha says the question is improper, as it assumes a self as agent. Rather, dependent origination is the teaching “by the middle”, explaining phenomena according to natural conditions.",
  "sn-blurbs:sn12.36": "The content of this discourse is identical with SN 12.35, except presented as a general teaching by the Buddha, without an questioner.",
  "sn-blurbs:sn12.37": "The body is not yours, but is old kamma, generated by choices in past lives.",
  "sn-blurbs:sn12.38": "Intentions or choices are the force that propels consciousness from one life to the next.",
  "sn-blurbs:sn12.39": "Intentions or choices are the force that propels consciousness from one life to the next.",
  "sn-blurbs:sn12.40": "Intentions or choices are the force that propels consciousness from one life to the next.",
  "sn-blurbs:sn12.41": "A noble disciple who is a layperson has eliminated the fear that comes from breaking precepts, possesses the four factors of stream-entry, and understands dependent origination.",
  "sn-blurbs:sn12.42": "A noble disciple who is a layperson has eliminated the fear that comes from breaking precepts, possesses the four factors of stream-entry, and understands dependent origination.",
  "sn-blurbs:sn12.43": "The origin and ending of suffering are explained in terms of sense experience giving rise to craving.",
  "sn-blurbs:sn12.44": "The origin and ending of the world are explained in terms of sense experience giving rise to craving and suffering.",
  "sn-blurbs:sn12.45": "While on retreat, the Buddha exclaims how the origin and ending of the world are explained in terms of sense experience giving rise to craving and suffering. A mendicant overhears him, and the Buddha urges him to remember that teaching.",
  "sn-blurbs:sn12.46": "A brahmin asks whether the person who acts is the same or different to the person who receives the result. The Buddha rejects both views as extreme.",
  "sn-blurbs:sn12.47": "The brahmin Jāṇussoṇi asks the Buddha whether all exists or nothing exists. The Buddha rejects both views as extreme.",
  "sn-blurbs:sn12.48": "A brahmin cosmologist asks the Buddha whether all exists or nothing exists. The Buddha rejects both views as extreme.",
  "sn-blurbs:sn12.49": "A noble disciple does not wonder about the links of dependent origination, as they see it for themselves, independent of others.",
  "sn-blurbs:sn12.50": "A noble disciple does not wonder about the links of dependent origination, as they see it for themselves, independent of others.",
  "sn-blurbs:sn12.51": "A mendicant should thoroughly investigate the causes of suffering in accordance with dependent origination. If someone who still has ignorance makes a choice, their consciousness fares on to a suitable state of existence. But one who has eradicated ignorance is detached and is not reborn anywhere.",
  "sn-blurbs:sn12.52": "Craving increases when you linger on pleasing things that stimulate grasping, illustrated with the simile of a bonfire.",
  "sn-blurbs:sn12.53": "Craving increases when you linger on pleasing things that stimulate fetters, illustrated with the simile of a lamp.",
  "sn-blurbs:sn12.54": "Craving increases when you linger on pleasing things that stimulate fetters, illustrated with the simile of a lamp.",
  "sn-blurbs:sn12.55": "Craving increases when you linger on pleasing things that stimulate grasping, illustrated with the simile of a tree.",
  "sn-blurbs:sn12.56": "Craving increases when you linger on pleasing things that stimulate grasping, illustrated with the simile of a tree.",
  "sn-blurbs:sn12.57": "Craving increases when you linger on pleasing things that stimulate fetters, illustrated with the simile of a sapling.",
  "sn-blurbs:sn12.58": "The mental and physical organism is reborn when you linger on pleasing things that stimulate fetters, illustrated with the simile of a tree.",
  "sn-blurbs:sn12.59": "Consciousness is reborn when you linger on pleasing things that stimulate fetters, illustrated with the simile of a tree.",
  "sn-blurbs:sn12.60": "When Ānanda suggests that dependent origination is simple, the Buddha rebukes him. The opening of this is similar to DN 15 Mahānidāna.",
  "sn-blurbs:sn12.61": "An ignorant person might become free of attachment to their body, but not their mind. Still, it would be better to attach to the body, as it is less changeable than the mind, which jumps about like a monkey.",
  "sn-blurbs:sn12.62": "An ignorant person might become free of attachment to their body, but not their mind. Still, it would be better to attach to the body, as it is less changeable than the mind. But a noble disciple reflects on dependent origination.",
  "sn-blurbs:sn12.63": "The Buddha defines the four kinds of “food” or “nutriment”, which include edible food, contact, intention, and consciousness. He illustrates them with a series of powerful and horrifying similes.",
  "sn-blurbs:sn12.64": "The Buddha defines the four kinds of “food” or “nutriment”, which include edible food, contact, intention, and consciousness, showing how they lead to suffering according to dependent origination. ",
  "sn-blurbs:sn12.65": "The Buddha tells the story of how his awakening came about through investigation into dependent origination. He compares it to a man discovering and ancient city, lost and overgrown with weeds.",
  "sn-blurbs:sn12.66": "The right way to investigate inside oneself is to see how suffering is created by craving and attachment, stimulated by pleasant experiences.",
  "sn-blurbs:sn12.67": "Venerables Mahākoṭṭhita and Sāriputta discuss whether the factors of dependent origination are created by oneself, another, both, or by chance.",
  "sn-blurbs:sn12.68": "Venerable Saviṭṭha questions Venerable Musīla about his attainments, and concludes he is an arahant. But Venerable Nārada offers an explanation showing that it is possible to see the Dhamma without having fully realized arahantship.",
  "sn-blurbs:sn12.69": "Like rivers flowing to the ocean, the factors of dependent origination lead to suffering.",
  "sn-blurbs:sn12.70": "The wanderer Susı̄ma fraudulently enters the Sangha so that the wanderers can learn the secret to the Buddha’s fame and success. Hearing that some mendicants claimed to be perfected, Susīma approaches and asks them if they have developed psychic powers or the formless states, to which they say no. Perplexed, he asks the Buddha, who explains that awakening follows insight into the principles of impermanence and causality. Eventually Susı̄ma confesses his misdeed.",
  "sn-blurbs:sn12.71": "One who does not understand aging and death is no true ascetic.",
  "sn-blurbs:sn12.72-81": "One who does not understand the various factors of dependent origination is no true ascetic.",
  "sn-blurbs:sn12.82": "One who does not understand the various factors of dependent origination should seek a teacher.",
  "sn-blurbs:sn13.1": "For someone who has seen the truth, the suffering eliminated is like the great earth; what remains is like the dirt under a fingernail.",
  "sn-blurbs:sn13.2": "For someone who has seen the truth, the suffering eliminated is like the water in a massive dam; what remains is like a few drops on a blade of grass.",
  "sn-blurbs:sn13.3": "For someone who has seen the truth, the suffering eliminated is like the water at the confluence of great rivers; what remains is like a few drops.",
  "sn-blurbs:sn13.4": "For someone who has seen the truth, the suffering eliminated is like the water at the confluence of great rivers; what remains is like a few drops.",
  "sn-blurbs:sn13.5": "For someone who has seen the truth, the suffering eliminated is like the great earth; what remains is like seven balls of clay.",
  "sn-blurbs:sn13.6": "For someone who has seen the truth, the suffering eliminated is like the great earth; what remains is like seven balls of clay.",
  "sn-blurbs:sn13.7": "For someone who has seen the truth, the suffering eliminated is like the water in the ocean; what remains is like a few drops.",
  "sn-blurbs:sn13.8": "For someone who has seen the truth, the suffering eliminated is like the water in the ocean; what remains is like a few drops.",
  "sn-blurbs:sn13.9": "For someone who has seen the truth, the suffering eliminated is like the Himalayas; what remains is like seven bits of gravel.",
  "sn-blurbs:sn13.10": "For someone who has seen the truth, the suffering eliminated is like the Himalayas; what remains is like seven bits of gravel.",
  "sn-blurbs:sn13.11": "For someone who has seen the truth, the suffering eliminated is like the Sineru, king of mountains; what remains is like seven bits of gravel",
  "sn-blurbs:sn14.1": "The senses function due to the various different elements of sense experience, namely, the internal sense organ, the external sense stimulus, and consciousness.",
  "sn-blurbs:sn14.2": "The diverse internal elements of sense experience give rise to diverse contacts.",
  "sn-blurbs:sn14.3": "It is not the case that diverse contacts give rise to the diverse elements of sense experience.",
  "sn-blurbs:sn14.4": "Diverse contacts give rise to diverse feelings.",
  "sn-blurbs:sn14.5": "It is not the case that diverse feelings give rise to diverse contacts.",
  "sn-blurbs:sn14.6": "The senses function due to the various different external elements of sense experience, namely, the various sense stimuli.",
  "sn-blurbs:sn14.7": "The diverse external elements of sense experience give rise to diverse perceptions, intentions, desires, passions, and quests.",
  "sn-blurbs:sn14.8": "It is not the case that diverse perceptions, intentions, desires, passions, and quests give rise to diverse external elements of sense experience.",
  "sn-blurbs:sn14.9": "The diverse external elements of sense experience give rise to diverse perceptions, intentions, desires, passions, quests, and material possessions.",
  "sn-blurbs:sn14.10": "It is not the case that diverse perceptions, intentions, desires, passions, quests, and material possessions give rise to diverse external elements of sense experience.",
  "sn-blurbs:sn14.11": "A rare group of seven elements: light, beauty, the four formless states, and the attainment of cessation. Each of these is known due to the negation of something: light vs. darkness, beauty vs. ugliness, and so on. ",
  "sn-blurbs:sn14.12": "Thoughts of sensuality, ill-will, and cruelty arise due to a series of causes.",
  "sn-blurbs:sn14.13": "When unenlightened people have the view that certain people are Buddhas, this is due to ignorance.",
  "sn-blurbs:sn14.14": "People of poor character associate together, while people of good character associate together.",
  "sn-blurbs:sn14.15": "The Buddha points out that each of the great disciples has a retinue of students of a similar character. And the monks in Devadattas’s retinue all have evil wishes.",
  "sn-blurbs:sn14.16": "People of poor character associate together, while people of good character associate together. Illustrated with similes and verses.",
  "sn-blurbs:sn14.17": "The faithless and those of other bad qualities associate together, while those of good qualities associate together.",
  "sn-blurbs:sn14.18": "Those of bad qualities associate together, while those of good qualities associate together.",
  "sn-blurbs:sn14.19": "Those of bad qualities associate together, while those of good qualities associate together.",
  "sn-blurbs:sn14.20": "Those of bad qualities associate together, while those of good qualities associate together.",
  "sn-blurbs:sn14.21": "Those of bad qualities associate together, while those of good qualities associate together.",
  "sn-blurbs:sn14.22": "Those of bad qualities associate together, while those of good qualities associate together.",
  "sn-blurbs:sn14.23": "Those of bad qualities associate together, while those of good qualities associate together.",
  "sn-blurbs:sn14.24": "Those of bad qualities associate together, while those of good qualities associate together.",
  "sn-blurbs:sn14.25": "Those of bad qualities associate together, while those of good qualities associate together.",
  "sn-blurbs:sn14.26": "Those of bad qualities associate together, while those of good qualities associate together.",
  "sn-blurbs:sn14.27": "Those of bad qualities associate together, while those of good qualities associate together.",
  "sn-blurbs:sn14.28": "Those of bad qualities associate together, while those of good qualities associate together.",
  "sn-blurbs:sn14.29": "Those of bad qualities associate together, while those of good qualities associate together.",
  "sn-blurbs:sn14.30": "The four material elements of earth, water, heat, and air. Note that “air” is close in meaning to “wind”.",
  "sn-blurbs:sn14.31": "Before his awakening the Buddha saw the gratification, the drawback, and the escape in the four material elements.",
  "sn-blurbs:sn14.32": "The Buddha set out to discover the gratification, the drawback, and the escape in the four material elements, and found it.",
  "sn-blurbs:sn14.33": "Each of the three aspects of the four material elements performs its own function. Gratification stimulates desire; drawbacks lead to disillusionment, while escape opens the possibility of freedom.",
  "sn-blurbs:sn14.34": "If the material elements were solely painful, beings would not get attached. If they were solely pleasurable, it would be impossible to become detached. ",
  "sn-blurbs:sn14.35": "When you seek pleasure in the material elements, you seek pleasure in suffering.",
  "sn-blurbs:sn14.36": "The arising of the material elements is the arising of suffering.",
  "sn-blurbs:sn14.37": "One who does not understand the four material elements is no true ascetic.",
  "sn-blurbs:sn14.38": "One who does not understand the four material elements is no true ascetic.",
  "sn-blurbs:sn14.39": "One who does not understand the four material elements is no true ascetic.",
  "sn-blurbs:sn15.1": "Transmigration is endless, like the grass and twigs in India.",
  "sn-blurbs:sn15.2": "Transmigration is endless, like the great earth.",
  "sn-blurbs:sn15.3": "The tears you have shed in transmigration are greater than the waters in the oceans.",
  "sn-blurbs:sn15.4": "The mother’s milk you have drunk in transmigration is greater than the waters in the oceans.",
  "sn-blurbs:sn15.5": "A great mountain would erode before the end of the eon.",
  "sn-blurbs:sn15.6": "A city filled with mustard seeds might be emptied before the end of an eon.",
  "sn-blurbs:sn15.7": "Even recollecting 100,000 eons per day you’ll never remember the beginning of transmigration.",
  "sn-blurbs:sn15.8": "There have been more eons than the sands in the Ganges river.",
  "sn-blurbs:sn15.9": "Like a stick falling on this side or that, beings are reborn in different realms.",
  "sn-blurbs:sn15.10": "The bones you’ve left behind in transmigration are greater than a mountain.",
  "sn-blurbs:sn15.11": "When you see someone suffer, know that you too have experienced that.",
  "sn-blurbs:sn15.12": "When you see someone happy, know that you too have experienced that.",
  "sn-blurbs:sn15.13": "The blood you have shed from being slaughtered or beheaded in transmigration is greater than the waters in the oceans.",
  "sn-blurbs:sn15.14": "It is not easy to find a being who has not been your mother.",
  "sn-blurbs:sn15.15": "It is not easy to find a being who has not been your father.",
  "sn-blurbs:sn15.16": "It is not easy to find a being who has not been your brother.",
  "sn-blurbs:sn15.17": "It is not easy to find a being who has not been your sister.",
  "sn-blurbs:sn15.18": "It is not easy to find a being who has not been your son.",
  "sn-blurbs:sn15.19": "It is not easy to find a being who has not been your daughter.",
  "sn-blurbs:sn15.20": "The Buddha recounts how peoples of the past had different names for the mountains of Rājagaha. Yet now they have all gone",
  "sn-blurbs:sn16.1": "Kassapa is content with robes, alms-food, lodging, and medicines.",
  "sn-blurbs:sn16.2": "Sāriputta approaches Kassapa and asks how it is that only someone who is keen and conscientious can realize freedom.",
  "sn-blurbs:sn16.3": "Kassapa approaches families like the moon, with humility, keeping his distance, and not getting involved. So when he teaches, it is with pure intentions.",
  "sn-blurbs:sn16.4": "Some mendicants approach families in the hope of receiving fine gifts or respect—but not Kassapa.",
  "sn-blurbs:sn16.5": "The Buddha points out that Kassapa has grown old, and urges him to give up his ascetic life and stay in a comfortable monastery.",
  "sn-blurbs:sn16.6": "The Buddha invites Kassapa to teach the mendicants, but he is reluctant, since certain students of Anuruddha and Ānanda have been competing to see who can teach better.",
  "sn-blurbs:sn16.7": "The Buddha invites Kassapa to teach the mendicants, but he is reluctant, saying that the mendicants have become stubborn and their good qualities are declining.",
  "sn-blurbs:sn16.8": "The Buddha invites Kassapa to teach the mendicants, but he is reluctant, saying that the senior mendicants used to set a good example, but now instead of respecting good practice, they respect fame and fortune.",
  "sn-blurbs:sn16.9": "The Buddha asserts that just as he has full mastery of all the meditation attainments and higher spiritual realizations, so does Kassapa.",
  "sn-blurbs:sn16.10": "When Kassapa is persuaded by Ānanda to go with him to teach the nuns, the nun Thullatissā compares him unfavorably to Ānanda, prompting Kassapa to issue a warning and make a bold claim of his spiritual mastery. This discourse appears to be set after the Buddha’s passing.",
  "sn-blurbs:sn16.11": "When several of Ānanda’s students disrobe, Kassapa admonishes him, calling him “boy”. The nun Thullanandā hears of this and criticizes Kassapa, claiming he formerly followed another teacher. But Kassapa refutes this, and gives an account of his going forth and first encounter with the Buddha.",
  "sn-blurbs:sn16.12": "Sāriputta asks Kassapa about whether a Realized One survives death.",
  "sn-blurbs:sn16.13": "Kassapa asks the Buddha why there are now more rules but fewer awakened mendicants. The Buddha replies that it is due to the arising of the counterfeit Dhamma, giving five factors that lead to decline",
  "sn-blurbs:sn17.1": "Material possessions, honor, and praise are terrible things, obstructing spiritual progress.",
  "sn-blurbs:sn17.2": "Material possessions, honor, and praise are terrible things, which catch you like fish on a hook.",
  "sn-blurbs:sn17.3": "Material possessions, honor, and praise are terrible things, which hit you like a harpoon hits a careless turtle.",
  "sn-blurbs:sn17.4": "Material possessions, honor, and praise are terrible things, which snare you like a long-haired goat in a briar patch.",
  "sn-blurbs:sn17.5": "A mendicant who is proud on account of their material possessions, honor, and praise is like a dung beetle proud of their ball of dung.",
  "sn-blurbs:sn17.6": "Material possessions, honor, and praise are terrible things, like a lightning strike.",
  "sn-blurbs:sn17.7": "Material possessions, honor, and praise are terrible things, like a poison dart.",
  "sn-blurbs:sn17.8": "A mendicant who is proud on account of their material possessions, honor, and praise is never at peace, like a mangy jackal.",
  "sn-blurbs:sn17.9": "A mendicant who is proud on account of their material possessions, honor, and praise is never at peace, like a bird in a gale.",
  "sn-blurbs:sn17.10": "Material possessions, honor, and praise are terrible things, and attachment to them leads to a bad rebirth.",
  "sn-blurbs:sn17.11": "Material possessions, honor, and praise are terrible things, which can corrupt the mind even of a pure mendicant.",
  "sn-blurbs:sn17.12": "Material possessions, honor, and praise are terrible things, which can corrupt the mind even of a pure mendicant.",
  "sn-blurbs:sn17.13-20": "Material possessions, honor, and praise are terrible things, which can corrupt the mind even of a pure mendicant.",
  "sn-blurbs:sn17.21": "Material possessions, honor, and praise can be even more tempting than a woman.",
  "sn-blurbs:sn17.22": "Material possessions, honor, and praise can be even more tempting than the finest lady in the land.",
  "sn-blurbs:sn17.23": "A laywoman should wish that if her son remains in the household life, he should be like Citta and Hatthaka. But if he becomes a monk, may material possessions, honor, and praise not come to him!",
  "sn-blurbs:sn17.24": "A laywoman should wish that if her daughter remains in the household life, she should be like Khujjuttarā and Veḷukaṇḍakiyā. But if she becomes a nun, may material possessions, honor, and praise not come to her!",
  "sn-blurbs:sn17.25": "Someone who doesn’t fully understand material possessions, honor, and praise is no true ascetic.",
  "sn-blurbs:sn17.26": "Someone who doesn’t fully understand material possessions, honor, and praise is no true ascetic.",
  "sn-blurbs:sn17.27": "Someone who doesn’t fully understand material possessions, honor, and praise is no true ascetic.",
  "sn-blurbs:sn17.28": "Material possessions, honor, and praise cut to the bone.",
  "sn-blurbs:sn17.29": "Material possessions, honor, and praise cut to the bone, like a rope.",
  "sn-blurbs:sn17.30": "Material possessions, honor, and praise are even a problem for a perfected one, as they interfere with their meditation.",
  "sn-blurbs:sn17.31": "Devadatta provoked a schism due to material possessions, honor, and praise.",
  "sn-blurbs:sn17.32": "Devadatta’s wholesome root was cut off due to material possessions, honor, and praise.",
  "sn-blurbs:sn17.33": "Devadatta’s wholesome nature was cut off due to material possessions, honor, and praise.",
  "sn-blurbs:sn17.34": "Devadatta’s bright nature was cut off due to material possessions, honor, and praise.",
  "sn-blurbs:sn17.35": "Material possessions, honor, and praise led to Devadatta’s downfall, like the fruit of a plantain.",
  "sn-blurbs:sn17.36": "Prince Ajātasattu supplied devadatta with 500 carts of offerings, leading to his downfall.",
  "sn-blurbs:sn17.37": "Even someone who would not lie for the sake of their mother would so so when corrupted by material possessions. ",
  "sn-blurbs:sn17.38-43": "Even someone who would not lie for the sake of their father and other relatives would so so when corrupted by material possessions. ",
  "sn-blurbs:sn18.1": "The Buddha answers Rāhula’s request by teaching on the internal sense organs in light of the three characteristics.",
  "sn-blurbs:sn18.2": "The Buddha answers Rāhula’s request by teaching on the external sense objects in light of the three characteristics.",
  "sn-blurbs:sn18.3": "The Buddha answers Rāhula’s request by teaching on sense consciousness in light of the three characteristics.",
  "sn-blurbs:sn18.4": "The Buddha answers Rāhula’s request by teaching on sense contact in light of the three characteristics.",
  "sn-blurbs:sn18.5": "The Buddha answers Rāhula’s request by teaching on feelings in light of the three characteristics.",
  "sn-blurbs:sn18.6": "The Buddha answers Rāhula’s request by teaching on perceptions in light of the three characteristics.",
  "sn-blurbs:sn18.7": "The Buddha answers Rāhula’s request by teaching on intentions in light of the three characteristics.",
  "sn-blurbs:sn18.8": "The Buddha answers Rāhula’s request by teaching on cravings in light of the three characteristics.",
  "sn-blurbs:sn18.9": "The Buddha answers Rāhula’s request by teaching on the four material elements in light of the three characteristics.",
  "sn-blurbs:sn18.10": "The Buddha answers Rāhula’s request by teaching on the five aggregates in light of the three characteristics.",
  "sn-blurbs:sn18.11": "The Buddha teaches Rāhula about the internal sense organs in light of the three characteristics.",
  "sn-blurbs:sn18.12-20": "The Buddha teaches Rāhula about the senses, aggregates, and elements in light of the three characteristics.",
  "sn-blurbs:sn18.21": "Rāhula asks how to see so that conceit no longer occurs. The Buddha teaches him to investigate the five aggregates in terms of not-self.",
  "sn-blurbs:sn18.22": "Rāhula asks how to see so conceit no longer occurs and one is peaceful. The Buddha teaches him to investigate the five aggregates in terms of not-self",
  "sn-blurbs:sn19.1": "While walking for alms down Vulture’s Peak, Venerable Moggallāna smiled at something invisible. Later, he told the Buddha it was a skeleton flying through the air, being pecked at by vultures. The Buddha confirmed that the man he had seen had been a butcher in his past life",
  "sn-blurbs:sn20.1": "As rafters depend on the roof-peak, unwholesome qualities depend on ignorance.",
  "sn-blurbs:sn20.2": "As the dirt in a fingernail is smaller than the great earth, the beings reborn as humans are few.",
  "sn-blurbs:sn20.3": "As a family with few men and many women is easily attacked, non-human beings may attack a mendicant without love.",
  "sn-blurbs:sn20.4": "Love is more beneficial than generosity.",
  "sn-blurbs:sn20.5": "As it is not possible to bend back a spear, it is not possible to overthrow a mendicant who has developed love.",
  "sn-blurbs:sn20.6": "Only a speedster could catch arrows in flight, yet conditioned phenomena perish faster than that.",
  "sn-blurbs:sn20.7": "As an ancient drum has disintegrated, so too will the true teachings disappear.",
  "sn-blurbs:sn20.8": "Warriors who sleep on wooden pillows remain vigilant, and so it is for the spiritual seeker.",
  "sn-blurbs:sn20.9": "A mendicant who overly associates with the laity is like an elephant calf who tries to copy the great bull elephants.",
  "sn-blurbs:sn20.10": "As a cat may suffer from eating too hastily, so a mendicant may suffer by not restraining senses.",
  "sn-blurbs:sn20.11": "A mangy jackal howls in discomfort, but even that would be a good rebirth for some.",
  "sn-blurbs:sn20.12": "An old jackal howls at dawn, but even they have more gratitude than some",
  "sn-blurbs:sn21.1": "Moggallāna reflects that second absorption is the true noble silence, and the Buddha encourages him to develop it.",
  "sn-blurbs:sn21.2": "Sāriputta says that not even if the Buddha changed would it cause him sorrow.",
  "sn-blurbs:sn21.3": "Sāriputta and Moggallāna come together for a discussion, which touches on the use of psychic powers and energy. The two great monks end up warmly praising each other.",
  "sn-blurbs:sn21.4": "When a certain monk neglects his duties in favor of solitude, other monks complain. The Buddha questions him, and finds that he is awakened.",
  "sn-blurbs:sn21.5": "The Buddha praises Venerable Sujāta as beautiful both inside and out.",
  "sn-blurbs:sn21.6": "Venerable Lakuṇṭaka Bhaddiya is a dwarf, considered to be ugly and unsightly. The Buddha warns the monks not to despise him as he had realized full awakening.",
  "sn-blurbs:sn21.7": "The Buddha praises Venerable Visākha Pañcāliputta for teaching the Dhamma.",
  "sn-blurbs:sn21.8": "Venerable Nanda wore pretty robes, a fancy bowl, and makeup, so the Buddha encouraged him to embrace simplicity. ",
  "sn-blurbs:sn21.9": "Venerable Tissa admonished others but got upset when he was admonished. The Buddha encourages him to let go of his anger.",
  "sn-blurbs:sn21.10": "A monk named “Senior” likes to live alone, but the Buddha questions whether it is the true solitude.",
  "sn-blurbs:sn21.11": "The Buddha describes Venerable Mahākappina as thin, fair-skinned, with a big nose—and as awakened.",
  "sn-blurbs:sn21.12": "The Buddha praises two friends who are students of Venerable Mahākappina",
  "sn-blurbs:sn22.1": "The householder Nakulapitā asks the Buddha for help in coping with old age. The Buddha says to reflect: “Even though I am afflicted in body, my mind will be unafflicted.” Later Sāriputta explains this in terms of the five aggregates.",
  "sn-blurbs:sn22.2": "A number of mendicants are heading for lands west, but the Buddha advises them to speak with Sāriputta before they go. Sāriputta reminds them that in foreign lands they will be scrutinized for their understanding, so they need to be able to answer questions on the teaching. He goes on to explain that the Dhamma is for the removal of desire for the five aggregates.",
  "sn-blurbs:sn22.3": "The householder Hāliddakāni approaches the Venerable Mahākaccāna in the Avanti country and asks how to understand a verse from “The Questions of Māgandiya” of the Aṭṭhakavagga (Snp 4.9). Though the verse appears to be pitched at an ethical level, describing a sage intimate with none in the village, Mahākaccāna explains it in philosophical terms as non-attachment to the aggregates.",
  "sn-blurbs:sn22.4": "The householder Hāliddakāni approaches the Venerable Mahākaccāna in the Avanti country and asks how to understand a passage on liberation from “The Questions of Sakka” (see MN 37 and DN 21). Mahākaccāna explains it in terms of freedom from attachment to the aggregates.",
  "sn-blurbs:sn22.5": "A mendicant should develop immersion (samādhi) in order to truly understand the origin and ending of the five aggregates.",
  "sn-blurbs:sn22.6": "A mendicant should make an effort in seclusion in order to truly understand the origin and ending of the five aggregates.",
  "sn-blurbs:sn22.7": "An ordinary person identifies their self with the five aggregates and suffers anxiety when the aggregates change. But a noble disciple, free of such identification, does not suffer.",
  "sn-blurbs:sn22.8": "An ordinary person identifies their self with the five aggregates and suffers anxiety when the aggregates change. But a noble disciple, free of such identification, does not suffer.",
  "sn-blurbs:sn22.9": "The aggregates are impermanent in the past and future as in the present.",
  "sn-blurbs:sn22.10": "The aggregates are suffering in the past and future as in the present.",
  "sn-blurbs:sn22.11": "The aggregates are not-self in the past and future as in the present.",
  "sn-blurbs:sn22.12": "Because the aggregates are impermanent, a noble disciple becomes disillusioned with them.",
  "sn-blurbs:sn22.13": "Because the aggregates are suffering, a noble disciple becomes disillusioned with them.",
  "sn-blurbs:sn22.14": "Because the aggregates are not-self, a noble disciple becomes disillusioned with them.",
  "sn-blurbs:sn22.15": "One should truly understand the five aggregates as impermanent, etc.",
  "sn-blurbs:sn22.16": "One should truly understand the five aggregates as suffering, etc.",
  "sn-blurbs:sn22.17": "One should truly understand the five aggregates as not-self.",
  "sn-blurbs:sn22.18": "Since the causes of the aggregates are impermanent, how can the aggregates be permanent?",
  "sn-blurbs:sn22.19": "Since the causes of the aggregates are suffering, how can the aggregates be free of suffering?",
  "sn-blurbs:sn22.20": "Since the causes of the aggregates are not-self, how can the aggregates be self?",
  "sn-blurbs:sn22.21": "Ānanda asks the Buddha what exactly is meant when we say that things cease. The Buddha explains it as the cessation of the aggregates.",
  "sn-blurbs:sn22.22": "The aggregates are the burden, a person carries that burden, craving takes up the burden, and letting go puts down the burden.",
  "sn-blurbs:sn22.23": "The aggregates are to be fully understood, and the full understanding is the ending of defilements.",
  "sn-blurbs:sn22.24": "Only by directly knowing the aggregates can one end suffering.",
  "sn-blurbs:sn22.25": "By letting go desire, the aggregates come to an end.",
  "sn-blurbs:sn22.26": "Before his awakening, the Buddha investigated the aggregates in terms of their gratification, drawback, and escape.",
  "sn-blurbs:sn22.27": "When the Buddha fully knew the gratification, drawback, and escape regarding the five aggregates he became awakened.",
  "sn-blurbs:sn22.28": "Beings are attached to the five aggregates due to gratification, repelled due to drawbacks, and find escape because there is an escape.",
  "sn-blurbs:sn22.29": "If you enjoy the aggregates, you enjoy suffering.",
  "sn-blurbs:sn22.30": "The arising of the aggregates is the arising of suffering.",
  "sn-blurbs:sn22.31": "The aggregates are misery, desire for them is the root of misery.",
  "sn-blurbs:sn22.32": "The aggregates are fragile and their passing is not fragile.",
  "sn-blurbs:sn22.33": "Let go of what is not yours: the five aggregates. You wouldn’t be upset if someone took the grass and sticks from the monastery grounds, so why worry over the aggregates?",
  "sn-blurbs:sn22.34": "Let go of what is not yours: the five aggregates.",
  "sn-blurbs:sn22.35": "The Buddha teaches a mendicant who wants to go on retreat that one is reckoned by what one has an underlying tendency for. The mendicant gives a full explanation.",
  "sn-blurbs:sn22.36": "The Buddha teaches a mendicant who wants to go on retreat that one is measured by what one has an underlying tendency for. The mendicant gives a full explanation.",
  "sn-blurbs:sn22.37": "The Buddha speaks to Ānanda on what at AN 3.47 described as the “characteristics of conditioned phenomena”: arising, ceasing, and change while persisting. This was to become a critical aspect of later theories on the nature of change. Ānanda explains in terms of the aggregates.",
  "sn-blurbs:sn22.38": "The Buddha speaks to Ānanda on what at AN 3.47 described as the “characteristics of conditioned phenomena”: arising, ceasing, and change while persisting, as applied to past, future, and present. Ānanda explains in terms of the aggregates.",
  "sn-blurbs:sn22.39": "To practice in line with the teachings a mendicant should meditate on disillusionment with the aggregates. ",
  "sn-blurbs:sn22.40": "To practice in line with the teachings a mendicant should meditate on the aggregates as impermanent.",
  "sn-blurbs:sn22.41": "To practice in line with the teachings a mendicant should meditate on the aggregates as suffering.",
  "sn-blurbs:sn22.42": "To practice in line with the teachings a mendicant should meditate on the aggregates as not-self.",
  "sn-blurbs:sn22.43": "Dwell with yourself as an island and refuge, with the Dhamma as an island and refuge. How? By investigating how suffering arises from identification with the aggregates.",
  "sn-blurbs:sn22.44": "Contemplation of the five aggregates as not-self is the path to the end of identity.",
  "sn-blurbs:sn22.45": "Seeing the five aggregates as impermanent, etc., leads to freedom.",
  "sn-blurbs:sn22.46": "Seeing the five aggregates as impermanent, etc., leads to letting go of views and ultimately to freedom.",
  "sn-blurbs:sn22.47": "When you identify anything as self, you always identify one or other of the five aggregates.",
  "sn-blurbs:sn22.48": "The distinction between “five aggregates” and “five grasping aggregates”.",
  "sn-blurbs:sn22.49": "The Buddha teaches a householder named Soṇa not to be conceited about the five aggregates.",
  "sn-blurbs:sn22.50": "The Buddha teaches a householder named Soṇa that any true ascetic understands the five aggregates.",
  "sn-blurbs:sn22.51": "Right view is seeing the aggregates as they are, impermanent, and this leads to freedom.",
  "sn-blurbs:sn22.52": "Focusing properly on the five aggregates you see them as they are and become free.",
  "sn-blurbs:sn22.53": "Consciousness stands dependent on the other four aggregates, and this attachment is what fuels the cycle of rebirth.",
  "sn-blurbs:sn22.54": "Consciousness is like a seed that is planted in the soil of the other four aggregates and watered with craving.",
  "sn-blurbs:sn22.55": "The Buddha utters an enigmatic saying that non-identification leads to cutting off the fetters. A mendicant asks how to achieve this.",
  "sn-blurbs:sn22.56": "The Buddha did not claim to be awakened until he had fully understood each of the five aggregates in the light of each of the four noble truths. This discourse includes definitions of each of the aggregates.",
  "sn-blurbs:sn22.57": "To be fully accomplished, a mendicant should investigate the five aggregates in light of the four noble truths, as well as their gratification, drawback, and escape. In addition, they should investigate the elements, sense fields, and dependent origination.",
  "sn-blurbs:sn22.58": "The Buddha declares that a mendicant is freed by wisdom by non-attachment to the aggregates, in just the same way as he himself. He then explains that the difference between himself and another awakened mendicant is simply that he was the first to discover the path and teach it to others.",
  "sn-blurbs:sn22.59": "In the Deer Park at Varanasi the Buddha teaches the famous second discourse, on not-self with regard to the aggregates, to the group of five monks. At the conclusion, they become perfected ones.",
  "sn-blurbs:sn22.60": "Mahāli the Licchavi reports to the Buddha that the rival teacher Pūraṇa Kassapa asserts that there is no reason for beings to be either defiled or pure. The Buddha denies this, and goes on to explain how it happens.",
  "sn-blurbs:sn22.61": "The five aggregates are burning.",
  "sn-blurbs:sn22.62": "All philosophers must accept that the five aggregates are described in language that refers to either the past, future, or present.",
  "sn-blurbs:sn22.63": "A mendicant comes to the Buddha to ask for instructions before going on retreat. The Buddha teaches them that in clinging to the aggregates one is bound by Māra.",
  "sn-blurbs:sn22.64": "In conceiving regarding the aggregates one is bound by Māra.",
  "sn-blurbs:sn22.65": "In seeking enjoyment in the aggregates one is bound by Māra.",
  "sn-blurbs:sn22.66": "One should let go of desire for what is impermanent, namely the five aggregates.",
  "sn-blurbs:sn22.67": "One should let go of desire for what is suffering, namely the five aggregates.",
  "sn-blurbs:sn22.68": "One should let go of desire for what is not-self, namely the five aggregates.",
  "sn-blurbs:sn22.69": "One should let go of desire for what does not belong to self, namely the five aggregates.",
  "sn-blurbs:sn22.70": "One should let go of desire for what appears tantalizing, namely the five aggregates.",
  "sn-blurbs:sn22.71": "Venerable Rādha asks the Buddha how to see so as to let go of conceit. The Buddha tells him to contemplate the aggregates in terms of not-self.",
  "sn-blurbs:sn22.72": "Venerable Surādha asks the Buddha how to see so as to let go of conceit and be freed. The Buddha tells him to contemplate the aggregates in terms of not-self.",
  "sn-blurbs:sn22.73": "Only a noble disciple truly understand the five aggregates’ gratification, drawback, and escape.",
  "sn-blurbs:sn22.74": "Only a noble disciple truly understand the five aggregates’ origin, ending, gratification, drawback, and escape.",
  "sn-blurbs:sn22.75": "Only a noble disciple truly understand the five aggregates’ origin, ending, gratification, drawback, and escape.",
  "sn-blurbs:sn22.76": "One who is freed after truly understanding the aggregates is a perfected one. They are the best of beings, even up to the pinnacle of existence. A set of verses extols the perfected ones.",
  "sn-blurbs:sn22.77": "One who is freed after truly understanding the aggregates is a perfected one. They are the best of beings, even up to the pinnacle of existence. ",
  "sn-blurbs:sn22.78": "When a lion emerges from its lair and roars, animals are terrified. Similarly, when the Buddha teaches of the impermanence of the aggregates, even the gods are filled with fear. This is illustrated with a set of verses.",
  "sn-blurbs:sn22.79": "One of the most extensive discourses in this collection begins with the Buddha saying that when anyone recollects a past life, all they are recollecting is the five aggregates. He then gives a distinctive set of definitions of the aggregates in terms of their functions, and discusses them from various aspects.",
  "sn-blurbs:sn22.80": "While staying at Kapilavatthu the Buddha dismissed the the Sangha for misbehaving. Later he decided to support them for the sake of the young mendicants. He reminds them that their livelihood is considered a lowly one, and that one should let go of bad thoughts and wrong views, and see the aggregates as impermanent. ",
  "sn-blurbs:sn22.81": "Leaving behind the quarreling monks at Kosambi, the Buddha went to stay in the empty forest at Pārileyyaka. Ānanda brings some mendicants to receive a teaching, and one of them wonders how to see so as to end defilements in this very life. The Buddha teaches the 37 practices that lead to awakening, and then goes on to show that various ways of regarding the aggregates are conditioned phenomena.",
  "sn-blurbs:sn22.82": "On a sabbath day with the Sangha at Sāvatthi, the Buddha answers a series of ten questions on the aggregates.",
  "sn-blurbs:sn22.83": "Ānanda praises Venerable Puṇṇa Mantāniputta, and says that it was when hearing his teaching on the aggregates that he understood the Dhamma.",
  "sn-blurbs:sn22.84": "Venerable Tissa, the Blessed One’s paternal cousin, tells the monks that he is dissatisfied as a monk. When the Buddha hears of this, he calls Tissa to him, and questions him on the aggregates. As Tissa showed his understanding of each question, the Buddha praised him, lifting his spirits.",
  "sn-blurbs:sn22.85": "Venerable Yamaka had the wrong view that one whose defilements have ended is annihilated at death. The monks ask Sāriputta to help, and he asks Yamaka whether the Realized One in this very life may be identified as one of the aggregates, or apart from them. Convinced, Yamaka lets go of his view and sees the Dhamma.",
  "sn-blurbs:sn22.86": "Venerable Anurādha is questioned by a number of ascetics, and ends up by saying that the Realized One is described in terms other than “existing after death” and so on. The wanderers say he’s a fool, so he checks with the Buddha, who says that a Realized One is not even apprehended in this life, so how can he be described after death?",
  "sn-blurbs:sn22.87": "Venerable Vakkali is ill, and asks the Buddha to visit him. The Buddha does so, but says there is no point in seeing his physical body, as one who sees the Dhamma sees him. Later, Vakkali is taken to the Black Rock on Isigili, where he declares that he has no attachment to the aggregates, and takes his own life. The Buddha says that he had attained final extinguishment.",
  "sn-blurbs:sn22.88": "Venerable Assaji is ill, and asks the Buddha to visit him. The Buddha does so, and learns that Assaji has difficulty maintaining his meditation. The Buddha encourages him to contemplate the impermanence of the aggregates.",
  "sn-blurbs:sn22.89": "Venerable Khemaka is ill, and some senior mendicants ask Dāsaka to convey their concern to him. There follows a series of exchanges mediated by Dāsaka until eventually Khemaka, despite his illness, goes to see the other mendicants himself. The seniors are asking to determine Khemaka’s understanding of the Dhamma, and he says that although he has let go of the five lower fetters, he still has a residual attachment to the five aggregates.",
  "sn-blurbs:sn22.90": "Hearing that the Buddha, while on his deathbed, had announced a special punishment for him, Venerable Channa asks for teachings from the mendicants. Unsatisfied, he seeks out Ānanda, who teaches him the address to Kaccāyana (SN 12.15).",
  "sn-blurbs:sn22.91": "Rāhula asks how to contemplate to let go of conceit. The Buddha urges him to see the aggregates as not-self.",
  "sn-blurbs:sn22.92": "Rāhula asks how to contemplate to let go of conceit and be free. The Buddha urges him to see the aggregates as not-self.",
  "sn-blurbs:sn22.93": "If you grasp at the aggregates as a self, you will meet with calamity, like a man swept down by a mountain river, grasping at grass or rushes.",
  "sn-blurbs:sn22.94": "The Buddha doesn’t dispute with the world; the world disputes with him. He has understood the five aggregates and explains them. Like a lotus, he was born in the swamp, but rises above it.",
  "sn-blurbs:sn22.95": "The Buddha gives a series of similes for the aggregates: physical form is like foam, feeling is like a bubble, perception is like a mirage, choices are like a coreless tree, and consciousness is like an illusion. ",
  "sn-blurbs:sn22.96": "Nothing in the aggregates has even the tiniest bit of stability or permanence. In a past life, the Buddha was a great king with vast properties, but all those conditions have passed away.",
  "sn-blurbs:sn22.97": "A mendicant asks whether anything in the aggregates has even the tiniest bit of stability or permanence. The Buddha answers using the simile of a little dirt under his fingernail.",
  "sn-blurbs:sn22.98": "A mendicant asks whether anything in the aggregates has even the tiniest bit of stability or permanence.",
  "sn-blurbs:sn22.99": "Transmigration has no knowable beginning; even the oceans, mountains, and this great earth will perish. But like a dog on a leash running around a post, beings remain attached to the aggregates.",
  "sn-blurbs:sn22.100": "A dog leashed to a post will always remain close to that post. In the same way, beings remain close to aggregates in this endless cycle of transmigration. The Buddha refers to a well-known painting called “Conduct”, and says the mind is even more diverse than that; and indeed, the animal realm is the most diverse of them all, and it is produced by the mind.",
  "sn-blurbs:sn22.101": "Contemplating the aggregates leads to liberation, but this may not be immediately apparent. The Buddha illustrates this with similes of a chook sitting on eggs, the wearing away of an axe handle, and the rotting of a ship’s rigging.",
  "sn-blurbs:sn22.102": "The perception of impermanence eliminates lust, ignorance, and conceit. Illustrated with a long series of similes.",
  "sn-blurbs:sn22.103": "The aggregates considered in light of the four noble truths, phrased as “portions” or “sides”.",
  "sn-blurbs:sn22.104": "The aggregates considered in light of the four noble truths in terms of suffering.",
  "sn-blurbs:sn22.105": "The aggregates considered in light of the four noble truths in terms of identity.",
  "sn-blurbs:sn22.106": "The aggregates are to be fully understood, ending the defilements is the full understanding of them, and an arahant is the one who has achieved this.",
  "sn-blurbs:sn22.107": "Only a true ascetic fully understands the five aggregates.",
  "sn-blurbs:sn22.108": "Only a true ascetic fully understands the five aggregates.",
  "sn-blurbs:sn22.109": "One who truly understand these five aggregates is a stream-enterer.",
  "sn-blurbs:sn22.110": "One who truly understand these five aggregates and is freed from them is a perfected one.",
  "sn-blurbs:sn22.111": "Give up desire for the aggregates and they will come to an end.",
  "sn-blurbs:sn22.112": "Give up desire for the aggregates and they will come to an end.",
  "sn-blurbs:sn22.113": "Ignorance is not understanding the aggregates.",
  "sn-blurbs:sn22.114": "Knowledge is understanding the aggregates.",
  "sn-blurbs:sn22.115": "A true Dhamma speaker teaches for letting go of the aggregates.",
  "sn-blurbs:sn22.116": "A true Dhamma speaker teaches for letting go of the aggregates.",
  "sn-blurbs:sn22.117": "An unawakened person is bound both internally and externally to the aggregates and grows old in bondage.",
  "sn-blurbs:sn22.118": "The Buddha questions the mendicants on the aggregates.",
  "sn-blurbs:sn22.119": "The Buddha questions the mendicants on the aggregates.",
  "sn-blurbs:sn22.120": "The aggregates are the things that fetter, the craving is the fetter.",
  "sn-blurbs:sn22.121": "The aggregates are the things that are graspable, the craving is the grasping.",
  "sn-blurbs:sn22.122": "Mahākoṭṭhita asks what an ethical mendicant should focus on, and Sāriputta replies that if they focus on aggregates as impermanent, etc. they may become a stream-enterer. A stream-enterer contemplating in the same way may become a non-returner, a once-returner, and a perfected one.",
  "sn-blurbs:sn22.123": "Mahākoṭṭhita asks what an educated mendicant should focus on, and Sāriputta replies that if they focus on aggregates as impermanent, etc. they may become a stream-enterer. A stream-enterer contemplating in the same way may become a non-returner, a once-returner, and a perfected one.",
  "sn-blurbs:sn22.124": "Venerable Kappa asks the Buddha how to see so as to let go of conceit. The Buddha tells him to contemplate the aggregates in terms of not-self.",
  "sn-blurbs:sn22.125": "Venerable Kappa asks the Buddha how to see so as to let go of conceit and be freed. The Buddha tells him to contemplate the aggregates in terms of not-self.",
  "sn-blurbs:sn22.126": "The Buddha explains to a mendicant that ignorance is not understanding the aggregates in terms of arising and ceasing, while knowledge is understanding the aggregates.",
  "sn-blurbs:sn22.127": "Sāriputta explains to Mahākoṭṭhita that ignorance is not understanding the aggregates in terms of arising and ceasing.",
  "sn-blurbs:sn22.128": "Sāriputta explains to Mahākoṭṭhita that knowledge is understanding the aggregates in terms of arising and ceasing.",
  "sn-blurbs:sn22.129": "Sāriputta explains to Mahākoṭṭhita that ignorance is not understanding the aggregates in terms of gratification, drawback, and escape.",
  "sn-blurbs:sn22.130": "Sāriputta explains to Mahākoṭṭhita that knowledge is understanding the aggregates in terms of gratification, drawback, and escape.",
  "sn-blurbs:sn22.131": "Sāriputta explains to Mahākoṭṭhita that ignorance is not understanding the aggregates in terms of arising and ceasing, gratification, drawback, and escape.",
  "sn-blurbs:sn22.132": "Sāriputta explains to Mahākoṭṭhita that knowledge is understanding the aggregates in terms of arising and ceasing, gratification, drawback, and escape.",
  "sn-blurbs:sn22.133": "Mahākoṭṭhita explains to Sāriputta that ignorance is not understanding the aggregates in terms of gratification, drawback, and escape, while knowledge is understanding the aggregates.",
  "sn-blurbs:sn22.134": "Mahākoṭṭhita explains to Sāriputta that ignorance is not understanding the aggregates in terms of arising and ceasing, gratification, drawback, and escape, while knowledge is understanding the aggregates.",
  "sn-blurbs:sn22.135": "Mahākoṭṭhita explains to Sāriputta that ignorance is not understanding the aggregates in terms of the four noble truths, while knowledge is understanding the aggregates.",
  "sn-blurbs:sn22.136": "The aggregates are like hot coals.",
  "sn-blurbs:sn22.137": "Give up desire for what is impermanent, i.e. the aggregates.",
  "sn-blurbs:sn22.138": "Give up lust for what is impermanent, i.e. the aggregates.",
  "sn-blurbs:sn22.139": "Give up desire and lust for what is impermanent, i.e. the aggregates.",
  "sn-blurbs:sn22.140": "Give up desire for what is suffering, i.e. the aggregates.",
  "sn-blurbs:sn22.141": "Give up lust for what is suffering, i.e. the aggregates.",
  "sn-blurbs:sn22.142": "Give up desire and lust for what is suffering, i.e. the aggregates.",
  "sn-blurbs:sn22.143": "Give up desire for what is not-self, i.e. the aggregates.",
  "sn-blurbs:sn22.144": "Give up lust for what is not-self, i.e. the aggregates.",
  "sn-blurbs:sn22.145": "Give up desire and lust for what is not-self, i.e. the aggregates.",
  "sn-blurbs:sn22.146": "One gone forth should dwell full of disillusionment for the aggregates.",
  "sn-blurbs:sn22.147": "One gone forth should dwell contemplating impermanence in the aggregates.",
  "sn-blurbs:sn22.148": "One gone forth should dwell contemplating suffering in the aggregates.",
  "sn-blurbs:sn22.149": "One gone forth should dwell contemplating not-self in the aggregates.",
  "sn-blurbs:sn22.150": "Pleasure and pain arise inside oneself due to grasping the aggregates.",
  "sn-blurbs:sn22.151": "The ideas of “me’ and “mine” arise due to grasping the aggregates.",
  "sn-blurbs:sn22.152": "The idea that the self is identical with the cosmos arises due to grasping the aggregates.",
  "sn-blurbs:sn22.153": "Even subtle forms of self identification arise due to grasping the aggregates.",
  "sn-blurbs:sn22.154": "Wrong view arises due to grasping the aggregates.",
  "sn-blurbs:sn22.155": "Identity view arises due to grasping the aggregates.",
  "sn-blurbs:sn22.156": "View of self arises due to grasping the aggregates.",
  "sn-blurbs:sn22.157": "Fetters and shackles arise due to grasping the aggregates.",
  "sn-blurbs:sn22.158": "Fetters and holding arise due to grasping the aggregates.",
  "sn-blurbs:sn22.159": "When Ānanda wants to go on retreat, the Buddha advises him to contemplate the aggregates",
  "sn-blurbs:sn23.1": "Rādha asks the Buddha about Māra, and the Buddha explains in terms of the five aggregates. Seeing in this way leads to freedom.",
  "sn-blurbs:sn23.2": "Rādha asks the Buddha about a the term “sentient being”, and the Buddha explains in terms of craving for the five aggregates. He compares such craving to a child playing with sandcastles.",
  "sn-blurbs:sn23.3": "Rādha asks the Buddha about the tie or conduit to rebirth, and the Buddha explains in terms of craving for the five aggregates. ",
  "sn-blurbs:sn23.4": "The aggregates are to be fully understood, ending the defilements is the full understanding of them, and an arahant is the one who has achieved this.",
  "sn-blurbs:sn23.5": "Only a true ascetic fully understands the five aggregates.",
  "sn-blurbs:sn23.6": "Only a true ascetic fully understands the five aggregates.",
  "sn-blurbs:sn23.7": "One who truly understand these five aggregates is a stream-enterer.",
  "sn-blurbs:sn23.8": "One who truly understand these five aggregates and is freed from them is a perfected one.",
  "sn-blurbs:sn23.9": "Give up desire for the aggregates and they will come to an end.",
  "sn-blurbs:sn23.10": "Give up desire for the aggregates and they will come to an end.",
  "sn-blurbs:sn23.11": "Rādha asks the Buddha about Māra, and the Buddha explains in terms of the five aggregates.",
  "sn-blurbs:sn23.12": "Rādha asks the Buddha about being subject to Māra, and the Buddha explains in terms of the five aggregates.",
  "sn-blurbs:sn23.13": "Rādha asks the Buddha about impermanence, and the Buddha explains in terms of the five aggregates.",
  "sn-blurbs:sn23.14": "Rādha asks the Buddha about what is of impermanent nature, and the Buddha explains in terms of the five aggregates.",
  "sn-blurbs:sn23.15": "Rādha asks the Buddha about suffering, and the Buddha explains in terms of the five aggregates.",
  "sn-blurbs:sn23.16": "Rādha asks the Buddha about what is of painful nature, and the Buddha explains in terms of the five aggregates.",
  "sn-blurbs:sn23.17": "Rādha asks the Buddha about not-self, and the Buddha explains in terms of the five aggregates.",
  "sn-blurbs:sn23.18": "Rādha asks the Buddha about what is of selfless nature, and the Buddha explains in terms of the five aggregates.",
  "sn-blurbs:sn23.19": "Rādha asks the Buddha about what is liable to end, and the Buddha explains in terms of the five aggregates.",
  "sn-blurbs:sn23.20": "Rādha asks the Buddha about what is liable to vanish, and the Buddha explains in terms of the five aggregates.",
  "sn-blurbs:sn23.21": "Rādha asks the Buddha about what is liable to arise, and the Buddha explains in terms of the five aggregates.",
  "sn-blurbs:sn23.22": "Rādha asks the Buddha about what is liable to cease, and the Buddha explains in terms of the five aggregates.",
  "sn-blurbs:sn23.23-33": "Rādha asks the Buddha for a teaching before going on retreat, and the Buddha says that he should abandon desire, explaining in terms of the various teachings in SN 23.11–21.",
  "sn-blurbs:sn23.34": "Rādha asks the Buddha for a teaching before going on retreat, and the Buddha says that he should abandon desire, explaining what is liable to cease in terms of the five aggregates.",
  "sn-blurbs:sn23.35-45": "The Buddha tells Rādha that he should abandon desire, explaining in terms of the various teachings in SN 23.11–21.",
  "sn-blurbs:sn23.46": "The Buddha tells Rādha that he should abandon desire, explaining what is liable to cease in terms of the five aggregates.",
  "sn-blurbs:sn24.1": "The Buddha mentions a strange view to the effect that all changing phenomena of the world are really still and motionless. Such a view arises from grasping to the five aggregates. But by seeing the aggregates, as well as what is seen, heard, thought, and known, as impermanent, such a view is given up and one becomes a stream-enterer.",
  "sn-blurbs:sn24.2": "The view of me and mine is given up by seeing the aggregates, as well as what is seen, heard, thought, and known, as impermanent.",
  "sn-blurbs:sn24.3": "The view that the self is identical with the cosmos is given up by seeing the aggregates, as well as what is seen, heard, thought, and known, as impermanent.",
  "sn-blurbs:sn24.4": "The view that “I might not be” is given up by seeing the aggregates, as well as what is seen, heard, thought, and known, as impermanent.",
  "sn-blurbs:sn24.5": "The view of annihilationism is given up by seeing the aggregates, as well as what is seen, heard, thought, and known, as impermanent.",
  "sn-blurbs:sn24.6": "The view of moral nihilism is given up by seeing the aggregates, as well as what is seen, heard, thought, and known, as impermanent.",
  "sn-blurbs:sn24.7": "The view that denies causality is given up by seeing the aggregates, as well as what is seen, heard, thought, and known, as impermanent.",
  "sn-blurbs:sn24.8": "The view that transmigration is fixed is given up by seeing the aggregates, as well as what is seen, heard, thought, and known, as impermanent.",
  "sn-blurbs:sn24.9": "The view that the cosmos is eternal is given up by seeing the aggregates, as well as what is seen, heard, thought, and known, as impermanent.",
  "sn-blurbs:sn24.10": "The view that the cosmos is not eternal is given up by seeing the aggregates, as well as what is seen, heard, thought, and known, as impermanent.",
  "sn-blurbs:sn24.11": "The view that the cosmos is finite is given up by seeing the aggregates, as well as what is seen, heard, thought, and known, as impermanent.",
  "sn-blurbs:sn24.12": "The view that the cosmos is infinite is given up by seeing the aggregates, as well as what is seen, heard, thought, and known, as impermanent.",
  "sn-blurbs:sn24.13": "The view that the soul is the same thing as the body is given up by seeing the aggregates, as well as what is seen, heard, thought, and known, as impermanent.",
  "sn-blurbs:sn24.14": "The view that the soul and the body are different things is given up by seeing the aggregates, as well as what is seen, heard, thought, and known, as impermanent.",
  "sn-blurbs:sn24.15": "The view that the Realized One exists after death is given up by seeing the aggregates, as well as what is seen, heard, thought, and known, as impermanent.",
  "sn-blurbs:sn24.16": "The view that the Realized One does not exist after death is given up by seeing the aggregates, as well as what is seen, heard, thought, and known, as impermanent.",
  "sn-blurbs:sn24.17": "The view that the Realized One both exists and does not exist after death is given up by seeing the aggregates, as well as what is seen, heard, thought, and known, as impermanent.",
  "sn-blurbs:sn24.18": "The view that the Realized One neither exists nor does not exist after death is given up by seeing the aggregates, as well as what is seen, heard, thought, and known, as impermanent.",
  "sn-blurbs:sn24.19": "The Buddha mentions a strange view to the effect that all changing phenomena of the world are really still and motionless. Such a view arises from grasping to the five aggregates, which are suffering. But by seeing the aggregates as impermanent, such a view is given up.",
  "sn-blurbs:sn24.20-35": "The various views arise from grasping to the five aggregates, which are suffering. But by seeing the aggregates as impermanent, these views are given up.",
  "sn-blurbs:sn24.36": "The view that the Realized One neither exists nor does not exist after death arises from grasping to the five aggregates, which are suffering. But by seeing the aggregates as impermanent, this views is given up",
  "sn-blurbs:sn25.1": "One with faith in the teachings on the six interior sense fields is called a “follower by faith”, while someone with conceptual understanding is called a “follower of the teachings”. But someone who sees them directly is called a stream-enterer.",
  "sn-blurbs:sn25.2": "One with faith in the teachings on the six exterior sense fields is called a “follower by faith”, while someone with conceptual understanding is called a “follower of the teachings”. But someone who sees them directly is called a stream-enterer.",
  "sn-blurbs:sn25.3": "One with faith in the teachings on the six kinds of consciousness is called a “follower by faith”, while someone with conceptual understanding is called a “follower of the teachings”. But someone who sees them directly is called a stream-enterer.",
  "sn-blurbs:sn25.4": "One with faith in the teachings on the six kinds of contact is called a “follower by faith”, while someone with conceptual understanding is called a “follower of the teachings”. But someone who sees them directly is called a stream-enterer.",
  "sn-blurbs:sn25.5": "One with faith in the teachings on the six kinds of feeling is called a “follower by faith”, while someone with conceptual understanding is called a “follower of the teachings”. But someone who sees them directly is called a stream-enterer.",
  "sn-blurbs:sn25.6": "One with faith in the teachings on the six kinds of perception is called a “follower by faith”, while someone with conceptual understanding is called a “follower of the teachings”. But someone who sees them directly is called a stream-enterer.",
  "sn-blurbs:sn25.7": "One with faith in the teachings on the six kinds of intention is called a “follower by faith”, while someone with conceptual understanding is called a “follower of the teachings”. But someone who sees them directly is called a stream-enterer.",
  "sn-blurbs:sn25.8": "One with faith in the teachings on the six kinds of craving is called a “follower by faith”, while someone with conceptual understanding is called a “follower of the teachings”. But someone who sees them directly is called a stream-enterer.",
  "sn-blurbs:sn25.9": "One with faith in the teachings on the four physical elements is called a “follower by faith”, while someone with conceptual understanding is called a “follower of the teachings”. But someone who sees them directly is called a stream-enterer.",
  "sn-blurbs:sn25.10": "One with faith in the teachings on the five aggregates is called a “follower by faith”, while someone with conceptual understanding is called a “follower of the teachings”. But someone who sees them directly is called a stream-enterer",
  "sn-blurbs:sn26.1": "The arising of the six interior sense fields is the arising of suffering.",
  "sn-blurbs:sn26.2": "The arising of the six exterior sense fields is the arising of suffering.",
  "sn-blurbs:sn26.3": "The arising of the six kinds of consciousness is the arising of suffering.",
  "sn-blurbs:sn26.4": "The arising of the six kinds of contact is the arising of suffering.",
  "sn-blurbs:sn26.5": "The arising of the six kinds of feeling is the arising of suffering.",
  "sn-blurbs:sn26.6": "The arising of the six kinds of perception is the arising of suffering.",
  "sn-blurbs:sn26.7": "The arising of the six kinds of intention is the arising of suffering.",
  "sn-blurbs:sn26.8": "The arising of the six kinds of craving is the arising of suffering.",
  "sn-blurbs:sn26.9": "The arising of the four physical elements is the arising of suffering.",
  "sn-blurbs:sn26.10": "The arising of the five aggregates is the arising of suffering",
  "sn-blurbs:sn27.1": "Desire for six interior sense fields is a corruption of the mind, and letting go such desire one is able to realize the various kinds of direct knowledge.",
  "sn-blurbs:sn27.2": "Desire for six exterior sense fields is a corruption of the mind, and letting go such desire one is able to realize the various kinds of direct knowledge.",
  "sn-blurbs:sn27.3": "Desire for six kinds of consciousness is a corruption of the mind, and letting go such desire one is able to realize the various kinds of direct knowledge.",
  "sn-blurbs:sn27.4": "Desire for six kinds of contact is a corruption of the mind, and letting go such desire one is able to realize the various kinds of direct knowledge.",
  "sn-blurbs:sn27.5": "Desire for six kinds of feeling is a corruption of the mind, and letting go such desire one is able to realize the various kinds of direct knowledge.",
  "sn-blurbs:sn27.6": "Desire for six kinds of perception is a corruption of the mind, and letting go such desire one is able to realize the various kinds of direct knowledge.",
  "sn-blurbs:sn27.7": "Desire for six kinds of intention is a corruption of the mind, and letting go such desire one is able to realize the various kinds of direct knowledge.",
  "sn-blurbs:sn27.8": "Desire for six kinds of craving is a corruption of the mind, and letting go such desire one is able to realize the various kinds of direct knowledge.",
  "sn-blurbs:sn27.9": "Desire for four physical elements is a corruption of the mind, and letting go such desire one is able to realize the various kinds of direct knowledge.",
  "sn-blurbs:sn27.10": "Desire for five aggregates is a corruption of the mind, and letting go such desire one is able to realize the various kinds of direct knowledge",
  "sn-blurbs:sn28.1": "Sāriputta goes to Mirkwood for meditation, and afterwards Ānanda asks why his face is so radiant. Sāriputta replies that he was practicing first absorption without any thought of self.",
  "sn-blurbs:sn28.2": "Sāriputta goes to Mirkwood for meditation, and afterwards Ānanda asks why his face is so radiant. Sāriputta replies that he was practicing second absorption without any thought of self.",
  "sn-blurbs:sn28.3": "Sāriputta goes to Mirkwood for meditation, and afterwards Ānanda asks why his face is so radiant. Sāriputta replies that he was practicing third absorption without any thought of self.",
  "sn-blurbs:sn28.4": "Sāriputta goes to Mirkwood for meditation, and afterwards Ānanda asks why his face is so radiant. Sāriputta replies that he was practicing fourth absorption without any thought of self.",
  "sn-blurbs:sn28.5": "Sāriputta goes to Mirkwood for meditation, and afterwards Ānanda asks why his face is so radiant. Sāriputta replies that he was practicing the dimension of infinite space without any thought of self.",
  "sn-blurbs:sn28.6": "Sāriputta goes to Mirkwood for meditation, and afterwards Ānanda asks why his face is so radiant. Sāriputta replies that he was practicing the dimension of infinite consciousness without any thought of self.",
  "sn-blurbs:sn28.7": "Sāriputta goes to Mirkwood for meditation, and afterwards Ānanda asks why his face is so radiant. Sāriputta replies that he was practicing the dimension of nothingness without any thought of self.",
  "sn-blurbs:sn28.8": "Sāriputta goes to Mirkwood for meditation, and afterwards Ānanda asks why his face is so radiant. Sāriputta replies that he was practicing the dimension of neither perception nor non-perception without any thought of self.",
  "sn-blurbs:sn28.9": "Sāriputta goes to Mirkwood for meditation, and afterwards Ānanda asks why his face is so radiant. Sāriputta replies that he was practicing the attainment of cessation without any thought of self.",
  "sn-blurbs:sn28.10": "Sāriputta encountered a female wanderer named Sucimukhī, who asks him a series of enigmatic questions regarding what direction he faces when eating. Sāriputta denies all of them, explaining that they are various kinds of wrong livelihood.",
  "sn-blurbs:sn29.1": "Dragons may be born from eggs, the womb, moisture, or spontaneously.",
  "sn-blurbs:sn29.2": "Dragons may be born from eggs, the womb, moisture, or spontaneously. Those born spontaneously are the best.",
  "sn-blurbs:sn29.3": "Egg born dragons sometimes transform their bodies and observe the sabbath in order to get a good rebirth.",
  "sn-blurbs:sn29.4": "Womb born dragons sometimes transform their bodies and observe the sabbath in order to get a good rebirth.",
  "sn-blurbs:sn29.5": "Moisture born dragons sometimes transform their bodies and observe the sabbath in order to get a good rebirth.",
  "sn-blurbs:sn29.6": "Spontaneously born dragons sometimes transform their bodies and observe the sabbath in order to get a good rebirth.",
  "sn-blurbs:sn29.7": "One becomes an egg born dragon due to ambivalent deeds in a past life and the appropriate aspiration.",
  "sn-blurbs:sn29.8": "One becomes a womb born dragon due to ambivalent deeds in a past life and the appropriate aspiration.",
  "sn-blurbs:sn29.9": "One becomes a moisture dragon due to ambivalent deeds in a past life and the appropriate aspiration.",
  "sn-blurbs:sn29.10": "One becomes a spontaneously born dragon due to ambivalent deeds in a past life and the appropriate aspiration.",
  "sn-blurbs:sn29.11-20": "One becomes an egg born dragon due to ambivalent deeds in a past life, the appropriate aspiration, and giving various gifts.",
  "sn-blurbs:sn29.21-50": "One becomes a womb born, moisture born, or spontaneously born dragon due to ambivalent deeds in a past life, the appropriate aspiration, and giving various gifts",
  "sn-blurbs:sn30.1": "Phoenixes may be born from eggs, the womb, moisture, or spontaneously.",
  "sn-blurbs:sn30.2": "Phoenixes may be born from eggs, the womb, moisture, or spontaneously. Each of them may carry off a dragon of lower birth.",
  "sn-blurbs:sn30.3": "One becomes an egg born phoenix due to ambivalent deeds in a past life and the appropriate aspiration.",
  "sn-blurbs:sn30.4-6": "One becomes a womb born, moisture born, or spontaneously born phoenix due to ambivalent deeds in a past life and the appropriate aspiration.",
  "sn-blurbs:sn30.7-16": "One becomes an egg born phoenix due to ambivalent deeds in a past life, the appropriate aspiration, and giving various gifts.",
  "sn-blurbs:sn30.17-46": "One becomes a womb born, moisture born, or spontaneously born phoenix due to ambivalent deeds in a past life, the appropriate aspiration, and giving various gifts",
  "sn-blurbs:sn31.1": "Fairies may live in fragrant roots and other vegetation.",
  "sn-blurbs:sn31.2": "Someone of good conduct and appropriate aspiration may be reborn as a fairy.",
  "sn-blurbs:sn31.3": "Someone of good conduct and appropriate aspiration may be reborn as a fairy living in fragrant roots if they give fragrant roots.",
  "sn-blurbs:sn31.4-12": "Someone of good conduct and appropriate aspiration may be reborn as a fairy living in various kinds of vegetation if they give the gift of that kind of vegetation.",
  "sn-blurbs:sn31.13-22": "Someone of good conduct and appropriate aspiration may be reborn as a fairy living in fragrant roots if they give various gifts.",
  "sn-blurbs:sn31.23-112": "Someone of good conduct and appropriate aspiration may be reborn as a fairy living in various kinds of vegetation if they give various gifts",
  "sn-blurbs:sn32.1": "Cloud gods may live in cool clouds, warm clouds, storm clouds, wind clouds, or rain clouds.",
  "sn-blurbs:sn32.2": "Someone of good conduct and appropriate aspiration may be reborn as a cloud god.",
  "sn-blurbs:sn32.3-12": "Someone of good conduct and appropriate aspiration may be reborn as a cloud god in a cool cloud if they give various gifts.",
  "sn-blurbs:sn32.13-52": "Someone of good conduct and appropriate aspiration may be reborn as a cloud god living in various kinds of cloud if they give various gifts.",
  "sn-blurbs:sn32.53": "When the cool cloud gods decide to revel in their own element, the weather becomes cool.",
  "sn-blurbs:sn32.54": "When the warm cloud gods decide to revel in their own element, the weather becomes warm.",
  "sn-blurbs:sn32.55": "When the storm cloud gods decide to revel in their own element, the weather becomes stormy.",
  "sn-blurbs:sn32.56": "When the wind cloud gods decide to revel in their own element, the weather becomes windy.",
  "sn-blurbs:sn32.57": "When the rain cloud gods decide to revel in their own element, the weather becomes rainy",
  "sn-blurbs:sn33.1": "The wanderer Vacchagotta asks the Buddha why the various speculative views come to be. The Buddha replies that it is because of not knowing form.",
  "sn-blurbs:sn33.2": "The wanderer Vacchagotta asks the Buddha why the various speculative views come to be. The Buddha replies that it is because of not knowing feeling.",
  "sn-blurbs:sn33.3": "The wanderer Vacchagotta asks the Buddha why the various speculative views come to be. The Buddha replies that it is because of not knowing perception.",
  "sn-blurbs:sn33.4": "The wanderer Vacchagotta asks the Buddha why the various speculative views come to be. The Buddha replies that it is because of not knowing choices.",
  "sn-blurbs:sn33.5": "The wanderer Vacchagotta asks the Buddha why the various speculative views come to be. The Buddha replies that it is because of not knowing consciousness.",
  "sn-blurbs:sn33.6-10": "The wanderer Vacchagotta asks the Buddha why the various speculative views come to be. The Buddha replies that it is because of not seeing the five aggregates.",
  "sn-blurbs:sn33.11-15": "The wanderer Vacchagotta asks the Buddha why the various speculative views come to be. The Buddha replies that it is because of not breaking through to the five aggregates.",
  "sn-blurbs:sn33.16-20": "The wanderer Vacchagotta asks the Buddha why the various speculative views come to be. The Buddha replies that it is because of not comprehending the five aggregates.",
  "sn-blurbs:sn33.21-25": "The wanderer Vacchagotta asks the Buddha why the various speculative views come to be. The Buddha replies that it is because of not penetrating the five aggregates.",
  "sn-blurbs:sn33.26-30": "The wanderer Vacchagotta asks the Buddha why the various speculative views come to be. The Buddha replies that it is because of not discerning the five aggregates.",
  "sn-blurbs:sn33.31-35": "The wanderer Vacchagotta asks the Buddha why the various speculative views come to be. The Buddha replies that it is because of not discriminating the five aggregates.",
  "sn-blurbs:sn33.36-40": "The wanderer Vacchagotta asks the Buddha why the various speculative views come to be. The Buddha replies that it is because of not differntiating the five aggregates.",
  "sn-blurbs:sn33.41-45": "The wanderer Vacchagotta asks the Buddha why the various speculative views come to be. The Buddha replies that it is because of not examining the five aggregates.",
  "sn-blurbs:sn33.46-50": "The wanderer Vacchagotta asks the Buddha why the various speculative views come to be. The Buddha replies that it is because of not closely examining the five aggregates.",
  "sn-blurbs:sn33.51-55": "The wanderer Vacchagotta asks the Buddha why the various speculative views come to be. The Buddha replies that it is because of not directly cognizing the five aggregates",
  "sn-blurbs:sn35.1": "The six interior sense fields are impermanent, suffering, and not-self. When a noble disciple truly sees them like this, they become disillusioned and liberated.",
  "sn-blurbs:sn35.2": "The six interior sense fields are suffering and not-self. When a noble disciple truly sees them like this, they become disillusioned and liberated.",
  "sn-blurbs:sn35.3": "The six interior sense fields are not-self. When a noble disciple truly sees them like this, they become disillusioned and liberated.",
  "sn-blurbs:sn35.4": "The six exterior sense fields are impermanent, suffering, and not-self. When a noble disciple truly sees them like this, they become disillusioned and liberated.",
  "sn-blurbs:sn35.5": "The six exterior sense fields are suffering and not-self. When a noble disciple truly sees them like this, they become disillusioned and liberated.",
  "sn-blurbs:sn35.6": "The six exterior sense fields are not-self. When a noble disciple truly sees them like this, they become disillusioned and liberated.",
  "sn-blurbs:sn35.7": "In the past, future, and present, the six interior sense fields are impermanent, suffering, and not-self. When a noble disciple truly sees them like this, they become disillusioned and liberated.",
  "sn-blurbs:sn35.8": "In the past, future, and present, the six interior sense fields are suffering and not-self. When a noble disciple truly sees them like this, they become disillusioned and liberated.",
  "sn-blurbs:sn35.9": "In the past, future, and present, the six interior sense fields are not-self. When a noble disciple truly sees them like this, they become disillusioned and liberated.",
  "sn-blurbs:sn35.10": "In the past, future, and present, the six exterior sense fields are impermanent, suffering, and not-self. When a noble disciple truly sees them like this, they become disillusioned and liberated.",
  "sn-blurbs:sn35.11": "In the past, future, and present, the six exterior sense fields are suffering and not-self. When a noble disciple truly sees them like this, they become disillusioned and liberated.",
  "sn-blurbs:sn35.12": "In the past, future, and present, the six exterior sense fields are not-self. When a noble disciple truly sees them like this, they become disillusioned and liberated.",
  "sn-blurbs:sn35.13": "The Buddha did not claim to be awakened until he had fully understood the gratification, drawback, and escape regarding the six interior sense fields.",
  "sn-blurbs:sn35.14": "The Buddha did not claim to be awakened until he had fully understood the gratification, drawback, and escape regarding the six exterior sense fields.",
  "sn-blurbs:sn35.15": "The Buddha set out to find the gratification, drawback, and escape regarding the six interior sense fields.",
  "sn-blurbs:sn35.16": "The Buddha set out to find the gratification, drawback, and escape regarding the six exterior sense fields.",
  "sn-blurbs:sn35.17": "Beings are attached to the six interior sense fields due to gratification, repelled due to drawbacks, and find escape because there is an escape.",
  "sn-blurbs:sn35.18": "Beings are attached to the six exterior sense fields due to gratification, repelled due to drawbacks, and find escape because there is an escape.",
  "sn-blurbs:sn35.19": "If you enjoy the six interior sense fields, you enjoy suffering.",
  "sn-blurbs:sn35.20": "If you enjoy the six exterior sense fields, you enjoy suffering.",
  "sn-blurbs:sn35.21": "The arising of the six interior sense fields is the arising of suffering.",
  "sn-blurbs:sn35.22": "The arising of the six exterior sense fields is the arising of suffering.",
  "sn-blurbs:sn35.23": "The “all” consists of the six interior and exterior sense fields.",
  "sn-blurbs:sn35.24": "The “all” consisting of the six interior and exterior sense fields should be given up.",
  "sn-blurbs:sn35.25": "The “all” consisting of the six interior and exterior sense fields should be given up by understanding.",
  "sn-blurbs:sn35.26": "Without understanding the “all” consisting of the six interior and exterior sense fields and becoming dispassionate towards it, it is impossible to be free of suffering.",
  "sn-blurbs:sn35.27": "Without understanding the “all” consisting of the six interior and exterior sense fields and the associated consciousness and becoming dispassionate towards it, it is impossible to be free of suffering.",
  "sn-blurbs:sn35.28": "The “all” consisting of the six interior and exterior sense fields is burning. This is the famous “third sermon” taught at Gayā’s Head to the followers of the three Kassapa brothers.",
  "sn-blurbs:sn35.29": "The “all” consisting of the six interior and exterior sense fields, and the phenomena they condition, is weighed down.",
  "sn-blurbs:sn35.30": "The way to uproot all conceivings is to not conceive in relation to the six sense fields.",
  "sn-blurbs:sn35.31": "The way to uproot all conceivings is to not conceive in relation to the six sense fields.",
  "sn-blurbs:sn35.32": "The way to uproot all conceivings is to investigate the six sense fields as impermanent, etc.",
  "sn-blurbs:sn35.33-42": "The “all” consisting of the six interior and exterior sense fields is liable to be reborn, to age, etc.",
  "sn-blurbs:sn35.43-51": "The “all” consisting of the six interior and exterior sense fields is impermanent, etc.",
  "sn-blurbs:sn35.52": "The “all” consisting of the six interior and exterior sense fields is afflicted.",
  "sn-blurbs:sn35.53": "A mendicant asks the Buddha how to see so as to give up ignorance. The Buddha says one should see the six interior and exterior sense fields as impermanent.",
  "sn-blurbs:sn35.54": "A mendicant asks the Buddha how to see so as to give up the fetters. The Buddha says one should see the six interior and exterior sense fields as impermanent.",
  "sn-blurbs:sn35.55": "A mendicant asks the Buddha how to see so as to uproot the fetters. The Buddha says one should see the six interior and exterior sense fields as not-self.",
  "sn-blurbs:sn35.56": "A mendicant asks the Buddha how to see so as to give up the defilements. The Buddha says one should see the six interior and exterior sense fields as impermanent.",
  "sn-blurbs:sn35.57": "A mendicant asks the Buddha how to see so as to uproot the defilements. The Buddha says one should see the six interior and exterior sense fields as not-self.",
  "sn-blurbs:sn35.58": "A mendicant asks the Buddha how to see so as to give up the underlying tendencies. The Buddha says one should see the six interior and exterior sense fields as impermanent.",
  "sn-blurbs:sn35.59": "A mendicant asks the Buddha how to see so as to uproot the underlying tendencies. The Buddha says one should see the six interior and exterior sense fields as not-self.",
  "sn-blurbs:sn35.60": "To fully understand grasping, see how sense experience gives rise to feeling.",
  "sn-blurbs:sn35.61": "To end grasping, see how sense experience gives rise to feeling.",
  "sn-blurbs:sn35.62": "To end grasping, investigate the six sense fields as impermanent, etc.",
  "sn-blurbs:sn35.63": "Venerable Migajāla asks how one lives alone, and how with a partner. The Buddha says that so long as one is bound by desire to the senses, one lives with a partner. A mendicant free of such desire dwells alone, even if they live in close association with worldly people.",
  "sn-blurbs:sn35.64": "Venerable Migajāla asks for a teaching to take on retreat. The Buddha teaches him that the senses are delightful, but if you hold to them you will suffer. Meditating on this while on retreat, Migajāla became awakened.",
  "sn-blurbs:sn35.65": "Venerable Samiddhi asks the Buddha what Māra is. The Buddha says that Māra is present so long as the senses exist.",
  "sn-blurbs:sn35.66": "Venerable Samiddhi asks the Buddha what a “sentient being” is. The Buddha says that a sentient being is present so long as the senses exist.",
  "sn-blurbs:sn35.67": "Venerable Samiddhi asks the Buddha what suffering is. The Buddha says that suffering is present so long as the senses exist.",
  "sn-blurbs:sn35.68": "Venerable Samiddhi asks the Buddha what the world is. The Buddha says that the world is present so long as the senses exist.",
  "sn-blurbs:sn35.69": "A viper bit Venerable Upasena, but he remained poised, declaring that he had no identification with the six senses.",
  "sn-blurbs:sn35.70": "The teaching that can be realized in this very life is the desire for the senses, and letting go of that desire.",
  "sn-blurbs:sn35.71": "One who does not understand the six senses’ origin, ending, gratification, drawback, and escape is no true mendicant. A mendicant speaks up, saying that he does not truly understand these things, so the Buddha teaches him further.",
  "sn-blurbs:sn35.72": "One who does not understand the six senses’ origin, ending, gratification, drawback, and escape is no true mendicant. A mendicant speaks up, saying that he does not truly understand these things, so the Buddha teaches him further.",
  "sn-blurbs:sn35.73": "One who does not understand the six senses’ origin, ending, gratification, drawback, and escape is no true mendicant. A mendicant speaks up, saying that he does not truly understand these things, so the Buddha teaches him further.",
  "sn-blurbs:sn35.74": "Hearing that a newly-ordained mendicant was sick, the Buddha visited him to offer support and Dhamma encouragement.",
  "sn-blurbs:sn35.75": "Hearing that a newly-ordained mendicant was sick, the Buddha visited him to offer support and Dhamma encouragement.",
  "sn-blurbs:sn35.76": "Venerable Rādha asks for a teaching to take on retreat. The Buddha told him to abandon desire for sense experience, which is impermanent.",
  "sn-blurbs:sn35.77": "Venerable Rādha asks for a teaching to take on retreat. The Buddha told him to abandon desire for sense experience, which is suffering.",
  "sn-blurbs:sn35.78": "Venerable Rādha asks for a teaching to take on retreat. The Buddha told him to abandon desire for sense experience, which is not-self.",
  "sn-blurbs:sn35.79": "Through giving up ignorance, knowledge arises. To do this, contemplate the six senses as impermanent.",
  "sn-blurbs:sn35.80": "Through giving up ignorance, knowledge arises. To do this, contemplate the six senses as impermanent. Then a mendicant truly understands, and sees everything differently.",
  "sn-blurbs:sn35.81": "Some mendicants check with the Buddha that it’s correct to say that the spiritual life is lived to end suffering. The Buddha answers that it is, and explains what that suffering is: the process of sense experience.",
  "sn-blurbs:sn35.82": "The “world” consisting of six sense experience is said to be falling apart.",
  "sn-blurbs:sn35.83": "The Buddhas of the past cannot be described in terms of the six senses.",
  "sn-blurbs:sn35.84": "The Buddha tells Ānanda that in the training of the noble one the “world” consisting of six sense experience is liable to wear out.",
  "sn-blurbs:sn35.85": "The Buddha tells Ānanda that the “world” consisting of six sense experience is empty because it is empty of self and what belongs to self.",
  "sn-blurbs:sn35.86": "Ānanda asks for a teaching to take on retreat. The Buddha teaches him that the senses are impermanent, etc.",
  "sn-blurbs:sn35.87": "Sāriputta and Mahācunda visit Channa, who is ill. Channa says that he lacks for no care, but is in such great pain that he wishes to take his own life, insisting that he will do so blamelessly. Sāriputta tries to dissuade him, and questions him closely about attachment to the six senses. Later Channa does take his own life, and the Buddha confirmed that, despite Sāriputta’s doubts, he was indeed blameless.",
  "sn-blurbs:sn35.88": "Venerable Puṇṇa goes to the Buddha and asks for a teaching before he departs to the foreign land of Sunāparanta. The Buddha warns him that folk there are fierce, and questions whether he is ready for such a difficult assignment.",
  "sn-blurbs:sn35.89": "Venerable Bāhiya asks for a teaching to take on retreat. The Buddha teaches him that the senses are impermanent, etc.",
  "sn-blurbs:sn35.90": "Being stirred by craving is painful, so the Realized One lives unstirred, not identifying with any aspect of sense experience.",
  "sn-blurbs:sn35.91": "Being stirred by craving is painful, so the Realized One lives unstirred, not identifying with any aspect of sense experience, or indeed, with the entire scope of the aggregates, elements, and senses.",
  "sn-blurbs:sn35.92": "The dyad is the interior sense organ with its corresponding exterior sense stimulus.",
  "sn-blurbs:sn35.93": "Consciousness arises from the dyad of the interior sense organ with its corresponding exterior sense stimulus. All these things are conditioned, impermanent, and constantly falling apart.",
  "sn-blurbs:sn35.94": "The six fields of contact lead to suffering if left unguarded, but if guarded lead to happiness. A lengthy set of verses illustrate this.",
  "sn-blurbs:sn35.95": "Venerable Māluṅkyaputta asks for a teaching to take on retreat. The Buddha wonders how to teach an old monk like him, then questions him on his desire for sense experience that has been or might be, and encourages him to simply let sense experience be. Māluṅkyaputta says he understands, and expands the Buddha’s teaching in a series of verses.",
  "sn-blurbs:sn35.96": "When a mendicant tolerates evil thoughts that arise from the senses, they are liable to decline. If they don’t tolerate them, they’re not liable to decline. When such thoughts not longer arise, they have mastered the senses.",
  "sn-blurbs:sn35.97": "When a mendicant lives without restraint regarding the senses, they are negligent. If they have restraint, they are diligent.",
  "sn-blurbs:sn35.98": "Non-restraint is delighting in the senses, restraint is not delighting in them.",
  "sn-blurbs:sn35.99": "Develop meditative immersion so as to truly understand the process of sense experience.",
  "sn-blurbs:sn35.100": "Develop seclusion so as to truly understand the process of sense experience.",
  "sn-blurbs:sn35.101": "Let go of what is not yours: the process of sense experience. You wouldn’t be upset if someone took the grass and sticks from the monastery grounds, so why worry over the aggregates?",
  "sn-blurbs:sn35.102": "Let go of what is not yours: the process of sense experience.",
  "sn-blurbs:sn35.103": "The Buddha’s former teacher Uddaka Rāmaputta claimed to be a knowledge master, a universal victor, who had excised the tumor. But a true knowledge master understands the senses, a victor is freed from them, and excising the tumor is being free from attachment to the body.",
  "sn-blurbs:sn35.104": "Someone who has given up attraction to the senses has arrived at the sanctuary.",
  "sn-blurbs:sn35.105": "Pleasure and pain arise inside oneself due to grasping the senses.",
  "sn-blurbs:sn35.106": "The origin and ending of suffering are explained in terms of sense experience giving rise to craving.",
  "sn-blurbs:sn35.107": "The origin and ending of the world are explained in terms of sense experience giving rise to craving and suffering.",
  "sn-blurbs:sn35.108": "Conceit stems from clinging to the senses.",
  "sn-blurbs:sn35.109": "The interior sense fields are the things that fetter, the craving is the fetter.",
  "sn-blurbs:sn35.110": "The interior sense fields are the things that are graspable, the craving is the grasping.",
  "sn-blurbs:sn35.111": "Without understanding the six interior sense fields and becoming dispassionate towards them, it is impossible to be free of suffering.",
  "sn-blurbs:sn35.112": "Without understanding the six exterior sense fields and becoming dispassionate towards them, it is impossible to be free of suffering.",
  "sn-blurbs:sn35.113": "While on retreat, the Buddha exclaims how the origin and ending of the world are explained in terms of sense experience giving rise to craving and suffering. A mendicant overhears him, and the Buddha urges him to remember that teaching.",
  "sn-blurbs:sn35.114": "A mendicant who craves the senses is under the sway of Māra.",
  "sn-blurbs:sn35.115": "A mendicant who craves the senses is under the sway of Māra.",
  "sn-blurbs:sn35.116": "The Buddha states that the end of the world cannot be reached by traveling, yet it is impossible to end suffering without reaching the end of the world. The mendicants ask Ānanda to explain this enigmatic statement.",
  "sn-blurbs:sn35.117": "While practicing for awakening, the Buddha reflected that he should be diligent when his mind strayed to sense pleasures of the past, future, or present. He urges the mendicants to realize that place where the senses completely cease, and they ask Ānanda to explain this to them.",
  "sn-blurbs:sn35.118": "Sakka asks the Buddha why some become awakened in this very life, while others do not.",
  "sn-blurbs:sn35.119": "The fairy Pañcasikha asks the Buddha why some become awakened in this very life, while others do not.",
  "sn-blurbs:sn35.120": "A mendicant informs Sāriputta that one of his friends had disrobed. Sāriputta attributes this to lack of sense restraint, eating too much, and not being wakeful.",
  "sn-blurbs:sn35.121": "Realizing that his son Rāhula was ripe for awakening, the Buddha takes him for a personal teaching. He questions Rāhula on the impermanence of all the factors of sense experience, leading Rāhula to realize full freedom.",
  "sn-blurbs:sn35.122": "The exterior sense fields are the things that fetter, the craving is the fetter.",
  "sn-blurbs:sn35.123": "The exterior sense fields are the things that are graspable, the craving is the grasping.",
  "sn-blurbs:sn35.124": "At the Great Wood, the householder Ugga of Vesālī asks the Buddha why some become awakened in this very life, while others do not.",
  "sn-blurbs:sn35.125": "At Hatthigāma, the householder Ugga of Hatthigāma asks the Buddha why some become awakened in this very life, while others do not.",
  "sn-blurbs:sn35.126": "At Nālandā, the householder Upāli asks the Buddha why some become awakened in this very life, while others do not.",
  "sn-blurbs:sn35.127": "King Udena of Kosambi asks Venerable Piṇḍola Bhāradvāja how even young monks can maintain the celibate life. Piṇḍola says it’s because they see women as their sisters, mothers, or daughters. If this doesn’t work, they meditate on the ugliness of the body. Finally they exercise sense restraint.",
  "sn-blurbs:sn35.128": "At Rājagaha, the householder Soṇa asks the Buddha why some become awakened in this very life, while others do not.",
  "sn-blurbs:sn35.129": "The householder Ghosita asks Ānanda about the diversity of elements, and he answers in terms of the elements of sense experience.",
  "sn-blurbs:sn35.130": "The householder Hāliddakāni asks Mahākaccāna about the relation between the diversity of elements and the diversity of contacts, and he answers in terms of the elements of sense experience.",
  "sn-blurbs:sn35.131": "At Suṁsumāragira, the householder Nakulapitā asks the Buddha why some become awakened in this very life, while others do not.",
  "sn-blurbs:sn35.132": "Students of the brahmin Lohicca make a racket while collecting firewood near Mahākaccāna’s hut. Mahākaccāna hushes them and recites a series of verses contrasting the virtuous brahmins of old with those of today. Taking umbrage, they tell Lohicca, who goes to Mahākaccāna to ascertain the truth. But when Lohicca hears what Mahākaccāna teach on the six senses, he is so impressed he goes for refuge.",
  "sn-blurbs:sn35.133": "A student of the brahmin lady of the Verahaccāni clan recommends to her the teaching of Venerable Udāyı̄, so she invites him for a meal. But when she displays a conceited attitude, he leaves without teaching. However, she corrects herself so he teaches her that pleasure and pain depend on the senses.",
  "sn-blurbs:sn35.134": "Not all mendicants have completed their work with regards to the six senses, but some of them have.",
  "sn-blurbs:sn35.135": "The Buddha speaks of the hell named the “six senses” where all one experiences is sheer pain and unpleasantness.",
  "sn-blurbs:sn35.136": "Gods and humans take delight in the six sense, but the Realized One does not. This teaching is illustrated with a long series of verses.",
  "sn-blurbs:sn35.137": "Gods and humans take delight in the six sense, but the Realized One does not.",
  "sn-blurbs:sn35.138": "Let go of what is not yours: the six interior sense fields. You wouldn’t be upset if someone took the grass and sticks from the monastery grounds, so why worry over the senses?",
  "sn-blurbs:sn35.139": "Let go of what is not yours: the six exterior sense fields. You wouldn’t be upset if someone took the grass and sticks from the monastery grounds, so why worry over the senses?",
  "sn-blurbs:sn35.140": "Since the causes of the six interior sense fields are impermanent, how can the senses be permanent?",
  "sn-blurbs:sn35.141": "Since the causes of the six interior sense fields are suffering, how can the senses be free of suffering?",
  "sn-blurbs:sn35.142": "Since the causes of the six interior sense fields are not-self, how can the senses be self?",
  "sn-blurbs:sn35.143": "Since the causes of the six exterior sense fields are impermanent, how can the senses be permanent?",
  "sn-blurbs:sn35.144": "Since the causes of the six exterior sense fields are suffering, how can the senses be free of suffering?",
  "sn-blurbs:sn35.145": "Since the causes of the six exterior sense fields are not-self, how can the senses be self?",
  "sn-blurbs:sn35.146": "The six interior sense fields are not yours, but are old kamma, generated by choices in past lives. This is explained in terms of the four noble truths.",
  "sn-blurbs:sn35.147": "The way suitable for realizing extinguishment is to contemplate the process of sense experience as impermanent.",
  "sn-blurbs:sn35.148": "The way suitable for realizing extinguishment is to contemplate the process of sense experience as suffering.",
  "sn-blurbs:sn35.149": "The way suitable for realizing extinguishment is to contemplate the process of sense experience as not-self.",
  "sn-blurbs:sn35.150": "The way suitable for realizing extinguishment is to contemplate the process of sense experience as impermanent, suffering, and not-self.",
  "sn-blurbs:sn35.151": "One with no “student” and no “teacher” dwells in happiness. Here the Buddha plays with the Pali words such that “student” means “one who dwells within” and “teacher” means “one who assails”.",
  "sn-blurbs:sn35.152": "If anyone asks why we live the holy life, it is for the ending of suffering.",
  "sn-blurbs:sn35.153": "How is it that a mendicant can declare their awakening? By understanding whether any desire arises from sense stimuli.",
  "sn-blurbs:sn35.154": "One is accomplished in the sense faculties by being freed from attachment to them.",
  "sn-blurbs:sn35.155": "A speaker on the Dhamma is someone who teaches for letting go of the senses.",
  "sn-blurbs:sn35.156": "Right view is seeing the interior sense fields as they are, impermanent, and this leads to freedom.",
  "sn-blurbs:sn35.157": "Right view is seeing the exterior sense fields as they are, impermanent, and this leads to freedom.",
  "sn-blurbs:sn35.158": "Focusing properly on the interior sense fields you see them as they are and become free.",
  "sn-blurbs:sn35.159": "Focusing properly on the exterior sense fields you see them as they are and become free.",
  "sn-blurbs:sn35.160": "A mendicant should develop immersion (samādhi) in order to truly understand the origin and ending of the process of sense experience.",
  "sn-blurbs:sn35.161": "A mendicant should make an effort in seclusion in order to truly understand the origin and ending of the process of sense experience.",
  "sn-blurbs:sn35.162": "Mahākoṭṭhita asks for a teaching to take on retreat. The Buddha says to give up desire for what is impermanent, i.e. the process of sense experience.",
  "sn-blurbs:sn35.163": "Mahākoṭṭhita asks for a teaching to take on retreat. The Buddha says to give up desire for what is suffering, i.e. the process of sense experience.",
  "sn-blurbs:sn35.164": "Mahākoṭṭhita asks for a teaching to take on retreat. The Buddha says to give up desire for what is not-self, i.e. the process of sense experience.",
  "sn-blurbs:sn35.165": "Wrong view arises due to grasping the process of sense experience.",
  "sn-blurbs:sn35.166": "Identity view arises due to grasping the process of sense experience.",
  "sn-blurbs:sn35.167": "View of self arises due to grasping the process of sense experience.",
  "sn-blurbs:sn35.228": "In the Buddha’s teaching the “ocean” is the sense organs, the current is the sense objects.",
  "sn-blurbs:sn35.229": "In the Buddha’s teaching the “ocean” is the delights of sense stimuli.",
  "sn-blurbs:sn35.230": "Sense pleasures are like a baited hook.",
  "sn-blurbs:sn35.231": "Like a tree that yields sap when cut, so long as desire is present it will be activated by the senses.",
  "sn-blurbs:sn35.232": "Mahākoṭṭhita asks Sāriputta whether the interior and exterior sense fields are the fetters of each other. No; it is desire that is the fetter, like the yoke that binds two oxen. One with no desire still experiences the senses but without fetters.",
  "sn-blurbs:sn35.233": "Kāmabhū asks Ānanda whether the interior and exterior sense fields are the fetters of each other. No; it is desire that is the fetter. One with no desire still experiences the senses but without fetters.",
  "sn-blurbs:sn35.234": "Udāyı̄ notes to Ānanda that the Buddha has taught the body as not-self; what then of consciousness? Ānanda then explains how consciousness arises dependent on conditions.",
  "sn-blurbs:sn35.235": "It would be better for the sense organs to be pierced with red-hot spikes than to get attached to a pleasant sense experience.",
  "sn-blurbs:sn35.236": "So long as this body exists there is suffering due to the senses.",
  "sn-blurbs:sn35.237": "So long as this body exists there is suffering due to the senses.",
  "sn-blurbs:sn35.238": "The Buddha strings a series of powerful similes—vipers, murderers, an empty village, and more—into an extended parable of the dangers of existence and the way of escape.",
  "sn-blurbs:sn35.239": "When a mendicant has three qualities they live happily: sense restraint, moderation in eating, and wakefulness.",
  "sn-blurbs:sn35.240": "A parable of a jackal who fails to eat a tortoise who stays still, with limbs retracted, like a mendicant guarding the senses.",
  "sn-blurbs:sn35.241": "The Buddha gives a parable of a large log floating downstream, which, if it steers clear of the many obstacles, will eventually reach the ocean. A mendicant asks for an explanation, and the Buddha clarifies each item. A cowherd named Nanda was listening, and determined to go forth.",
  "sn-blurbs:sn35.242": "The Buddha gives a parable of a large log floating downstream, which, if it steers clear of the many obstacles, will eventually reach the ocean. Venerable Kimbila asks for an explanation, and the Buddha clarifies each item.",
  "sn-blurbs:sn35.243": "The Buddha is invited to teach in a new hall in Kapilavatthu. Late at night, after teaching the Sakyans, the Buddha invites Moggallāna to teach. He speaks on the mental corruption that flows from attachment to the senses. ",
  "sn-blurbs:sn35.244": "The Buddha defines the things that entail suffering as the five aggregates, and urges mendicants to be free of desire for the six senses, giving a series of vivid similes. He then speaks of how even for a mendicant practicing restraint a lapse of mindfulness might occur from time to time.",
  "sn-blurbs:sn35.245": "A mendicant goes to a series of teachers and asks how vision is purified. Dissatisfied with all their answers, he complains to the Buddha, who illustrates his quandary with the famous simile of the Kiṁsuka tree. Just as the same Kiṁsuka tree might be described differently by people focusing on the leaves, or the fruit, or the bark, etc., so too the various teachers each speak of the aspect of Dhamma most meaningful to them. ",
  "sn-blurbs:sn35.246": "One should restrain the senses like a farmer watching over a field. The Buddha gives the parable of a man bewitched when he first hears a lute. He takes apart the instrument in search of the sound, but is disillusioned when no sound is found.",
  "sn-blurbs:sn35.247": "The senses are like a snake, a crocodile, a bird, a dog, a jackal, and a monkey all tied up together, pulling this way and that. Mindfulness is like a post that keeps them grounded.",
  "sn-blurbs:sn35.248": "The six senses are like a sheaf of barley struck with six flails; and the desire for rebirth is a seventh flail. The Buddha goes on to speak of the cunning trap of the gods; but the trap of Māra, conceit, is even more subtle.",
  "sn-blurbs:sn36.1": "There are three feelings, and a meditator practicing immersion can understand them.",
  "sn-blurbs:sn36.2": "There are three feelings, and all of them are suffering.",
  "sn-blurbs:sn36.3": "One should give up desire for pleasant feeling, aversion for painful feeling, and ignorance regarding neutral feeling.",
  "sn-blurbs:sn36.4": "Ordinary people think the ocean is a bottomless abyss; but really, it is the three feelings.",
  "sn-blurbs:sn36.5": "See pleasant feeling as painful, painful feeling as a dart, and neutral feeling as impermanent.",
  "sn-blurbs:sn36.6": "Both ordinary and awakened people experience the three feelings. The difference is that when an ordinary person is stricken with feeling, they react, creating more suffering, whereas an awakened person responds with equanimity.",
  "sn-blurbs:sn36.7": "A mendicant should await their death mindful and aware. They should bear the feelings of approaching death with wisdom and equanimity.",
  "sn-blurbs:sn36.8": "A mendicant should await their death mindful and aware. They should bear the feelings of approaching death with wisdom and equanimity.",
  "sn-blurbs:sn36.9": "The three feelings are impermanent.",
  "sn-blurbs:sn36.10": "The three feelings are each produced by the appropriate contact.",
  "sn-blurbs:sn36.11": "A mendicant wonders how there can be three kinds of feeling, yet all of them are suffering.",
  "sn-blurbs:sn36.12": "Feelings arise in the body like winds blowing in the sky. With illustrative verses.",
  "sn-blurbs:sn36.13": "Feelings arise in the body like winds blowing in the sky.",
  "sn-blurbs:sn36.14": "Feelings arise in the body like guests in a hotel.",
  "sn-blurbs:sn36.15": "The Buddha explains the feelings to Ānanda in terms of arising, ending, gratification, drawback, and escape.",
  "sn-blurbs:sn36.16": "The Buddha asks about the feelings to Ānanda in terms of arising, ending, gratification, drawback, and escape.",
  "sn-blurbs:sn36.17": "The Buddha explains the feelings to several mendicants in terms of arising, ending, gratification, drawback, and escape.",
  "sn-blurbs:sn36.18": "The Buddha asks about the feelings to several mendicants in terms of arising, ending, gratification, drawback, and escape.",
  "sn-blurbs:sn36.19": "The carpenter Pañcakaṅga disagreed with Venerable Udāyī about how many kinds of feeling the Buddha taught. The Buddha affirms that each is a genuine teaching, valid in different contexts.",
  "sn-blurbs:sn36.20": "The Buddha has taught many different kinds of feeling, valid in different contexts.",
  "sn-blurbs:sn36.21": "When the wanderer Moḷiyasīvaka asks if all feelings are caused by karma in past lives. The Buddha denies this, asserting that feelings have many different causes.",
  "sn-blurbs:sn36.22": "The Buddha explains the different kinds of feelings analyzed into 108 aspects.",
  "sn-blurbs:sn36.23": "A mendicant asks the Buddha to explain the feelings in terms of the four noble truths.",
  "sn-blurbs:sn36.24": "Before his awakening the Buddha reflected on feeling in terms of arising, ending, gratification, drawback, and escape.",
  "sn-blurbs:sn36.25": "At his awakening, the Buddha saw feeling in terms of arising, ending, gratification, drawback, and escape.",
  "sn-blurbs:sn36.26": "Several mendicants ask the Buddha to explain the feelings in terms of the four noble truths.",
  "sn-blurbs:sn36.27": "One who does not truly understand feeling is no true ascetic.",
  "sn-blurbs:sn36.28": "One who does not truly understand feeling is no true ascetic.",
  "sn-blurbs:sn36.29": "One who does not truly understand feeling is no true ascetic.",
  "sn-blurbs:sn36.30": "There are three feelings: painful, pleasant, neutral.",
  "sn-blurbs:sn36.31": "The Buddha explains feelings as spiritual and carnal, associated with worldly states and with deep meditation.",
  "sn-blurbs:sn37.1": "Five things that make a woman either agreeable or disagreeable to men.",
  "sn-blurbs:sn37.2": "Five things that make a man either agreeable or disagreeable to women.",
  "sn-blurbs:sn37.3": "Five kinds of suffering that only women are subject to, not men. ",
  "sn-blurbs:sn37.4": "A woman who is selfish, envious, and lustful has a bad rebirth.",
  "sn-blurbs:sn37.5": "A woman with five bad qualities has a bad rebirth.",
  "sn-blurbs:sn37.6": "A woman with five bad qualities has a bad rebirth.",
  "sn-blurbs:sn37.7": "A woman with five bad qualities has a bad rebirth.",
  "sn-blurbs:sn37.8": "A woman with five bad qualities has a bad rebirth.",
  "sn-blurbs:sn37.9": "A woman with five bad qualities has a bad rebirth.",
  "sn-blurbs:sn37.10": "A woman with five bad qualities has a bad rebirth.",
  "sn-blurbs:sn37.11": "A woman with five bad qualities has a bad rebirth.",
  "sn-blurbs:sn37.12": "A woman with five bad qualities has a bad rebirth.",
  "sn-blurbs:sn37.13": "A woman with five bad qualities has a bad rebirth.",
  "sn-blurbs:sn37.14": "A woman with five good qualities has a good rebirth.",
  "sn-blurbs:sn37.15": "A woman with five good qualities has a good rebirth.",
  "sn-blurbs:sn37.16": "A woman with five good qualities has a good rebirth.",
  "sn-blurbs:sn37.17": "A woman with five good qualities has a good rebirth.",
  "sn-blurbs:sn37.18": "A woman with five good qualities has a good rebirth.",
  "sn-blurbs:sn37.19": "A woman with five good qualities has a good rebirth.",
  "sn-blurbs:sn37.20": "A woman with five good qualities has a good rebirth.",
  "sn-blurbs:sn37.21": "A woman with five good qualities has a good rebirth.",
  "sn-blurbs:sn37.22": "A woman with five good qualities has a good rebirth.",
  "sn-blurbs:sn37.23": "A woman with five good qualities has a good rebirth.",
  "sn-blurbs:sn37.24": "A woman who keeps the five precepts has a good rebirth.",
  "sn-blurbs:sn37.25": "A woman with five powers lives confident at home.",
  "sn-blurbs:sn37.26": "A woman with five powers lives at home having won over her husband.",
  "sn-blurbs:sn37.27": "A woman with five powers lives at home with her husband under her control.",
  "sn-blurbs:sn37.28": "A man with one power has a woman under his control: authority.",
  "sn-blurbs:sn37.29": "A woman may be complete with five powers.",
  "sn-blurbs:sn37.30": "A woman lacking in any of the five powers may be expelled from a family.",
  "sn-blurbs:sn37.31": "It is not because of beauty, wealth, relatives, or sons that a woman has a good rebirth, but because of ethical conduct.",
  "sn-blurbs:sn37.32": "For a woman who has not made merit, five things are hard to come by.",
  "sn-blurbs:sn37.33": "A woman with five qualities lives confidently at home.",
  "sn-blurbs:sn37.34": "A woman who grows in faith, ethics, learning, generosity, and wisdom acquires the best.",
  "sn-blurbs:sn38.1": "The wanderer Jambukhādaka asks Sāriputta about extinguishment and the path to realize it.",
  "sn-blurbs:sn38.2": "The wanderer Jambukhādaka asks Sāriputta about perfection (arahantship) and the path to realize it.",
  "sn-blurbs:sn38.3": "The wanderer Jambukhādaka asks Sāriputta who in the world are proponents of Dhamma. ",
  "sn-blurbs:sn38.4": "The wanderer Jambukhādaka asks Sāriputta about the purpose of the spiritual path.",
  "sn-blurbs:sn38.5": "The wanderer Jambukhādaka asks Sāriputta about who has attained consolation.",
  "sn-blurbs:sn38.6": "The wanderer Jambukhādaka asks Sāriputta about who has attained supreme consolation.",
  "sn-blurbs:sn38.7": "The wanderer Jambukhādaka asks Sāriputta what is feeling.",
  "sn-blurbs:sn38.8": "The wanderer Jambukhādaka asks Sāriputta what is a defilement.",
  "sn-blurbs:sn38.9": "The wanderer Jambukhādaka asks Sāriputta what is ignorance.",
  "sn-blurbs:sn38.10": "The wanderer Jambukhādaka asks Sāriputta what is craving.",
  "sn-blurbs:sn38.11": "The wanderer Jambukhādaka asks Sāriputta what are the floods.",
  "sn-blurbs:sn38.12": "The wanderer Jambukhādaka asks Sāriputta what is grasping.",
  "sn-blurbs:sn38.13": "The wanderer Jambukhādaka asks Sāriputta about the three realms of rebirth.",
  "sn-blurbs:sn38.14": "The wanderer Jambukhādaka asks Sāriputta about suffering.",
  "sn-blurbs:sn38.15": "The wanderer Jambukhādaka asks Sāriputta what is identity.",
  "sn-blurbs:sn38.16": "The wanderer Jambukhādaka asks Sāriputta what is difficult to do in this teaching and training.",
  "sn-blurbs:sn39.1": "The wanderer Sāmaṇḍaka asks Sāriputta about extinguishment and the path to realize it. The remainder of the texts in this section are elided in the Pali text, with the instruction to expand as per SN 38.",
  "sn-blurbs:sn39.16": "The wanderer Sāmaṇḍaka asks Sāriputta what is difficult to do in this teaching and training.",
  "sn-blurbs:sn40.1": "Moggallāna speaks to the mendicants of a time when his practice of the first absorption was faltering. He expresses his gratitude for the Buddha, who urged him to stabilize that attainment.",
  "sn-blurbs:sn40.2": "Moggallāna speaks to the mendicants of a time when his practice of the second absorption was faltering. He expresses his gratitude for the Buddha, who urged him to stabilize that attainment.",
  "sn-blurbs:sn40.3": "Moggallāna speaks to the mendicants of a time when his practice of the third absorption was faltering. He expresses his gratitude for the Buddha, who urged him to stabilize that attainment.",
  "sn-blurbs:sn40.4": "Moggallāna speaks to the mendicants of a time when his practice of the fourth absorption was faltering. He expresses his gratitude for the Buddha, who urged him to stabilize that attainment.",
  "sn-blurbs:sn40.5": "Moggallāna speaks to the mendicants of a time when his practice of the dimension of infinite space was faltering. He expresses his gratitude for the Buddha, who urged him to stabilize that attainment.",
  "sn-blurbs:sn40.6": "Moggallāna speaks to the mendicants of a time when his practice of the dimension of infinite consciousness was faltering. He expresses his gratitude for the Buddha, who urged him to stabilize that attainment.",
  "sn-blurbs:sn40.7": "Moggallāna speaks to the mendicants of a time when his practice of the dimension of nothingness was faltering. He expresses his gratitude for the Buddha, who urged him to stabilize that attainment.",
  "sn-blurbs:sn40.8": "Moggallāna speaks to the mendicants of a time when his practice of the dimension of neither perception nor non-perception was faltering. He expresses his gratitude for the Buddha, who urged him to stabilize that attainment.",
  "sn-blurbs:sn40.9": "Moggallāna speaks to the mendicants of a time when his practice of the signless immersion was faltering. He expresses his gratitude for the Buddha, who urged him to stabilize that attainment.",
  "sn-blurbs:sn40.10": "Moggallāna ascended to the heaven of the Thirty-Three to address Sakka, the lord of gods, and his extensive retinue. He spoke in praise of going for refuge, as it leads to heaven. Sakka affirmed this on multiple occasions, adding that gods who had gone for refuge and kept ethics surpassed the other deities in the heavens.",
  "sn-blurbs:sn40.11": "The dialogue in SN 40.10 is repeated with a series of other deities.",
  "sn-blurbs:sn41.1": "Citta the householder hears of a conversation among the monks regarding the distinction between the fetters and the things that are fettered. He goes to ask them on this topic, but they are unable to give a satisfactory answer, so he explained it to them. It is desire that is the fetter, like the yoke that binds two oxen. ",
  "sn-blurbs:sn41.2": "Citta the householder invites some mendicants to his home for a meal. He asks them about the diversity of the elements, but only the junior monk, Isidatta, is able to answer.",
  "sn-blurbs:sn41.3": "Citta the householder invites some mendicants to his home for a meal. He asks them what is the cause of the ten metaphysical questions and the 62 views of the Brahmajala Sutta, but only the junior monk, Isidatta, is able to answer. Citta realizes that Isidatta is in fact an unseen friend of his from Avantī. He offers to support him with requisites, but Isidatta left, never to return.",
  "sn-blurbs:sn41.4": "Citta the householder invites some mendicants to his home for a meal. When they left he followed them, and witnessed the junior monk Venerable Mahaka performing a psychic feat. Citta approached Mahaka in his hut and asked him to demonstrate his skills, and Mahaka obliged. Citta offers to support him with requisites, but Mahaka left, never to return.",
  "sn-blurbs:sn41.5": "Venerable Kāmabhū asks Citta to explain an enigmatic verse on a “one-spoked chariot”. After a brief consideration, Citta is able to explain it in detail.",
  "sn-blurbs:sn41.6": "Citta asks Kāmabhū about the different kinds of processes (<i lang='pi' translate='no'>saṅkhāra</i>) in a series of questions that lead to the most profound of meditation experiences. ",
  "sn-blurbs:sn41.7": "Venerable Godatta asks Citta whether the liberations of measurelessness, nothingness, emptiness, and signlessness are different states, or just different words for the same thing. Citta explains that they are both: they are terms for different meditation experiences, but may also be used of perfection or arahantship.",
  "sn-blurbs:sn41.8": "The Jain leader Mahāvīra, known as Nigaṇṭha Nātaputa in the Buddhist tradition, is visited by Citta. Mahāvīra asks him whether he believes in a certain state of immersion. When Citta replies that he doesn’t go by faith in the Buddha on this point, Mahāvīra is delighted. But it turns out Citta doesn’t need faith, as he experiences such a state for himself.",
  "sn-blurbs:sn41.9": "Citta meets with the naked ascetic Kassapa, an old friend of his, and asks what gains he has realized from the spiritual life. Kassapa admits he has realized no higher attainments, whereupon Citta reveals he has realized many such attainments. Kassapa decides to ordain as a Buddhist mendicant.",
  "sn-blurbs:sn41.10": "When Citta was on his deathbed, rather than receiving comfort, he gave comfort and teaching to those present.",
  "sn-blurbs:sn42.1": "A headman known for his aggressive nature approaches the Buddha and asks how to give up irritability. The Buddha points out that such reactions are fueled by greed, hate, and delusion.",
  "sn-blurbs:sn42.2": "Talapuṭa the head of a troupe of performers asks the Buddha whether the belief that performers have a good rebirth is correct. The Buddha tries to dissuade him, but ultimately reveals that by inciting lust they head to a bad rebirth. Talapuṭa is distressed and asks to ordain.",
  "sn-blurbs:sn42.3": "Yodhājı̄va the professional warrior asks the Buddha whether the belief that warriors have a good rebirth is correct. The Buddha tries to dissuade him, but ultimately reveals that by following the way of violence they head to a bad rebirth. Yodhājı̄va is distressed and takes refuge.",
  "sn-blurbs:sn42.4": "Hatthāroha the elephant warrior asks the Buddha whether the belief that warriors have a good rebirth is correct. The Buddha tries to dissuade him, but ultimately reveals that by following the way of violence they head to a bad rebirth. Hatthāroha is distressed and takes refuge.",
  "sn-blurbs:sn42.5": "Assāroha the cavalry warrior asks the Buddha whether the belief that warriors have a good rebirth is correct. The Buddha tries to dissuade him, but ultimately reveals that by following the way of violence they head to a bad rebirth. Yodhājı̄va is distressed and asks to ordain.",
  "sn-blurbs:sn42.6": "The chief Asibandhakaputta asks whether the rituals advocated by the western brahmins can bring a person to heaven. The Buddha asserts that only good deeds can take you to a good rebirth, and rituals have no effect.",
  "sn-blurbs:sn42.7": "The chief Asibandhakaputta asks the Buddha why, if he has equal compassion for all, he teaches some more than others. The Buddha answers with a simile of a field: a farmer knows to put most of their effort into the fertile land. ",
  "sn-blurbs:sn42.8": "The Buddha asks the chief Asibandhakaputta, a Jain, how Mahāvīra the Jain leader teaches his followers. He replies that you go to a rebirth depending on what you usually do. But the Buddha points out that even a killer only spends a small amount of time actually killing. The Buddha’s approach is to point out that deeds have results, and to encourage the abandoing of bad deeds and the adoption of good deeds.",
  "sn-blurbs:sn42.9": "Mahāvīra asks Asibandhakaputta to refute the Buddha on behalf of the Jains. He suggests to try to trap the Buddha with a dilemma: he claims to have compassion for householders, yet visits them with a large Saṅgha in a time of scarcity. But the Buddha says no family has been harmed from this.",
  "sn-blurbs:sn42.10": "Several members of the king’s retinue criticize the Buddhist mendicants for accepting offerings of money. Chief Maṇicūḷaka is among them, and he visits the Buddha to find out the truth. The Buddha categorically denies the accusation.",
  "sn-blurbs:sn42.11": "The chief Bhadraka asks the Buddha about the origin and ending of suffering, and the Buddha points out that a loss among Bhadraka’s own community would cause him suffering, due to his attachment.",
  "sn-blurbs:sn42.12": "The chief Rāsiya asks whether the Buddha completely rejects all forms of asceticism. The Buddha denies that this is the case, and explains what he means by the middle way in a lengthy disquisition, covering useful and useless forms of asceticism.",
  "sn-blurbs:sn42.13": "The chief Pāṭaliya asks whether the Buddha knows magic. He says he does—but that does not make him a magician.",
  "sn-blurbs:sn44.1": "While staying in Toraṇavatthu, King Pasenadi wishes to visit a spiritual teacher, and the nun Khemā is highly recommended to him. He asks her about whether a realized One exists after death, and she says this is not answerable. Later he visits the Buddha, who replies in exactly the same way.",
  "sn-blurbs:sn44.2": "Venerable Anurādha is questioned by a number of ascetics, and ends up by saying that the Realized One is described in terms other than “existing after death” and so on. The wanderers say he’s a fool, so he checks with the Buddha, who says that a Realized One is not even apprehended in this life, so how can he be described after death?",
  "sn-blurbs:sn44.3": "Mahākoṭṭhita asks Sāriputta whether a Realized One exists after death. Sāriputta says that to answer this would be to get involved in the five aggregates, something that a Realized One is free from.",
  "sn-blurbs:sn44.4": "Mahākoṭṭhita asks Sāriputta whether a Realized One exists after death. Sāriputta says that one who understands the five aggregates would not think in such terms.",
  "sn-blurbs:sn44.5": "Mahākoṭṭhita asks Sāriputta whether a Realized One exists after death. Sāriputta says that only someone who has desire for the five aggregates would think in such terms.",
  "sn-blurbs:sn44.6": "Sāriputta asks Mahākoṭṭhita whether a Realized One exists after death. Mahākoṭṭhita says that only someone who delights in the five aggregates would think in such terms, and offers a variety of further explanations of the same point.",
  "sn-blurbs:sn44.7": "The wanderer Vacchagotta asks Moggallāna the ten metaphysical questions, starting with whether the cosmos is eternal. Moggallāna says such questions would only be answered by someone who identifies with the six senses. Vacchagotta then asks the Buddha the same questions.",
  "sn-blurbs:sn44.8": "The wanderer Vacchagotta asks the Buddha the ten metaphysical questions, starting with whether the cosmos is eternal. He says such questions would only be answered by someone who identifies with the five aggregates.",
  "sn-blurbs:sn44.9": "The wanderer Vacchagotta reports to the Buddha a conversation among ascetics on the views of the six heretical teachers as to where a perfected one is reborn. Unsure of what the Buddha’s position was, he asks how it is to be understood. The Buddha says it is like a flame that burns dependent on fuel, and goes out when that fuel is extinguished.",
  "sn-blurbs:sn44.10": "Vacchagotta asks the Buddha whether a self exists, but the Buddha is silent. When Ānanda later asks him why he didn’t answer, the Buddha replied that it was to avoid misunderstanding.",
  "sn-blurbs:sn44.11": "The wanderer Vacchagotta asks Venerable Sabhiya Kaccāna whether a Realized One exists after death. He answers that the basis for describing a Realized One no longer applies. Vacchagotta is impressed that such a junior monk understands this subtle matter.",
  "sn-blurbs:sn45.1": "Following ignorance comes the wrong eightfold path. But the right eightfold path follows true knowledge.",
  "sn-blurbs:sn45.2": "When Ānanda says that good friendship is half the spiritual path, the Buddha rebukes him, saying that it is in fact the whole of the spiritual path. Based on good friendship, the eightfold path is fulfilled.",
  "sn-blurbs:sn45.3": "When Sāriputta says that good friendship is the whole of the spiritual path, the Buddha praises him. Based on good friendship, the eightfold path is fulfilled.",
  "sn-blurbs:sn45.4": "Ānanda sees the brahmin Jāṇussoṇi resplendent on his all-white chariot. He asks the Buddha whether there is a similarly divine vehicle in Buddhism. The Buddha responds by drawing a detailed set of analogies between the eightfold path and a chariot.",
  "sn-blurbs:sn45.5": "When asked what is the purpose of the spiritual path, you should answer that it is the ending of suffering.",
  "sn-blurbs:sn45.6": "A mendicant asks what is the purpose of the spiritual path, and the Buddha answers that it is the ending of suffering.",
  "sn-blurbs:sn45.7": "A mendicant asks about Nibbāna and the deathless.",
  "sn-blurbs:sn45.8": "The Buddha presents the eightfold path together with a detailed analysis of each factor. It should be assumed that these explanations apply wherever the eightfold path is taught.",
  "sn-blurbs:sn45.9": "A mendicant with wrong view will develop the path in the wrong way, harming themselves as if grabbing a sharp spike the wrong way.",
  "sn-blurbs:sn45.10": "The wanderer Nandiya asks how many things lead to extinguishment.",
  "sn-blurbs:sn45.11": "The Buddha goes on retreat for a fortnight. When he emerges, he describes his meditation on the conditionality of the eightfold path, which was similar to a practice he did shortly after awakening.",
  "sn-blurbs:sn45.12": "The Buddha goes on retreat for a fortnight. When he emerges, he describes his meditation on the conditionality of the eightfold path, which was similar to a practice he did shortly after awakening.",
  "sn-blurbs:sn45.13": "A mendicant asks how a person is a “trainee”.",
  "sn-blurbs:sn45.14": "The eightfold path does not arise apart from a Realized One.",
  "sn-blurbs:sn45.15": "The eightfold path does not arise apart from a Holy One’s training.",
  "sn-blurbs:sn45.16": "The eight pure factors of the path do not arise apart from a Realized One.",
  "sn-blurbs:sn45.17": "The eight pure factors of the path do not arise apart from a Holy One’s training.",
  "sn-blurbs:sn45.18": "In a short discourse evidently set shortly after the Buddha’s passing, Venerable Bhadda asks Ānanda about the unholy life, or the unspiritual path. It is the wrong eightfold path.",
  "sn-blurbs:sn45.19": "In a short discourse evidently set shortly after the Buddha’s passing, Venerable Bhadda asks Ānanda about the holy life, or the spiritual path. It is the right eightfold path.",
  "sn-blurbs:sn45.20": "In a short discourse evidently set shortly after the Buddha’s passing, Venerable Bhadda asks Ānanda about the spiritual path, one who follows the spiritual path, and the goal of the spiritual path.",
  "sn-blurbs:sn45.21": "The wrong eightfold path is a wrong state; the right eightfold path is a right state.",
  "sn-blurbs:sn45.22": "The factors of the wrong eightfold path are unskillful qualities; those of the right eightfold path are skillful qualities.",
  "sn-blurbs:sn45.23": "The wrong eightfold path is the wrong way; the right eightfold path is the right way.",
  "sn-blurbs:sn45.24": "Regardless of whether one is a lay person or a renunciate, the Buddha praises the right way, not the wrong way. The wrong eightfold path is the wrong way; the right eightfold path is the right way.",
  "sn-blurbs:sn45.25": "A bad person practices wrong eightfold path; a good person practices the right eightfold path.",
  "sn-blurbs:sn45.26": "A bad person practices wrong eightfold path, and a worse person has wrong knowledge and wrong liberation, too; a good person is the opposite.",
  "sn-blurbs:sn45.27": "Someone without the eightfold path is easily knocked over, like a pot without a stand.",
  "sn-blurbs:sn45.28": "The eightfold path is the necessary prerequisite for right immersion (<i lang='pi' translate='no'>samādhi</i>).",
  "sn-blurbs:sn45.29": "The eightfold path is developed to understand the three feelings.",
  "sn-blurbs:sn45.30": "The Buddha taught the eightfold path in order to give up the five kinds of sensual stimulation.",
  "sn-blurbs:sn45.31": "The wrong eightfold path is wrong practice; the right eightfold path is right practice.",
  "sn-blurbs:sn45.32": "Practicing the wrong eightfold path is wrong; practicing the right awakening path is right.",
  "sn-blurbs:sn45.33": "Neglecting the eightfold path you neglect the path to the end of suffering.",
  "sn-blurbs:sn45.34": "The eightfold path leads from the near to the far shore. With a long set of verses.",
  "sn-blurbs:sn45.35": "The eightfold path is the ascetic life. Its fruits are stream-entry, once-return, non-return, and perfection.",
  "sn-blurbs:sn45.36": "The eightfold path is the ascetic life. Its fruits are the end of greed, hate, and delusion.",
  "sn-blurbs:sn45.37": "The eightfold path is brahminhood. Its fruits are stream-entry, once-return, non-return, and perfection.",
  "sn-blurbs:sn45.38": "The eightfold path is brahminhood. Its fruits are the end of greed, hate, and delusion.",
  "sn-blurbs:sn45.39": "The eightfold path is the spiritual path. Its fruits are stream-entry, once-return, non-return, and perfection.",
  "sn-blurbs:sn45.40": "The eightfold path is the spiritual path. Its fruits are the end of greed, hate, and delusion.",
  "sn-blurbs:sn45.41": "If others ask why you follow the spiritual path, say it’s for the fading away of lust.",
  "sn-blurbs:sn45.42-47": "If others ask why you follow the spiritual path, say it’s for giving up fetters, etc.",
  "sn-blurbs:sn45.48": "If others ask why you follow the spiritual path, say it’s for final extinguishment without anything left over.",
  "sn-blurbs:sn45.49": "As the dawn precedes the sun, good friendship precedes the eightfold path.",
  "sn-blurbs:sn45.50-54": "As the dawn precedes the sun, ethics, enthusiasm, confidence, right view, and diligence precede the eightfold path.",
  "sn-blurbs:sn45.55": "As the dawn precedes the sun, proper attention precedes the eightfold path.",
  "sn-blurbs:sn45.170": "Develop the eightfold path to abandon the three cravings. This sutta is doubled by replacing <i lang='pi' translate='no'>taṇhā</i> with another form of the same word, <i lang='pi' translate='no'>tasina</i>. This variation is found in Burmese but not Sinhalese manuscripts. ",
  "sn-blurbs:sn46.1": "Dragons nurture their strength in the Himalayas, then enter the rivers and reach the ocean. So too, a mendicant nurtures ethics and then develops the seven awakening factors.",
  "sn-blurbs:sn46.2": "Just as the body depends on food, the awakening factors depend on nutriment. The Buddha gives specific conditions for each of the factors.",
  "sn-blurbs:sn46.3": "Here the awakening factors are described in the context of hearing the teachings and reflecting on them. This leads to full enlightenment, or at least to some lesser attainment.",
  "sn-blurbs:sn46.4": "The various awakening factors can be donned at different times of the day, like a man who puts on bright colored clothes whenever he wants.",
  "sn-blurbs:sn46.5": "They’re called awakening factors because they lead to awakening.",
  "sn-blurbs:sn46.6": "The wanderer Kuṇḍaliya points out that some ascetics argue for the sake of winning debates. But the Buddha says his path is for the sake of liberation. Kuṇḍaliya asks what leads to liberation, and the Buddha traces a sequence of conditions back to sense restraint.",
  "sn-blurbs:sn46.7": "The awakening factors lead to extinguishment, like rafters holding up the roof peak.",
  "sn-blurbs:sn46.8": "Sāriputta asks Upavāṇa how one can reflect and see the awakening factors in oneself.",
  "sn-blurbs:sn46.9": "The awakening factors do not arise apart from a Realized One.",
  "sn-blurbs:sn46.10": "The awakening factors do not arise apart from a Holy One’s training.",
  "sn-blurbs:sn46.11": "Just as living creatures are based on the earth, the awakening factors are based on ethics.",
  "sn-blurbs:sn46.12": "Just as the dawn precedes the sun, good friendship precedes the awakening factors.",
  "sn-blurbs:sn46.13": "Just as the dawn precedes the sun, proper attention precedes the awakening factors.",
  "sn-blurbs:sn46.14": "When Mahākassapa was sick, the Buddha taught him the awakening factors, inspiring him to a swift recovery.",
  "sn-blurbs:sn46.15": "When Mahāmoggallāna was sick, the Buddha taught him the awakening factors, inspiring him to a swift recovery.",
  "sn-blurbs:sn46.16": "When the Buddha was sick, Mahācunda taught him the awakening factors, inspiring him to a swift recovery.",
  "sn-blurbs:sn46.17": "The awakening factors lead from the near to the far shore.",
  "sn-blurbs:sn46.18": "Those who neglect the awakening factors neglect the path to the end of suffering.",
  "sn-blurbs:sn46.19": "The awakening factors are noble and emancipating.",
  "sn-blurbs:sn46.20": "The awakening factors lead to disenchantment.",
  "sn-blurbs:sn46.21": "They’re called awakening factors because they lead to awakening.",
  "sn-blurbs:sn46.22": "A simple statement on the awakening factors.",
  "sn-blurbs:sn46.23": "Frequently focusing on things tends to promote similar qualities, whether good (awakening factors) or bad (hindrances).",
  "sn-blurbs:sn46.24": "Improper attention grows the hindrances, proper attention grows the awakening factors.",
  "sn-blurbs:sn46.25": "The awakening factors lead to non-decline.",
  "sn-blurbs:sn46.26": "The awakening factors lead to the ending of craving.",
  "sn-blurbs:sn46.27": "The awakening factors lead to the cessation of craving.",
  "sn-blurbs:sn46.28": "The awakening factors partake of penetration.",
  "sn-blurbs:sn46.29": "Nothing is as effective for getting rid of fetters as the awakening factors.",
  "sn-blurbs:sn46.30": "Venerable Udāyı̄ celebrates his progress on the path, gaining faith as a householder, going forth, and realizing the Dhamma. Now he develops the awakening factors for the end of suffering.",
  "sn-blurbs:sn46.31": "Skillful qualities are rooted in diligence, which promotes the awakening factors.",
  "sn-blurbs:sn46.32": "Skillful qualities are rooted in proper attention, which promotes the awakening factors.",
  "sn-blurbs:sn46.33": "Hindrances sully the mind like impurities in gold.",
  "sn-blurbs:sn46.34": "Awakening factors purify the mind and lead to liberation.",
  "sn-blurbs:sn46.35": "Improper attention promotes the hindrances; proper attention promotes the awakening factors.",
  "sn-blurbs:sn46.36": "The awakening factors lead to growth and non-decline.",
  "sn-blurbs:sn46.37": "Hindrances sully the mind, awakening factors purify it.",
  "sn-blurbs:sn46.38": "Listening to the teaching, the hindrances are given up and the awakening factors developed.",
  "sn-blurbs:sn46.39": "As some large trees with small seeds will overgrow and ruin other trees, so the hindrances overgrow and ruin the mind.",
  "sn-blurbs:sn46.40": "The hindrances cause blindness, the awakening factors cause vision.",
  "sn-blurbs:sn46.41": "Anyone who abandons the three kinds of discrimination does so due to the awakening factors.",
  "sn-blurbs:sn46.42": "As the Wheel-turning Monarch manifests seven treasures, the Realized One manifests the seven awakening factors.",
  "sn-blurbs:sn46.43": "The awakening factors crush Māra’s army.",
  "sn-blurbs:sn46.44": "A stupid person has not developed the awakening factors.",
  "sn-blurbs:sn46.45": "A wise person has developed the awakening factors.",
  "sn-blurbs:sn46.46": "A person who has not developed the awakening factors is called “poor”.",
  "sn-blurbs:sn46.47": "A person who has developed the awakening factors is called “prosperous”.",
  "sn-blurbs:sn46.48": "As the dawn precedes the sunrise, so too good friendship precedes the awakening factors.",
  "sn-blurbs:sn46.49": "No internal factor helps the awakening factors so much as proper attention.",
  "sn-blurbs:sn46.50": "No external factor helps the awakening factors so much as good friendship.",
  "sn-blurbs:sn46.51": "The Buddha spells out in detail the factors that nourish the hindrances, and those that nourish the awakening factors.",
  "sn-blurbs:sn46.52": "Some wanderers tell some Buddhist mendicants that they, too, teach the five hindrances and the seven awakening factors, so what is the difference? The Buddha explains by giving a detailed analytical treatment that he says is beyond the scope of the wanderers.",
  "sn-blurbs:sn46.53": "Which awakening factors should be developed when the mind is tired, and which when it is energetic? And what is always useful?",
  "sn-blurbs:sn46.54": "Some wanderers tell some Buddhist mendicants that they, too, teach the five hindrances and the four Brahmā meditations, so what is the difference? The Buddha explains the detailed connection between the Brahmā meditations and the awakening factors, which taken together lead to liberation.",
  "sn-blurbs:sn46.55": "The brahmin Saṅgārava asks why sometimes verses stay in memory while other times they don’t. The Buddha replies that it is due to the presence of either the hindrances of awakening factors. He gives a set of similes illustrating each of the hindrances with different bowls of water.",
  "sn-blurbs:sn46.56": "Prince Abhaya reports Pūraṇa Kassapa’s view that there is no cause for ignorance or knowledge, and asks the Buddha’s opinion. The Buddha replies that the cause of ignorance is the hindrances, and the cause of knowledge is the awakening factors.",
  "sn-blurbs:sn46.57": "A series of passages on the benefits of meditating on a skeleton. Some editions treat the sections as separate suttas.",
  "sn-blurbs:sn47.1": "At Ambapālī’s mango grove, the Buddha teaches the mendicants about the “way to convergence”, the four kinds of mindfulness meditation. ",
  "sn-blurbs:sn47.2": "At Ambapālī’s mango grove, the Buddha teaches the mendicants about the four kinds of mindfulness meditation and the practice of situational awareness. ",
  "sn-blurbs:sn47.3": "When a mendicant asks for a teaching to take on retreat, the Buddha issues an unexpected rebuke. Evidently the mendicant had been badly behaved; but now, he insists, he is sincere. The Buddha relents, and teaches the four kinds of mindfulness meditation, well grounded on ethics.",
  "sn-blurbs:sn47.4": "Newly ordained mendicants <em>should</em> practice the four kinds of mindfulness meditation; trainees <em>are</em> practicing them, and perfected ones have perfected the practice.",
  "sn-blurbs:sn47.5": "The four kinds of mindfulness meditation are a complete heap of what is skillful.",
  "sn-blurbs:sn47.6": "The parable of the quail and the hawk. When the quail ventured outside her ancestral territory, she became vulnerable. And what is a mendicant’s ancestral territory? The four kinds of mindfulness meditation.",
  "sn-blurbs:sn47.7": "The parable of the foolish monkey who gets trapped in tar when it ventures outside its ancestral territory. And what is a mendicant’s ancestral territory? The four kinds of mindfulness meditation.",
  "sn-blurbs:sn47.8": "The parable of the cook. They present different kinds of dishes to the king, and observe which the king likes. In the same way, a mendicant observes why their meditation succeeds or fails. When the four kinds of mindfulness meditation succeeds it leads to giving up hindrances and entering immersion.",
  "sn-blurbs:sn47.9": "The Buddha decides to spend his final rains retreat at Vesālī in Beluvagāmaka. During the retreat he becomes very ill, but later recovers. Ānanda wonders who will guide the Saṅgha when the Buddha dies, but the Buddha says they should be their own refuge, grounded on the four kinds of mindfulness meditation.",
  "sn-blurbs:sn47.10": "When Ānanda visits the nuns’s quarters they tell him that their meditation is prospering to higher and higher levels. Ānanda reporrts the good news to the Buddha, who speaks of two ways of developing the four kinds of mindfulness meditation: directed and undirected.",
  "sn-blurbs:sn47.11": "Sāriputta asks the Buddha what is a great man, and the Buddha says it is someone whose mind has been freed by developing the four kinds of mindfulness meditation.",
  "sn-blurbs:sn47.12": "Sāriputta boldly claims that no-one has ever, or will ever, be more enlightened than the Buddha. He admits that he cannot read the minds of all the Buddhas, but he understands a principle of the Dhamma: all those who become awakened do so by giving up the five hindrances, practicing the four kinds of mindfulness meditation, and developing the seven awakening factors.",
  "sn-blurbs:sn47.13": "Sāriputta dies of illness, and the novice Cunda together with Ānanda take his bowl and robes and report the sad news to the Buddha. The Buddha dispels Ānanda’s sadness by speaking of the four kinds of mindfulness meditation.",
  "sn-blurbs:sn47.14": "After the passing of Sāriputta and Moggallāna (whose actual death is unrecorded in the canon), the Buddha says the Saṅgha looks empty; yet he is not sad.",
  "sn-blurbs:sn47.15": "When Venerable Bāhiya asks for a teaching to take on retreat, the Buddha teaches the four kinds of mindfulness meditation, well grounded on ethics.",
  "sn-blurbs:sn47.16": "When Venerable Uttiya asks for a teaching to take on retreat, the Buddha teaches the four kinds of mindfulness meditation, well grounded on ethics.",
  "sn-blurbs:sn47.17": "The four kinds of mindfulness meditation lead to the end of suffering.",
  "sn-blurbs:sn47.18": "Just after the Buddha’s awakening, Brahmā Sahampati supports the Buddha’s reflection that the four kinds of mindfulness meditation are the way to convergence.",
  "sn-blurbs:sn47.19": "Two acrobats discuss whether one should support the other, or the other way around. The Buddha says they should support each other. In the same way we should practice the four kinds of mindfulness meditation both for one’s own benefit and to protect others.",
  "sn-blurbs:sn47.20": "A parable that sets up an impossible challenge: to walk between a popular performer and the crowd jostling to see her, carrying a bowl of oil filled to the brim, while a man with a drawn sword waits to chop off your head if you spill a drop. That’s mindfulness! ",
  "sn-blurbs:sn47.21": "Venerable Bhadda asks Ānanda about the ethical virtues encouraged by the Buddha—what is their purpose? To develop the four kinds of mindfulness meditation.",
  "sn-blurbs:sn47.22": "Venerable Bhadda asks Ānanda about the conditions under which the true teaching lasts long or does not last long after the Buddha’s passing. Ānanda says it depends on whether the four kinds of mindfulness meditation are practiced.",
  "sn-blurbs:sn47.23": "Venerable Bhadda asks Ānanda about the conditions under which the true teaching declines. Ānanda says it depends on whether the four kinds of mindfulness meditation are practiced.",
  "sn-blurbs:sn47.24": "A simple teaching on the four kinds of mindfulness meditation.",
  "sn-blurbs:sn47.25": "A brahmin asks the Buddha about the conditions under which the true teaching lasts long or does not last long after the Buddha’s passing. The Buddha says it depends on whether the four kinds of mindfulness meditation are practiced.",
  "sn-blurbs:sn47.26": "Sāriputta asks Anuruddha what makes someone a trainee. It is someone who has partly developed the four kinds of mindfulness meditation.",
  "sn-blurbs:sn47.27": "Sāriputta asks Anuruddha what makes someone an adept. It is someone who has fully developed the four kinds of mindfulness meditation.",
  "sn-blurbs:sn47.28": "Anuruddha claims to have developed the various direct knowledges by practicing the four kinds of mindfulness meditation.",
  "sn-blurbs:sn47.29": "When the householder Sirivaḍḍha is sick, Ānanda visits him and encourages him to practice mindfulness meditation. But he has already developed them, and abandoned the five lower fetters.",
  "sn-blurbs:sn47.30": "When the householder Mānadinna is sick, Ānanda visits him and encourages him to practice mindfulness meditation. But he has already developed them, and abandoned the five lower fetters.",
  "sn-blurbs:sn47.31": "The full knowledge of mindfulness meditation was not learned before the Buddha.",
  "sn-blurbs:sn47.32": "The four kinds of mindfulness meditation lead to peace.",
  "sn-blurbs:sn47.33": "Someone who has neglected the four kinds of mindfulness meditation has neglected the noble path.",
  "sn-blurbs:sn47.34": "The four kinds of mindfulness meditation lead from the near to the far shore.",
  "sn-blurbs:sn47.35": "Mindfulness is the four kinds of mindfulness meditation. Situational awareness is watching the arising and passing of feelings, thoughts, and perceptions.",
  "sn-blurbs:sn47.36": "When the four kinds of mindfulness meditation are developed, perfection or non-return may be expected.",
  "sn-blurbs:sn47.37": "Developing the four kinds of mindfulness meditation, desire is abandoned.",
  "sn-blurbs:sn47.38": "The four kinds of mindfulness meditation lead to realizing the deathless.",
  "sn-blurbs:sn47.39": "The development of the four kinds of mindfulness meditation.",
  "sn-blurbs:sn47.40": "The Buddha teaches the simple passage on the four kinds of mindfulness meditation and an advanced analysis, which involves contemplating them as impermanent.",
  "sn-blurbs:sn47.41": "Develop the four kinds of mindfulness meditation, don’t let the deathless be lost.",
  "sn-blurbs:sn47.42": "The causes for the origination and cessation of the phenomena upon which the four kinds of mindfulness meditation are grounded.",
  "sn-blurbs:sn47.43": "The Buddha tells the mendicants how, just after his awakening, Brahmā Sahampati supported the Buddha’s reflection that the four kinds of mindfulness meditation are the way to convergence",
  "sn-blurbs:sn47.44": "Be mindful by developing the four kinds of mindfulness meditation.",
  "sn-blurbs:sn47.45": "The four kinds of mindfulness meditation are a heap of the skillful.",
  "sn-blurbs:sn47.46": "When a mendicant asks for a teaching to take on retreat, the Buddha teaches the four kinds of mindfulness meditation, well grounded on restraint in the code of monastic rules.",
  "sn-blurbs:sn47.47": "When a mendicant asks for a teaching to take on retreat, the Buddha teaches the four kinds of mindfulness meditation, well grounded on good bodily, verbal, and mental conduct.",
  "sn-blurbs:sn47.48": "You should encourage your friends to practice the four kinds of mindfulness meditation.",
  "sn-blurbs:sn47.49": "The four kinds of mindfulness meditation help to understand the three feelings.",
  "sn-blurbs:sn47.50": "The four kinds of mindfulness meditation help to give up the defilements.",
  "sn-blurbs:sn48.1": "The five faculties are faith, energy, mindfulness, immersion, and wisdom.",
  "sn-blurbs:sn48.2": "One who understands the gratification, the drawback, and the escape regarding the five faculties is a stream-enterer.",
  "sn-blurbs:sn48.3": "One who understands the origin, the passing, the gratification, the drawback, and the escape regarding the five faculties is a stream-enterer.",
  "sn-blurbs:sn48.4": "One who is freed after understanding the gratification, the drawback, and the escape regarding the five faculties is a perfected one.",
  "sn-blurbs:sn48.5": "One who is freed after understanding the origin, the passing, the gratification, the drawback, and the escape regarding the five faculties is a perfected one.",
  "sn-blurbs:sn48.6": "A true ascetic understands the five faculties in terms of gratification, drawback, and escape.",
  "sn-blurbs:sn48.7": "A true ascetic understands the five faculties in terms of the four noble truths.",
  "sn-blurbs:sn48.8": "Each of the five faculties should be seen in a particular set of teachings.",
  "sn-blurbs:sn48.9": "The Buddha gives a short explanation of each of the five faculties. ",
  "sn-blurbs:sn48.10": "The Buddha gives a detailed explanation of each of the five faculties. ",
  "sn-blurbs:sn48.11": "The Buddha explains the five faculties in terms of how they are obtained.",
  "sn-blurbs:sn48.12": "One who has developed the five faculties fully is a perfected one. Developing them to a lesser degree, one reaches lesser attainments.",
  "sn-blurbs:sn48.13": "One who has developed the five faculties fully is a perfected one. Developing them to a lesser degree, one reaches lesser attainments. A difference in faculties leads to a difference in fruits.",
  "sn-blurbs:sn48.14": "One who has developed the five faculties fully is a perfected one. Developing them to a lesser degree, one reaches lesser attainments. The faculties are not barren.",
  "sn-blurbs:sn48.15": "One who has developed the five faculties fully is a perfected one. Developing them to a lesser degree, one reaches lesser attainments.",
  "sn-blurbs:sn48.16": "One who has developed the five faculties fully is a perfected one. Developing them to a lesser degree, one reaches lesser attainments. A difference in faculties leads to a difference in fruits.",
  "sn-blurbs:sn48.17": "One who has developed the five faculties fully is a perfected one. Developing them to a lesser degree, one reaches lesser attainments. The faculties are not barren.",
  "sn-blurbs:sn48.18": "One who has developed the five faculties fully is a perfected one. Developing them to a lesser degree, one reaches lesser attainments. One who has none of them at all is an outsider.",
  "sn-blurbs:sn48.19": "Someone who develops the faculties is said to be equipped with faculties.",
  "sn-blurbs:sn48.20": "The five faculties lead to the ending of defilements in this very life.",
  "sn-blurbs:sn48.21": "The Buddha did not claim to be awakened until he realized the five faculties.",
  "sn-blurbs:sn48.22": "Three faculties: femininity, masculinity, and vitality.",
  "sn-blurbs:sn48.23": "Three faculties relating to stages in the realization of awakening.",
  "sn-blurbs:sn48.24": "Depending on the strength of the five faculties, one is perfected, or reaches a lesser attainment.",
  "sn-blurbs:sn48.25": "Six faculties: eye, ear, nose, tongue, body, and mind.",
  "sn-blurbs:sn48.26": "Six faculties: eye, ear, nose, tongue, body, and mind. One who understand these is a stream-enterer.",
  "sn-blurbs:sn48.27": "Six faculties: eye, ear, nose, tongue, body, and mind. One who is freed by understanding these is perfected.",
  "sn-blurbs:sn48.28": "The Buddha did not claim to be awakened until he realized the origin, the passing, the gratification, the drawback, and the escape regarding the six faculties.",
  "sn-blurbs:sn48.29": "A true ascetic understands the six faculties in terms of gratification, drawback, and escape.",
  "sn-blurbs:sn48.30": "A true ascetic understands the six faculties in terms of the four noble truths.",
  "sn-blurbs:sn48.31": "Five faculties: pleasure, pain, happiness, sadness, and equanimity.",
  "sn-blurbs:sn48.32": "One who understands the gratification, the drawback, and the escape regarding the five faculties of pleasure, pain, happiness, sadness, and equanimity is a stream-enterer.",
  "sn-blurbs:sn48.33": "One who is freed after understanding the gratification, the drawback, and the escape regarding the five faculties of pleasure, pain, happiness, sadness, and equanimity is a perfected one.",
  "sn-blurbs:sn48.34": "A true ascetic understands the five faculties of pleasure, pain, happiness, sadness, and equanimity in terms of the four noble truths.",
  "sn-blurbs:sn48.35": "A true ascetic understands the five faculties of pleasure, pain, happiness, sadness, and equanimity in terms of the four noble truths.",
  "sn-blurbs:sn48.36": "The five faculties of pleasure, pain, happiness, sadness, and equanimity are analyzed in detail.",
  "sn-blurbs:sn48.37": "The five faculties of pleasure, pain, happiness, sadness, and equanimity are analyzed in detail. In addition, each is to be seen in one of the three feelings.",
  "sn-blurbs:sn48.38": "The five faculties of pleasure, pain, happiness, sadness, and equanimity are analyzed in detail. In addition, each is to be seen in one of the three feelings.",
  "sn-blurbs:sn48.39": "The five faculties of pleasure, pain, happiness, sadness, and equanimity arise dependent on the appropriate contact, like sticks making fire.",
  "sn-blurbs:sn48.40": "The five faculties of pleasure, pain, happiness, sadness, and equanimity are taught in a detailed exposition that treats them in an unusual order. The abandoning of each is related to the attainment of a particular meditative absorption.",
  "sn-blurbs:sn48.41": "When Ānanda sees the Buddha’s sense faculties fading, the Buddha speaks on the decrepitude of old age, including verses.",
  "sn-blurbs:sn48.42": "The brahmin Uṇṇābha points out that the five physical sense faculties do not share a common domain, so where do they come together? In the mind. Uṇṇābha pursues the teaching all the way to Nibbāna.",
  "sn-blurbs:sn48.43": "The Buddha discusses the five faculties and the five powers. They are like a river that flows around a central island. From one point of view they can be considered different, but from another they are just the same stream.",
  "sn-blurbs:sn48.44": "Sāriputta does not rely on faith in saying that the five faculties lead to the deathless, for he has seen this for himself.",
  "sn-blurbs:sn48.45": "Having developed wisdom a mendicant may declare their awakening, as wisdom fulfills the other faculties.",
  "sn-blurbs:sn48.46": "Having developed wisdom and immersion a mendicant may declare their awakening.",
  "sn-blurbs:sn48.47": "Having developed energy, mindfulness, immersion, and wisdom a mendicant may declare their awakening.",
  "sn-blurbs:sn48.48": "Having developed faith, energy, mindfulness, immersion, and wisdom a mendicant may declare their awakening.",
  "sn-blurbs:sn48.49": "Having developed mindfulness, immersion, and wisdom the mendicant Piṇḍola Bhāradvāja declared his awakening.",
  "sn-blurbs:sn48.50": "The Buddha asks Sāriputta whether a noble disciple doubts the Buddha. Not only does he have faith, replies Sāriputta, but the other faculties each come to be developed in turn.",
  "sn-blurbs:sn48.51": "Just as the lion is the king of beasts, wisdom is the chief of qualities that lead to awakening.",
  "sn-blurbs:sn48.52": "Only when noble wisdom arises do the other four faculties become stable.",
  "sn-blurbs:sn48.53": "How does someone recognize that they are a trainee? By understanding the four noble truths and the five faculties. But only a perfected one fully embodies these qualities.",
  "sn-blurbs:sn48.54": "Just as all footprints fit into that of an elephant, wisdom is the chief of qualities that lead to awakening.",
  "sn-blurbs:sn48.55": "Just as red sandalwood is the best of fragrances, wisdom is the chief of qualities that lead to awakening.",
  "sn-blurbs:sn48.56": "When established in diligence, the five faculties come to be developed.",
  "sn-blurbs:sn48.57": "Just after the Buddha’s awakening, Brahmā Sahampati supports the Buddha’s reflection that the five faculties lead to the deathless.",
  "sn-blurbs:sn48.58": "A mendicant honors the Realized One and his teaching for the sake of the supreme sanctuary.",
  "sn-blurbs:sn48.59": "The five faculties only arise in the dispensation of a Realized One.",
  "sn-blurbs:sn48.60": "The five faculties only arise in the training of a Holy One.",
  "sn-blurbs:sn51.1": "The four bases of psychic power lead from the near to the far shore.",
  "sn-blurbs:sn51.2": "One who has neglected the four bases of psychic power has neglected the path to the end of suffering.",
  "sn-blurbs:sn51.3": "The four bases of psychic power are noble and emancipating.",
  "sn-blurbs:sn51.4": "The four bases of psychic power lead to dispassion.",
  "sn-blurbs:sn51.5": "Those who have developed psychic powers in part have developed the four bases of psychic power in part.",
  "sn-blurbs:sn51.6": "Those who have developed psychic powers in full have developed the four bases of psychic power in full.",
  "sn-blurbs:sn51.7": "Whatever mendicants realize perfection do so by developing the four bases of psychic power.",
  "sn-blurbs:sn51.8": "It is because of developing the four bases of psychic power that the Realized One is called a Buddha.",
  "sn-blurbs:sn51.9": "On the night of his awakening, understanding and vision came to the Buddha regarding the four bases of psychic power.",
  "sn-blurbs:sn51.10": "The Buddha says he could live to the end of the eon due to developing the four bases of psychic power. But Ānanda doesn’t get the hint.",
  "sn-blurbs:sn51.11": "The Buddha recounts the process of inquiry that lead to him fully understanding the four bases of psychic power, as well as the powers that result from that.",
  "sn-blurbs:sn51.12": "The four bases of psychic power are very beneficial.",
  "sn-blurbs:sn51.13": "An analysis of the four bases of psychic power showing how enthusiasm, energy, higher consciousness, and inquiry work in the context of advanced meditation.",
  "sn-blurbs:sn51.14": "When lazy monks were wasting time, the Buddha asks Moggallāna to stir them up. He shakes with his toe the large building in which they were staying, terrifying the monks. They sought refuge in the Buddha, and he taught them the four bases of psychic power.",
  "sn-blurbs:sn51.15": "Ānanda explains to the brahmin Uṇṇābha that the spiritual path is lived to give up desire through the the four bases of psychic power. But Uṇṇābha says this is a contradiction, as desire is itself one of the four bases. Ānanda resolves the contradiction with the simile of a man walking to a park. ",
  "sn-blurbs:sn51.16": "Whatever ascetics are of great spiritual power have developed the four bases of psychic power.",
  "sn-blurbs:sn51.17": "Whatever ascetics are of great spiritual power have developed the four bases of psychic power.",
  "sn-blurbs:sn51.18": "It is because of developing the four bases of psychic power that a mendicant ends the defilements.",
  "sn-blurbs:sn51.19": "The Buddha distinguishes between psychic powers, the basis for psychic power, and the development of the bases for psychic power.",
  "sn-blurbs:sn51.20": "The Buddha teaches the bases for psychic power and analyzes them in detail.",
  "sn-blurbs:sn51.21": "Before his awakening, the Buddha reflected on the path for developing the bases of psychic power.",
  "sn-blurbs:sn51.22": "Ānanda asks the Buddha whether he travels to the Brahmā realm in a mind-made body or in a physical body. ",
  "sn-blurbs:sn51.23": "It is because of developing the four bases of psychic power that a mendicant ends the defilements.",
  "sn-blurbs:sn51.24": "The four bases for psychic power are desire, energy, higher mind, and inquiry.",
  "sn-blurbs:sn51.25": "The four bases for psychic power lead to perfection or once-return.",
  "sn-blurbs:sn51.26": "The four bases for psychic power lead to seven benefits; perfection or one of the lesser attainments.",
  "sn-blurbs:sn51.27": "The Buddha explains to Ānanda the difference between psychic powers, the basis for psychic power, and the development of the bases for psychic power.",
  "sn-blurbs:sn51.28": "The Buddha explains to Ānanda the difference between psychic powers, the basis for psychic power, and the development of the bases for psychic power.",
  "sn-blurbs:sn51.29": "The Buddha explains to several mendicants the difference between psychic powers, the basis for psychic power, and the development of the bases for psychic power.",
  "sn-blurbs:sn51.30": "The Buddha explains to several mendicants the difference between psychic powers, the basis for psychic power, and the development of the bases for psychic power.",
  "sn-blurbs:sn51.31": "Moggallāna is so very powerful due to developing the four bases for psychic power.",
  "sn-blurbs:sn51.32": "The Realized One is so very powerful due to developing the four bases for psychic power.",
  "sn-blurbs:sn52.1": "While meditating alone, Anuruddha reflected that one who has neglected the four kinds of mindfulness meditation has neglected the path to the end of suffering. Moggallāna reads his mind and visits to question him on this. Anuruddha speaks of developing the four kinds of mindfulness meditation internally and externally, in terms of origin and cessation, and developing power over perceptions.",
  "sn-blurbs:sn52.2": "While meditating alone, Anuruddha reflected that one who has neglected the four kinds of mindfulness meditation has neglected the path to the end of suffering. Moggallāna reads his mind and visits to question him on this. Anuruddha speaks of developing the four kinds of mindfulness meditation internally and externally.",
  "sn-blurbs:sn52.3": "When some mendicants ask Anuruddha how he attained such higher knowledge, he replies it is from developing the four kinds of mindfulness meditation.",
  "sn-blurbs:sn52.4": "Sāriputta and Moggallāna ask Anuruddha what a trainee mendicant should practice. He replies that it is the four kinds of mindfulness meditation.",
  "sn-blurbs:sn52.5": "Sāriputta and Moggallāna ask Anuruddha what an adept mendicant should practice. He replies that it is the four kinds of mindfulness meditation.",
  "sn-blurbs:sn52.6": "When Sāriputta ask Anuruddha how he attained such higher knowledge, he replies it is from developing the four kinds of mindfulness meditation.",
  "sn-blurbs:sn52.7": "The four kinds of mindfulness meditation lead to the ending of craving.",
  "sn-blurbs:sn52.8": "Even if kings beg them to disrobe, a mendicant who has developed the four kinds of mindfulness meditation is unmoved. Their mind flows to Nibbāna like the Ganges to the sea.",
  "sn-blurbs:sn52.9": "Sāriputta asks why Anuruddha looks so peaceful, and he replies it is due to developing the four kinds of mindfulness meditation.",
  "sn-blurbs:sn52.10": "Some mendicants ask Anuruddha how he remains equanimous even though ill. He replies that it is due to the four kinds of mindfulness meditation.",
  "sn-blurbs:sn52.11": "By developing the four kinds of mindfulness meditation Anuruddha surveys a thousand world systems.",
  "sn-blurbs:sn54.1": "Breath meditation is very beneficial. It is developed by going into seclusion, establishing mindfulness on the breath, and proceeding through sixteen stages. ",
  "sn-blurbs:sn54.2": "Breath meditation is very beneficial. It is developed together with the seven factors of awakening.",
  "sn-blurbs:sn54.3": "Breath meditation is very beneficial. It is developed by going into seclusion, establishing mindfulness on the breath, and proceeding through sixteen stages. ",
  "sn-blurbs:sn54.4": "Breath meditation is very beneficial. When developed it leads to perfection or non-return.",
  "sn-blurbs:sn54.5": "Breath meditation is very beneficial. When developed it leads to perfection or one of the lesser attainments.",
  "sn-blurbs:sn54.6": "When the Buddha asks Venerable Ariṭṭha about breath meditation, his answer, while not incorrect, does not do full justice to the practice.",
  "sn-blurbs:sn54.7": "The Buddha sees Venerable Mahākappina meditating nearby and points out that his steadiness and tranquility are due to practicing breath meditation.",
  "sn-blurbs:sn54.8": "Before his awakening the Buddha generally practiced breath meditation, which kept him alert and peaceful and led to the ending of defilements. One who wishes for any of the higher fruits of the renunciate life should practice the same way.",
  "sn-blurbs:sn54.9": "The Buddha taught the meditation on the ugliness of the body, then left to go on retreat. However, many monks, misconstruing the teachings, ending up killing themselves. The Buddha taught breath meditation as a peaceful and pleasant abiding.",
  "sn-blurbs:sn54.10": "When the Buddha asks Venerable Kimbila about breath meditation, he is unable to answer. At Ānanda’s urging, the Buddha explains in detail.",
  "sn-blurbs:sn54.11": "The Buddha goes on a three month retreat, and later says that during that time he mostly practiced breath meditation.",
  "sn-blurbs:sn54.12": "Venerable Lomasavaṅgīsa explains to Mahānāma that the difference between a trainee and the Realized One is that the trainees practice to give up the hindrances, whereas the Realized One has already ended all defilements.",
  "sn-blurbs:sn54.13": "Answering Ānanda, the Buddha explains how one thing fulfills four things, four things fulfill seven things, and seven things fulfill two things.",
  "sn-blurbs:sn54.14": "The Buddha explains to Ānanda how one thing fulfills four things, four things fulfill seven things, and seven things fulfill two things.",
  "sn-blurbs:sn54.15": "Answering some mendicants, the Buddha explains how one thing fulfills four things, four things fulfill seven things, and seven things fulfill two things.",
  "sn-blurbs:sn54.16": "The Buddha explains to some mendicants how one thing fulfills four things, four things fulfill seven things, and seven things fulfill two things.",
  "sn-blurbs:sn55.1": "Even a universal monarch may have a bad rebirth, but someone who has the four factors of stream-entry—experiential faith in the Buddha, the teaching, and the Saṅgha, and ethical conduct—is freed from such destinies.",
  "sn-blurbs:sn55.2": "Someone who has the four factors of stream-entry—experiential faith in the Buddha, the teaching, and the Saṅgha, and ethical conduct—is a stream-enterer, destined for awakening.",
  "sn-blurbs:sn55.3": "The lay follower Dīghāvu is ill and he asks for the Buddha to visit. Dīghāvu confirms that he possesses the four factors of stream-entry and in addition six contemplations leading to insight. Yet he is still worried that his father will miss him when he dies.",
  "sn-blurbs:sn55.4": "Sāriputta explains to Ānanda that someone who has the four factors of stream-entry—experiential faith in the Buddha, the teaching, and the Saṅgha, and ethical conduct—is a stream-enterer, destined for awakening.",
  "sn-blurbs:sn55.5": "The Buddha asks Sāriputta about the four factors for stream-entry: association with good people, hearing the teaching, proper attention, and right practice. He also defines the “stream” and the “stream-enterer”.",
  "sn-blurbs:sn55.6": "After the rainy season, the chamberlains Isidatta and Purāṇa hear that the Buddha is approaching and go to see him. They describe their joy at knowing when the Buddha is approaching, and speak of their special duties guarding the royal harem. The Buddha says they have four factors of stream-entry—experiential faith in the Buddha, the teaching, and the Saṅgha; and here generosity rather than ethics as the final factor.",
  "sn-blurbs:sn55.7": "The brahmin householders of Bamboo Gate ask the Buddha how to live well in the home. The Buddha teaches them seven principles they can apply to themselves, which are practical applications of the Golden Rule. Someone with these seven principles and the four factors of stream-entry is a stream-enterer.",
  "sn-blurbs:sn55.8": "Ānanda asks the Buddha about the rebirths of several disciples. The Buddha confirms those details, and proposes a way for people to know for themselves by reflecting on the four factors of stream-entry.",
  "sn-blurbs:sn55.9": "Ānanda asks the Buddha about the rebirths of several disciples. The Buddha confirms those details, and proposes a way for people to know for themselves by reflecting on the four factors of stream-entry.",
  "sn-blurbs:sn55.10": "Ānanda asks the Buddha about the rebirths of several disciples. The Buddha confirms those details, and proposes a way for people to know for themselves by reflecting on the four factors of stream-entry.",
  "sn-blurbs:sn55.11": "The Buddha teaches a thousand nuns the four factors of stream-entry.",
  "sn-blurbs:sn55.12": "The Buddha contrasts a foolish brahmanical ritual called “going upwards” with the four factors of stream-entry.",
  "sn-blurbs:sn55.13": "Sāriputta asks Ānanda how many things are given up and how many things possessed by the stream-enterer. ",
  "sn-blurbs:sn55.14": "A noble disciple has transcended fears of a bad rebirth.",
  "sn-blurbs:sn55.15": "A noble disciple has transcended fears of a bad rebirth.",
  "sn-blurbs:sn55.16": "You should encourage your friends in the four factors of stream-entry.",
  "sn-blurbs:sn55.17": "You should encourage your friends in the four factors of stream-entry.",
  "sn-blurbs:sn55.18": "Moggallāna visits the gods of the Thirty-Three and encourages them in the four factors of stream-entry.",
  "sn-blurbs:sn55.19": "Moggallāna visits the gods of the Thirty-Three and encourages them in the four factors of stream-entry.",
  "sn-blurbs:sn55.20": "The Buddha visits the gods of the Thirty-Three and encourages them in the four factors of stream-entry.",
  "sn-blurbs:sn55.21": "Mahānāma the Sakyan expresses his fear that if he dies unmindful he may go to a bad rebirth. The Buddha tells him not to fear, as he will definitely go to a good place, since he has long practiced the Dhamma.",
  "sn-blurbs:sn55.22": "Mahānāma the Sakyan expresses his fear that if he dies unmindful he may go to a bad rebirth. The Buddha tells him not to fear, as he will definitely go to a good place, since he has the four factors of stream-entry.",
  "sn-blurbs:sn55.23": "Mahānāma and Godhā the Sakyans discuss whether a stream-enterer has three or four factors. They go to the Buddha to settle it, and Mahānāma testifies to his faith.",
  "sn-blurbs:sn55.24": "When Sarakāni the Sakyan died the Buddha declared him a stream-enterer. But others complained, since he was known as a drinker. However, the Buddha confirmed to Mahānāma that Sarakāni had undertaken the precepts on his deathbed.",
  "sn-blurbs:sn55.25": "When Sarakāni the Sakyan died the Buddha declared him a stream-enterer. But others complained, since he was known as a drinker. However, the Buddha confirmed to Mahānāma that Sarakāni had undertaken the precepts on his deathbed.",
  "sn-blurbs:sn55.26": "When the householder Anāthapiṇḍika was sick, Sāriputta reminds him of his considerable accomplishments in the Dhamma, analyzing stream-entry in ten factors, at which Anāthapiṇḍika recovers. Later he invited Sāriputta and Ānanda for a meal, and Sāriputta thanked him with verses.",
  "sn-blurbs:sn55.27": "When the householder Anāthapiṇḍika was sick, Ānanda reminds him of the four factors of stream-entry, which Anāthapiṇḍika claims to possess.",
  "sn-blurbs:sn55.28": "A noble disciple who is a layperson has eliminated the fear that comes from breaking precepts, possesses the four factors of stream-entry, and understands dependent origination.",
  "sn-blurbs:sn55.29": "A noble disciple who is a layperson has eliminated the fear that comes from breaking precepts, possesses the four factors of stream-entry, and understands dependent origination.",
  "sn-blurbs:sn55.30": "The Buddha teaches the four factors of stream-entry to Nandaka, the minister of the Licchavis. When his servant tells him it is time for his ritual bath, he says that the inner bathing of the Dhamma is enough.",
  "sn-blurbs:sn55.31": "The four factors of stream-entry—with ethics as the fourth—are streams of merit.",
  "sn-blurbs:sn55.32": "The four factors of stream-entry—with generosity as the fourth—are streams of merit.",
  "sn-blurbs:sn55.33": "The four factors of stream-entry—with wisdom as the fourth—are streams of merit.",
  "sn-blurbs:sn55.34": "The four factors of stream-entry are footprints of the gods.",
  "sn-blurbs:sn55.35": "The four factors of stream-entry are footprints of the gods, for the gods hold non-violence as supreme.",
  "sn-blurbs:sn55.36": "When a person possesses the four factors of stream-entry, the gods regard them as similar to themselves.",
  "sn-blurbs:sn55.37": "The Buddha explains to Mahānāma what is a lay follower, what is a virtuous lay follower, and a lay follower accomplished in faith, generosity, and wisdom.",
  "sn-blurbs:sn55.38": "Like rain falling on the mountain top, the four factors of stream-entry flow on to the ending of defilements.",
  "sn-blurbs:sn55.39": "Kāḷigodhā the Sakyan lady confirms to the Buddha that she possesses the four factors of stream-entry.",
  "sn-blurbs:sn55.40": "Someone who completely lacks the four factors of stream-entry is an ordinary person. But even a stream-enterer may be negligent if they do not make further effort in meditation.",
  "sn-blurbs:sn55.41": "The four factors of stream-entry—with ethics as the fourth—are streams of merit, and like the ocean cannot be counted. With verses.",
  "sn-blurbs:sn55.42": "The four factors of stream-entry—with generosity as the fourth—are streams of merit, and like the ocean cannot be counted. With verses.",
  "sn-blurbs:sn55.43": "The four factors of stream-entry—with wisdom as the fourth—are streams of merit, and like the ocean cannot be counted. With verses.",
  "sn-blurbs:sn55.44": "A noble disciple with the four factors of stream-entry is said to be prosperous.",
  "sn-blurbs:sn55.45": "A noble disciple with the four factors of stream-entry is said to be prosperous.",
  "sn-blurbs:sn55.46": "A noble disciple with the four factors of stream-entry is a stream-enterer.",
  "sn-blurbs:sn55.47": "A noble disciple with the four factors of stream-entry is a stream-enterer.",
  "sn-blurbs:sn55.48": "A noble disciple with the four factors of stream-entry is a stream-enterer.",
  "sn-blurbs:sn55.49": "A noble disciple with the four factors of stream-entry is a stream-enterer.",
  "sn-blurbs:sn55.50": "Four factors for stream-entry: association with good people, hearing the teaching, proper attention, and right practice.",
  "sn-blurbs:sn55.51": "A noble disciple with the four factors of stream-entry is a stream-enterer. With verses.",
  "sn-blurbs:sn55.52": "When a monk comes from Sāvatthī to Kapilavatthu, the Sakyans visit him and ask as to the health of the Buddha and the Saṅgha. Then they ask what the monk has learned. He replies that the number of perfected ones is few, and those on lower levels of attainment are greater in number.",
  "sn-blurbs:sn55.53": "The lay follower Dhammadinna leads a group of 500 to visit the Buddha. He encourages them to study deep discourses, but they protest that they don’t have enough time. So the Buddha encourages them in the four factors of stream-entry.",
  "sn-blurbs:sn55.54": "Mahānāma asks the Buddha how a lay follower should teach a wise lay follower who is ill. He should first be encouraged in the four factors of stream-entry, and then urged to let go of attachments, until he realizes full freedom.",
  "sn-blurbs:sn55.55": "Association with good people, hearing the teaching, proper attention, and right practice lead to the fruit of stream-entry.",
  "sn-blurbs:sn56.1": "Mendicants should develop immersion so as to understand the four noble truths: suffering, its origin, its cessation, and the path.",
  "sn-blurbs:sn56.2": "Mendicants should develop seclusion so as to understand the four noble truths.",
  "sn-blurbs:sn56.3": "Members of good families go forth to understand the four noble truths.",
  "sn-blurbs:sn56.4": "Members of good families go forth to penetrate the four noble truths.",
  "sn-blurbs:sn56.5": "True ascetics understand the four noble truths.",
  "sn-blurbs:sn56.6": "True ascetics become awakened through understanding the four noble truths.",
  "sn-blurbs:sn56.7": "Don’t think bad thoughts. Instead, think of the four noble truths.",
  "sn-blurbs:sn56.8": "Don’t think in useless ways. Instead, reflect on the four noble truths.",
  "sn-blurbs:sn56.9": "Don’t argue. Instead, converse on the four noble truths.",
  "sn-blurbs:sn56.10": "Don’t gossip. Instead, talk about the four noble truths.",
  "sn-blurbs:sn56.11": "The famous first discourse, taught at Varanasi to the group of five ascetics. It begins by rejecting the extremes of asceticism and indulgence and recommends the middle way of the eightfold path. Then it defines the four noble truths and analyzes them in twelve aspects. It ends with Venerable Kondañña becoming the first person apart from the Buddha to realize the Dhamma.",
  "sn-blurbs:sn56.12": "All Realized Ones understand the four noble truths in their twelve aspects.",
  "sn-blurbs:sn56.13": "The four noble truths are defined, with the five aggregates under the truth of suffering.",
  "sn-blurbs:sn56.14": "The four noble truths are defined, with the six sense fields under the truth of suffering.",
  "sn-blurbs:sn56.15": "The Buddha asks the mendicants how they remember the four noble truths.",
  "sn-blurbs:sn56.16": "The Buddha asks the mendicants how they remember the four noble truths.",
  "sn-blurbs:sn56.17": "Ignorance is not knowing the four noble truths.",
  "sn-blurbs:sn56.18": "Understanding is knowing the four noble truths.",
  "sn-blurbs:sn56.19": "Each of the four noble truths has innumerable implications.",
  "sn-blurbs:sn56.20": "Each of the four noble truths is real, not otherwise.",
  "sn-blurbs:sn56.21": "It is because of not understanding the four noble truths that both the Buddha and others have wandered for so long in transmigration. With verses.",
  "sn-blurbs:sn56.22": "True ascetics understand the four noble truths. With verses.",
  "sn-blurbs:sn56.23": "The Realized One is called the Buddha because he understands the four noble truths.",
  "sn-blurbs:sn56.24": "All Buddhas become awakened through the four noble truths.",
  "sn-blurbs:sn56.25": "Only by knowing and seeing the four noble truths are the defilements ended.",
  "sn-blurbs:sn56.26": "You should encourage your friends in the four noble truths.",
  "sn-blurbs:sn56.27": "The four noble truths is real, not otherwise, that is why they are noble.",
  "sn-blurbs:sn56.28": "In this world, the Realized One is the noble one, that is why the four truths are noble.",
  "sn-blurbs:sn56.29": "The first truth is to be understood; the second is to be given up; the third is to be realized; and the fourth is to be developed.",
  "sn-blurbs:sn56.30": "Some mendicants are discussing whether the four truths are necessarily seen together. Venerable Gavampati asserts that he has learned it from the Buddha that they are: if you see one, you see them all.",
  "sn-blurbs:sn56.31": "In a siṁsapā grove, the Buddha holds up a handful of leaves, and compares it to all the leaves in the forest. So too, he has taught the four noble truths, which is only a fraction of what he knows.",
  "sn-blurbs:sn56.32": "Just as it’s impossible to keep water in a basket of pine needles, it’s impossible to end suffering without penetrating the four noble truths.",
  "sn-blurbs:sn56.33": "Beings who have not seen the four noble truths roam on from one birth to another, like a stick thrown end to end. ",
  "sn-blurbs:sn56.34": "Even more than if your clothes are on fire, you should make an effort to understand the four noble truths.",
  "sn-blurbs:sn56.35": "Even more than if you’re being tortured with spikes, you should make an effort to understand the four noble truths.",
  "sn-blurbs:sn56.36": "The small creatures in the ocean are greater in number than all the foliage in the jungles of India. Still, your rebirths are more than this.",
  "sn-blurbs:sn56.37": "As the dawn precedes the sunrise, right view precedes the penetration of the four noble truths.",
  "sn-blurbs:sn56.38": "As long as there are no sun and moon, the world is in darkness. So too, as long as the Realized One has not arisen and declared the four noble truths, the world is in darkness.",
  "sn-blurbs:sn56.39": "One who has not seen the four noble truths is as feeble as a tuft of cotton wool, while one who has seen them is like a deep-rooted pillar.",
  "sn-blurbs:sn56.40": "No-one can refute you if you are well grounded in the four noble truths.",
  "sn-blurbs:sn56.41": "The Buddha tells the curious tale of a man who sat by a lotus pond to speculate about the world, and saw an army enter a lotus stalk. He thought he was going mad. The Buddha said that no, the army was real. Nevertheless, you should not speculate about such things, but should reflect on the four noble truths.",
  "sn-blurbs:sn56.42": "The Buddha takes the mendicants to a steep precipice, and points out that those who do not understand the four noble truths fall into a still deeper precipice.",
  "sn-blurbs:sn56.43": "The Buddha speaks of a hell called the great inferno, and points out that those who do not understand the four noble truths fall into a still fiercer inferno.",
  "sn-blurbs:sn56.44": "Just as it’s impossible to climb the upper floor without building the lower floors first, it’s impossible to end suffering without penetrating the four noble truths.",
  "sn-blurbs:sn56.45": "Ānanda sees Licchavi youths shoot arrows through keyholes. But seeing the four noble truths is even harder.",
  "sn-blurbs:sn56.46": "Interstellar space is dark and empty; but not seeing the four noble truths is even worse.",
  "sn-blurbs:sn56.47": "A blind turtle would put its head through a yoke with a hole in it floating in the ocean sooner than someone in the lower realms would be reborn as a human.",
  "sn-blurbs:sn56.48": "A blind turtle would put its head through a yoke with a hole in it floating in the ocean sooner than someone in the lower realms would be reborn as a human.",
  "sn-blurbs:sn56.49": "As seven bits of gravel are smaller than Mount Sineru, so is the suffering remaining to one who has seen the four noble truths.",
  "sn-blurbs:sn56.50": "As seven bits of gravel are smaller than Mount Sineru, so is the suffering remaining to one who has seen the four noble truths.",
  "sn-blurbs:sn56.51": "As a bit of dirt under a nail compared to the whole earth, so is the suffering remaining to one who has seen the four noble truths.",
  "sn-blurbs:sn56.52": "As a drop of water on a blade of grass compared to a massive dam, so is the suffering remaining to one who has seen the four noble truths.",
  "sn-blurbs:sn56.53": "As a few drops of water compared to the confluence of great rivers, so is the suffering remaining to one who has seen the four noble truths.",
  "sn-blurbs:sn56.54": "As a few drops of water compared to confluence of the great rivers, so is the suffering remaining to one who has seen the four noble truths.",
  "sn-blurbs:sn56.55": "As a few jujube seeds compared to the great earth, so is the suffering remaining to one who has seen the four noble truths.",
  "sn-blurbs:sn56.56": "As a few jujube seeds compared to the great earth, so is the suffering remaining to one who has seen the four noble truths.",
  "sn-blurbs:sn56.57": "As a few drops of water compared to the ocean, so is the suffering remaining to one who has seen the four noble truths.",
  "sn-blurbs:sn56.58": "As a few drops of water compared to the ocean, so is the suffering remaining to one who has seen the four noble truths.",
  "sn-blurbs:sn56.59": "As seven bits of gravel are smaller than the Himalayas, so is the suffering remaining to one who has seen the four noble truths.",
  "sn-blurbs:sn56.60": "As seven bits of gravel are smaller than the Himalayas, so is the suffering remaining to one who has seen the four noble truths."
}