{
  "snp-blurbs:snp-uragavagga": "Twelve poems beginning with a set of similes comparing a liberated one with a serpent who sheds its skin. The poems are diverse in style and content, and appear to have been collected from different sources. This chapter includes many perennial favorites such as the Mettā Sutta on Love and the warnings of the Parābhava Sutta on downfalls.",
  "snp-blurbs:snp1.1": "One who advances far along the path sloughs off the near shore and far, like a snake who sloughs off its skin.",
  "snp-blurbs:snp1.2": "A poetic dialogue contrasting the wealth and security of lay life with the wealth and security of a person who has lived the renunciate life to its culmination. If you have trouble relating to someone like Dhaniya who measures his wealth in cattle, then when reading this poem substitute stocks and bonds for cows and bulls, and economic downturn for rain.",
  "snp-blurbs:snp1.3": "If you can’t find a good teacher, it’s better to wander alone.",
  "snp-blurbs:snp1.4": "The Buddha answers a farmer who claims that monks do no useful work and so don’t deserve to eat.",
  "snp-blurbs:snp1.5": "Four different types of contemplatives and how to recognize them.",
  "snp-blurbs:snp1.6": "The various actions and attitudes that lead to spiritual decline.",
  "snp-blurbs:snp1.7": "Being an outcaste is a matter of behavior, not birth.",
  "snp-blurbs:snp1.8": "The practice of developing universal goodwill: the practices that form a foundation for the practice, the attitude of universal goodwill itself, and the steps that lead from goodwill to awakening.",
  "snp-blurbs:snp1.9": "The Buddha explains to a yakkha how one crosses over the flood.",
  "snp-blurbs:snp1.10": "A yakkha challenges the Buddha with riddles and threatens to “hurl out his mind, rip open his heart, or hurl him across the River Ganges” if he doesn’t solve the riddles to the yakkha’s satisfaction.",
  "snp-blurbs:snp1.11": "Victory over the defilements through contemplation of the unattractiveness of the body.",
  "snp-blurbs:snp1.12": "The characteristics of the ideal sage, who finds happiness and security in living the solitary life. (This sutta is apparently one of the series of passages that King Asoka recommended for study and reflection by all practicing Buddhists.)",
  "snp-blurbs:snp-culavagga": "Thirteen diverse poems similar to the previous chapter.",
  "snp-blurbs:snp2.1": "The many treasures to be found in the Triple Gem.",
  "snp-blurbs:snp2.2": "People are defiled, not by eating meat, but by engaging in evil conduct.",
  "snp-blurbs:snp2.3": "How to recognize a true friend.",
  "snp-blurbs:snp2.4": "A list of the types of skillful behavior that give blessings and protection.",
  "snp-blurbs:snp2.5": "Another yakkha challenges the Buddha with riddles and threatens to “hurl out his mind, rip open his heart, or hurl him across the River Ganges” if he doesn’t solve the riddles to the yakkha’s satisfaction.",
  "snp-blurbs:snp2.6": "The Buddha encourages the monks to avoid monks who are evil in their desires.",
  "snp-blurbs:snp2.7": "How brahmans, through greed, abandoned the good principles of their ancestors.",
  "snp-blurbs:snp2.8": "A good teacher, like a good boatman, is one who knows firsthand how to cross to the further shore.",
  "snp-blurbs:snp2.9": "The attitudes and behavior that enable one best to learn and benefit from the Dhamma.",
  "snp-blurbs:snp2.10": "Get up! Don’t let the opportunity for practice pass you by.",
  "snp-blurbs:snp2.11": "Rāhula reflects on the teachings he received from his father, the Buddha.",
  "snp-blurbs:snp2.12": "Vaṅgīsa, the foremost poet among the Buddha’s disciples, praises the Buddha in verse.",
  "snp-blurbs:snp2.13": "The sort of person who, having gone forth, is fit to wander through the world.",
  "snp-blurbs:snp2.14": "The proper code of conduct for lay followers of the Dhamma.",
  "snp-blurbs:snp-mahavagga": "Twelve longer poems that expand into sometimes legendary narrative. The first two discourses and the Nalaka Sutta offer early glimpses at crucial episodes in the Buddha’s life. While some of these poems are found elsewhere in the canon, the Dvayatānupassanā offers a unique perspective on dependent origination and other topics typically found in prose texts.",
  "snp-blurbs:snp3.1": "The young Bodhisatta (Buddha-to-be), soon after leaving home, explains why he refuses King Bimbisāra’s offer of a position in his court.",
  "snp-blurbs:snp3.2": "Māra attempts to dissuade the Bodhisatta from his path.",
  "snp-blurbs:snp3.3": "Four characteristics of well-spoken speech.",
  "snp-blurbs:snp3.4": "A brahman questions the Buddha to see if the latter deserves to receive the cake resulting from his sacrifice.",
  "snp-blurbs:snp3.5": "What are the qualities of a recipient that produce the most merit from a gift?",
  "snp-blurbs:snp3.6": "A sutta dating from early in the Buddha’s teaching career. A wanderer, disappointed in the teachings he has received from other teachers, approaches the Buddha with his questions.",
  "snp-blurbs:snp3.7": "Sela the brahman praises the Buddha to see how the latter responds to praise.",
  "snp-blurbs:snp3.8": "Death and loss are inevitable, but grief is not.",
  "snp-blurbs:snp3.9": "Is one worthy of respect because of one’s birth, or because of one’s actions?",
  "snp-blurbs:snp3.10": "A follower of Devadatta slanders Ven. Sāriputta and Ven. Moggallāna and, after suffering a painful disease, falls into hell. The sutta then gives a graphic description of the sufferings awaiting him there.",
  "snp-blurbs:snp3.11": "A sutta in two parts. The first part gives an account of events soon after the birth of the Bodhisatta. The second part describes the way of the sage.",
  "snp-blurbs:snp3.12": "Not all dualities are misleading. This sutta teaches ways to contemplate the duality of the origination and cessation of stress and suffering so as to reach awakening.",
  "snp-blurbs:snp-atthakavagga": "This chapter, which has parallels in Chinese, and received an early commentary in the Niddesa, is often regarded as one of the earliest texts in the canon. Shorn of literary embellishments, it is direct and  powerful. A distinctive aspect is the critique of meaningless debates and attachments to views. The Attadaṇḍa Sutta gives an alternative account of the reasons for the Buddha’s going forth.",
  "snp-blurbs:snp4.1": "The drawbacks of sensual desires.",
  "snp-blurbs:snp4.2": "Those who remain attached to the body, to sensuality, and to their sense of “mine” will have a hard time freeing themselves from fear of death and from further becoming.",
  "snp-blurbs:snp4.3": "Freedom isn’t to be found by boasting of your precepts and practices or by debating your views.",
  "snp-blurbs:snp4.4": "How to avoid the trap of letting go of one thing only to cling to something more subtle.",
  "snp-blurbs:snp4.5": "The conceit that comes from clinging to practices or views—even if they’re supreme—is a fetter preventing full freedom.",
  "snp-blurbs:snp4.6": "Life is short. Possessiveness brings grief. Freedom comes from abandoning any sense of “mine.”",
  "snp-blurbs:snp4.7": "The drawbacks of falling away from the celibate life.",
  "snp-blurbs:snp4.8": "The drawbacks of engaging in debates, for winners and losers alike.",
  "snp-blurbs:snp4.9": "Māgandiya offers the Buddha his daughter in marriage. The Buddha refuses and further subdues Māgandiya’s pride by describing a state of peace that Māgandiya doesn’t understand.",
  "snp-blurbs:snp4.10": "How to live at peace.",
  "snp-blurbs:snp4.11": "The Buddha is questioned on the source of quarrels and disputes, and on the highest level of spiritual attainment.",
  "snp-blurbs:snp4.12": "If the truth is one, how should a person behave in a world where many different truths are taught?",
  "snp-blurbs:snp4.13": "How to maintain freedom in a world full of disputes.",
  "snp-blurbs:snp4.14": "The attitudes and behavior of a monk training for the sake of total release.",
  "snp-blurbs:snp4.15": "The Buddha speaks in poignant terms of the saṁvega that led him to leave the household life. He concludes with recommendations for practice and a description of the person who has attained the goal of true peace and security.",
  "snp-blurbs:snp4.16": "When a monk, disaffected with the world, takes up the life of seclusion, what fears should he overcome? What dangers should he beware of? How should he train to blow away the impurities in his heart?",
  "snp-blurbs:snp-parayanavagga": "This is perhaps the most sophisticated and moving poetic composition in early Buddhism. It begins with a brahmin, suffering an unwanted curse, who sends his students to seek the Buddha. At the end of a long journey they ask questions, the nature of which indicate their subtle philosophy and deep meditation. It concludes with an emotional declaration of faith and determination.",
  "snp-blurbs:snp5.1": "A brahman teacher sends his students to the Buddha to see if the latter is truly awakened.",
  "snp-blurbs:snp5.2": "A brahman questions the Buddha about mindfulness, discernment, and the cessation of name-and-form.",
  "snp-blurbs:snp5.3": "Who in the world is truly contented, truly free, truly a great person?",
  "snp-blurbs:snp5.4": "Birth and aging can be overcome, not through sacrificial rituals, but through training the mind to go beyond perturbation.",
  "snp-blurbs:snp5.5": "How does one cross the flood of birth and old age, sorrow and grief?",
  "snp-blurbs:snp5.6": "How can one become freed of all doubt?",
  "snp-blurbs:snp5.7": "What support should one hold on to in order to cross over the flood of craving? Can an awakened person be described?",
  "snp-blurbs:snp5.8": "Who deserves to be called a sage? Who has crossed over birth and aging?",
  "snp-blurbs:snp5.9": "How do you cross over entanglements in the world?",
  "snp-blurbs:snp5.10": "How to recognize an emancipated person.",
  "snp-blurbs:snp5.11": "What is the island above the flood of the great danger of birth?",
  "snp-blurbs:snp5.12": "How does one abandon birth and aging?",
  "snp-blurbs:snp5.13": "Bhadrāvudha asks the Buddha: How did you come to know the Dhamma?",
  "snp-blurbs:snp5.14": "How to reach unbinding and bring consciousness to a halt.",
  "snp-blurbs:snp5.15": "How to develop insight after mastering the perception of nothingness.",
  "snp-blurbs:snp5.16": "How should one view the world so as to escape the king of Death?",
  "snp-blurbs:snp5.17": "Alarmed by the deterioration of his aging body, Piṅgiya asks the Buddha how to conquer birth and decay.",
  "snp-blurbs:snp5.18": "The questions and events are summarized.",
  "snp-blurbs:snp5.19": "Piṅgiya, after becoming a non-returner, explains to his former teacher his devotion to the Buddha."
}