{
  "ud-blurbs:ud-bodhivagga": "This chapter begins with a series of discourses set immediately after the Buddha’s awakening, which are shared with the first chapter of the Khandhakas. It establishes the fundamental thesis of Buddhism: that awakening is possible through one’s own efforts. Each discourse deals with the idea of the true “brahmin”, defined not according to hereditary caste, but freedom from defilements.",
  "ud-blurbs:ud1.1": "The Buddha, soon after awakening, contemplates specific conditionality and dependent co-arising.",
  "ud-blurbs:ud1.2": "The Buddha, soon after awakening, contemplates specific conditionality and dependent co-arising.",
  "ud-blurbs:ud1.3": "The Buddha, soon after awakening, contemplates specific conditionality and dependent co-arising.",
  "ud-blurbs:ud1.4": "A truly excellent person doesn’t display pride.",
  "ud-blurbs:ud1.5": "The Buddha redefines the term “brahmin” to mean anyone, regardless of birth, who is awakened.",
  "ud-blurbs:ud1.6": "Ven. Mahā Kassapa chooses to go for alms among the poor rather than among the devas.",
  "ud-blurbs:ud1.7": "An awakened person has gone beyond fear.",
  "ud-blurbs:ud1.8": "A monk’s former wife tries to use their child to lure him back into the lay life.",
  "ud-blurbs:ud1.9": "The mind is cleansed and purified, not by ablutions, but by truth and rectitude.",
  "ud-blurbs:ud1.10": "The ascetic Bāhiya becomes an arahant after receiving a brief teaching about adding nothing to sensory experience.",
  "ud-blurbs:ud-mucalindavagga": "The Buddha’s awakening has shown him a spiritual happiness that is better than any worldly happiness. This chapter focusses on the emotional dimension of enlightenment.",
  "ud-blurbs:ud2.1": "Shortly after the Buddha’s awakening, a dragon protects him from a storm.",
  "ud-blurbs:ud2.2": "When monks have gathered, they shouldn’t spend their time gossiping about kings.",
  "ud-blurbs:ud2.3": "A lesson to young boys: If you don’t want to suffer from pain, don’t inflict pain on other beings.",
  "ud-blurbs:ud2.4": "On how to deal with abusive language.",
  "ud-blurbs:ud2.5": "The drawbacks of having.",
  "ud-blurbs:ud2.6": "More drawbacks of having.",
  "ud-blurbs:ud2.7": "The sorrow that comes from having those who are dear.",
  "ud-blurbs:ud2.8": "After a long and difficult pregnancy, Suppavāsā invites the Buddha and the Sangha for a meal.",
  "ud-blurbs:ud2.9": "The drawbacks of having to do business with kings.",
  "ud-blurbs:ud2.10": "A former king, now monk, exclaims over the bliss of solitude.",
  "ud-blurbs:ud-nandavagga": "The discourses in this chapter focus on equanimity in the face of pleasure and pain. There are several examples of monastic conduct of poise and balance.",
  "ud-blurbs:ud3.1": "A monk meditates in pain engendered by past kamma but without being struck down by it.",
  "ud-blurbs:ud3.2": "The Buddha makes a deal with his step-brother: Stay a monk, and you’ll be rewarded with nymphs in the next life.",
  "ud-blurbs:ud3.3": "A group of monks, rebuked by the Buddha, take it as an encouragement to reach awakening.",
  "ud-blurbs:ud3.4": "Ven. Sāriputta meditates, his mind as solid as rock.",
  "ud-blurbs:ud3.5": "Ven. Mahā Moggallāna meditates.",
  "ud-blurbs:ud3.6": "Some old habits die hard.",
  "ud-blurbs:ud3.7": "A deva-king disguises himself to give alms to Ven. Mahā Kassapa.",
  "ud-blurbs:ud3.8": "The Buddha rebukes monks who are chatting about the agreeable things that one can encounter on almsround.",
  "ud-blurbs:ud3.9": "More lessons in what monks should and shouldn’t talk about.",
  "ud-blurbs:ud3.10": "Shortly after awakening, the Buddha contemplates future rebirth.",
  "ud-blurbs:ud-meghiyavagga": "If a practitioner fails to achieve such balance, their undisciplined mind leads to harming themselves and others.",
  "ud-blurbs:ud4.1": "A monk leaves the Buddha to go into solitude, only to find his mind overcome by unskillful thoughts.",
  "ud-blurbs:ud4.2": "The need to protect body and mind.",
  "ud-blurbs:ud4.3": "A cowherd is murdered after presenting a meal to the Buddha and the Sangha.",
  "ud-blurbs:ud4.4": "A spirit gives Ven. Sāriputta a blow on the head.",
  "ud-blurbs:ud4.5": "The Buddha, hemmed in by his followers, goes into seclusion.",
  "ud-blurbs:ud4.6": "Ven. Piṇḍola Bhāradvāja meditates.",
  "ud-blurbs:ud4.7": "Ven. Sāriputta meditates.",
  "ud-blurbs:ud4.8": "Wanderers of other sects kill a woman and blame her murder on the Sangha.",
  "ud-blurbs:ud4.9": "Ven. Upasena Vaṅgantaputta contemplates: “Fortunate has been my life; fortunate will be my death.”",
  "ud-blurbs:ud4.10": "Ven. Sāriputta meditates.",
  "ud-blurbs:ud-sonavagga": "Broadening the focus from the individual practitioner, this chapter deals with the “all”, and shows how the Dhamma is inclusive of all beings, from kings to little fish.",
  "ud-blurbs:ud5.1": "King Pasenadi asks his queen, “Is there anyone dearer to you than yourself?”",
  "ud-blurbs:ud5.2": "Ven. Ānanda comments on how the Buddha’s mother died shortly after his birth.",
  "ud-blurbs:ud5.3": "A leper becomes a stream-enterer, dies, and is reborn as a deva.",
  "ud-blurbs:ud5.4": "A lesson to young boys: If you don’t want to suffer from pain, don’t inflict pain on other beings.",
  "ud-blurbs:ud5.5": "Ven. Mahā Moggallāna expels a sham monk from a meeting of the Sangha.",
  "ud-blurbs:ud5.6": "A young man in a remote part of India is able to ordain only after many delays.",
  "ud-blurbs:ud5.7": "Ven. Revata meditates.",
  "ud-blurbs:ud5.8": "Devadatta announces that he will cause a split in the Sangha.",
  "ud-blurbs:ud5.9": "A group of youths jeer at the monks.",
  "ud-blurbs:ud5.10": "Ven. Cūḷa Panthaka meditates.",
  "ud-blurbs:ud-jaccandhavagga": "Returning to stories about the Buddha’s life, this chapter skips ahead to near the end. Meanwhile, it reminds us of those who have lost their way.",
  "ud-blurbs:ud6.1": "The Buddha relinquishes the forces that will keep him living.",
  "ud-blurbs:ud6.2": "How to know another person’s character.",
  "ud-blurbs:ud6.3": "The Buddha reflects on the unskillful qualities that he has abandoned.",
  "ud-blurbs:ud6.4": "The blind people and the elephant.",
  "ud-blurbs:ud6.5": "Wanderers of other sects dispute over the self, pleasure, pain, and the nature of the world.",
  "ud-blurbs:ud6.6": "Wanderers of other sects dispute over the self, pleasure, pain, and the nature of the world.",
  "ud-blurbs:ud6.7": "Ven. Subhūti meditates.",
  "ud-blurbs:ud6.8": "Two factions fight over a courtesan.",
  "ud-blurbs:ud6.9": "Insects fly into the flames of lamps set out at night.",
  "ud-blurbs:ud6.10": "Other sectarians shine only as long as a Buddha hasn’t appeared in the world.",
  "ud-blurbs:ud-culavagga": "This chapter returns to the awakening of the Buddha, and employing water-based imagery, it reinforces the power of the Dhamma to carry us across the flood.",
  "ud-blurbs:ud7.1": "A dwarf becomes an arahant.",
  "ud-blurbs:ud7.2": "Ven. Sāriputta doesn’t realize that his listener has already become an arahant.",
  "ud-blurbs:ud7.3": "Attachment to sensual pleasures keeps you from crossing over the flood.",
  "ud-blurbs:ud7.4": "Attachment to sensual pleasures keeps you trapped like a fish.",
  "ud-blurbs:ud7.5": "Inner and outer beauty.",
  "ud-blurbs:ud7.6": "Ven. Aññata Koṇḍañña meditates.",
  "ud-blurbs:ud7.7": "The Buddha contemplates his own abandoning of the perceptions and categories of proliferation.",
  "ud-blurbs:ud7.8": "Ven. Mahā Kaccāyana meditates.",
  "ud-blurbs:ud7.9": "Wanderers of other sects try to keep the Buddha from drinking the water in a well.",
  "ud-blurbs:ud7.10": "Five hundred awakened women die in a fire.",
  "ud-blurbs:ud-pataligamiyavagga": "The final chapter deals with the Buddha’s final passing away and the crisis of faith that this created. It begins with series of solemn declarations on Nibbana and ends with the spectacular passing of the monk Dabba. ",
  "ud-blurbs:ud8.1": "The nature of extinguishment.",
  "ud-blurbs:ud8.2": "On seeing extinguishment.",
  "ud-blurbs:ud8.3": "The escape from conditions is areal.",
  "ud-blurbs:ud8.4": "Extinguishment as independence.",
  "ud-blurbs:ud8.5": "The Buddha’s last meal.",
  "ud-blurbs:ud8.6": "The rewards of virtue and of dedicating merit to the devas.",
  "ud-blurbs:ud8.7": "One of the Buddha’s attendants disobeys him.",
  "ud-blurbs:ud8.8": "Lady Visākhā wishes for many grandchildren.",
  "ud-blurbs:ud8.9": "Ven. Dabba Mallaputta performs a miracle on his death.",
  "ud-blurbs:ud8.10": "There’s no destination to describe for those rightly released."
}