{
  "vv-blurbs:vv-itthivimana": "",
  "vv-blurbs:vv-pithavagga": "",
  "vv-blurbs:vv1": "Arahant Moggallana asks a deva about previous good karma.",
  "vv-blurbs:vv2": "Giving always gives results.",
  "vv-blurbs:vv3": "Even offering a simple thing to the Sangha can give great results.",
  "vv-blurbs:vv4": "Arahant Moggallana asks a deva how he received a throne made of beryl gemstones.",
  "vv-blurbs:vv5": "Offering a chair with a confident heart to those free from defilements will bring great happiness.",
  "vv-blurbs:vv6": "Arahant Moggallana asks a deva how she gained a golden roofed ship as her mansion.",
  "vv-blurbs:vv7": "Offering water to the Noble Sangha will bring much happiness.",
  "vv-blurbs:vv8": "A deva explains the merit accumulated when she offered water to a monk who had fallen.",
  "vv-blurbs:vv9": "A deva explains the merit accumulated when offering light so that others may see.",
  "vv-blurbs:vv10": "Even a small offering of sesame seeds to the Supreme Buddha brings much merit.",
  "vv-blurbs:vv11": "A deva explains the benefits of staying faithful to one’s spouse and being honest.",
  "vv-blurbs:vv12": "A deva explains how keeping the precepts and being a follower of the Supreme Buddha can bring happiness.",
  "vv-blurbs:vv13": "Giving just a single oil cake to the noble Sangha results in much merit. ",
  "vv-blurbs:vv14": "A deva explains how offering a honey covered cake led her to the heavenly Nandana Park.",
  "vv-blurbs:vv15": "Living a restrained life, keeping the precepts, and being generous will only bring good results.",
  "vv-blurbs:vv16": "The wife of King Bimbisara, now a deva, explains her unshakable confidence in the Buddha, the Dhamma, and the Sangha. ",
  "vv-blurbs:vv17": "God Sakka asks what merit helped a deva become as radiant as a Brahma. ",
  "vv-blurbs:vv-cittalatavagga": "",
  "vv-blurbs:vv18": "Only those who do good, wholesome deeds are reborn in heaven.",
  "vv-blurbs:vv19": "A deva explains how she attained the fruit of once returner.",
  "vv-blurbs:vv20": "God Sakka asks Arahant Kassapa about a lady who offered alms to him. ",
  "vv-blurbs:vv21": "The Supreme Buddha with utmost compassion helps a low caste woman before her death.",
  "vv-blurbs:vv22": "The Supreme Buddha asks a deva how she gained a rare tree near her heavenly mansion.",
  "vv-blurbs:vv23": "A deva explains how delighted she was to keep her precepts and give generously.",
  "vv-blurbs:vv24": "A deva explains her regret in not developing her mind further.",
  "vv-blurbs:vv25": "A deva explains the benefits of having unshakable faith in the Triple Gem.",
  "vv-blurbs:vv26": "One can gain much happiness by observing the precepts and giving alms to the Noble Sangha.",
  "vv-blurbs:vv27": "A deva explains how she gained a beautiful body. ",
  "vv-blurbs:vv28": "Offering alms with a happy, pure, and calm mind can bring many benefits. ",
  "vv-blurbs:vv-paricchattakavagga": "",
  "vv-blurbs:vv29": "A deva explains the happiness gained from offering a single oil cake to Arahant Moggallana.",
  "vv-blurbs:vv30": "Offering even a small piece of sugar cane can bring much happiness. ",
  "vv-blurbs:vv31": "A deva explains the happiness one can achieve by being a good wife, following precepts and restraining one’s self. ",
  "vv-blurbs:vv32": "The daughters of God Sakka explain how they gained such happiness as devas.",
  "vv-blurbs:vv33": "Multiple devas discuss the what meritorious actions they did to gain happiness.",
  "vv-blurbs:vv34": "Devas discuss the importance of thinking about the Noble Sanga when giving alms instead of individual monks.",
  "vv-blurbs:vv35": "A deva explains the happiness he gained after offering flowers during the funeral of Arahant Sariputta.",
  "vv-blurbs:vv36": "Can offerings to the Supreme Buddha after his passing away still give good results?",
  "vv-blurbs:vv37": "Following the precepts, leading a restrained life, practicing generosity, and having faith can bring much happiness.",
  "vv-blurbs:vv38": "A deva explains the results of offering a garland of flowers to the Supreme Buddha.",
  "vv-blurbs:vv-manjitthakavagga": "",
  "vv-blurbs:vv39": "A servant offers flowers to the Supreme Buddha and gains much happiness.",
  "vv-blurbs:vv40": "Devas who possess strong confidence in the Supreme Buddha outshine other devas. ",
  "vv-blurbs:vv41": "A deva offers a pair of robes to the Buddha and gains much happiness.",
  "vv-blurbs:vv42": "Offering even a small lump of rice cake to the Supreme Buddha will bring much happiness.",
  "vv-blurbs:vv43": "A deva explains the happiness he gained from offering medicine to the Supreme Buddha.",
  "vv-blurbs:vv44": "Rejoicing at someone else’s meritorious deed can bring much happiness.",
  "vv-blurbs:vv45": "Arahant Moggallana asks four devas what meritorious actions they did to gain such radiant bodies.",
  "vv-blurbs:vv46": "What does one gain when offering a monastery to the order of monks?",
  "vv-blurbs:vv47": "God Sakka asks another deva what meritorious actions he did to gain happiness.",
  "vv-blurbs:vv48": "A deva explains the fruits of giving a small sugar cane to Arahant Moggallana.",
  "vv-blurbs:vv49": "A deva explains how worshiping and honoring monks can lead to much merit.",
  "vv-blurbs:vv50": "A deva tells the story of how she was on the verge of suicide when the compassionate Supreme Buddha helps her. ",
  "vv-blurbs:vv-purisavimana": "",
  "vv-blurbs:vv-maharathavagga": "",
  "vv-blurbs:vv51": "A deva explains of his animal past and how he came to have such powers. ",
  "vv-blurbs:vv52": "When one is greedy, evil and doesn’t keep precepts, what awaits is only suffering. ",
  "vv-blurbs:vv53": "The Supreme Buddha teaches a young boy about going for refuge and the precepts.",
  "vv-blurbs:vv54": "A deva explains the happiness she gained after offering crab soup to the Sangha.",
  "vv-blurbs:vv55": "A deva explains the importance of speaking good words and living with a clean mind.",
  "vv-blurbs:vv56": "Having confidence in the Supreme Buddha is enough to bring much happiness.",
  "vv-blurbs:vv57": "Having confidence in monks is enough to bear great fruit.",
  "vv-blurbs:vv58": "A deva explains how the result of giving is always greater. ",
  "vv-blurbs:vv59": "Offering a needle to an Arahant brought much happiness to a deva. ",
  "vv-blurbs:vv60": "A deva explains the results of offering eight flowers to the stupa of Kassapa Supreme Buddha.",
  "vv-blurbs:vv61": "A deva explains the benefits of following the 5 precepts.",
  "vv-blurbs:vv62": "A man questions a deva on how he gained a divine white elephant.",
  "vv-blurbs:vv63": "A prince near death learns Dhamma from an Arahant and changes his ways to attain a better rebirth.",
  "vv-blurbs:vv64": "A radiant, powerful deva explains how giving to the Supreme Buddha can bring powerful merits.",
  "vv-blurbs:vv-payasivagga": "",
  "vv-blurbs:vv65": "Generosity and confidence when giving alms will bring much happiness.",
  "vv-blurbs:vv66": "A deva explains giving with confident hearts to monks will bring wonderful results.",
  "vv-blurbs:vv67": "What happens when one offers fruits to noble monks?",
  "vv-blurbs:vv68": "Living generously and giving with confident hearts can bring about much happiness.",
  "vv-blurbs:vv69": "What are the results of offering food and lodgings to an Arahant?",
  "vv-blurbs:vv70": "A deva’s gains were bountiful after giving water to a thirsty monk.",
  "vv-blurbs:vv71": "A human who guarded a barley field explains how he became a deva.",
  "vv-blurbs:vv72": "Having confidence and offering food and drinks to Arahants results in many benefits.",
  "vv-blurbs:vv73": "A deva explains the fruit of offering food and drink to Arahants. ",
  "vv-blurbs:vv74": "A deva explains the benefits of offering alms to monks.",
  "vv-blurbs:vv-sunikkhittavagga": "",
  "vv-blurbs:vv75": "What are the results of taking care of one’s parents and having confidence in monks?",
  "vv-blurbs:vv76": "A deva explains the results of taking care of one’s parents and having confidence in monks.",
  "vv-blurbs:vv77": "A deva explains his offerings and the fruits of his labor.",
  "vv-blurbs:vv78": "What are the results of building a monastery and offering it to the Supreme Buddha?",
  "vv-blurbs:vv79": "A deva explains his encounter with Arahant Sāriputta and the meritorious actions he did to achieve happiness.",
  "vv-blurbs:vv80": "A deva explains how the compassion of Arahant Moggallana gave him much happiness.",
  "vv-blurbs:vv81": "What happened to, Kanthaka, the horse, who carried Prince Siddhartha on the day he left his home?",
  "vv-blurbs:vv82": "A deva explains how worshiping the relics of a Buddha can bring much happiness.",
  "vv-blurbs:vv83": "A deva shows a grieving father the way to end his sorrow through Dhamma.",
  "vv-blurbs:vv84": "A deva named Serissaka explains how he came to enjoy a comfortable life and what we can do to achieve the same. ",
  "vv-blurbs:vv85": "Arahant Moggallana asks what meritorious action a deva did to became so powerful."
}